[
  {
    "title": "Filipino Spaghetti Recipe",
    "ingredients": [
      "▢ 1 lb. spaghetti",
      "▢ 1 lb. ground pork",
      "▢ 1 Knorr Pork Cube",
      "▢ 3 tablespoons liver spread",
      "▢ 12 hotdogs sliced",
      "▢ 35 ounces Filipino Style Spaghetti Sauce",
      "▢ 1 tablespoon all-purpose flour",
      "▢ 1 cup water",
      "▢ 1 onion minced",
      "▢ 3 cloves garlic minced",
      "▢ 3 tablespoons cooking oil",
      "▢ Salt and ground black pepper to taste"
    ],
    "instructions": [
      "Cook the Spaghetti noodles (al dente) according to package instructions. Once cooked, Drain the water, and then transfer the spaghetti to a bowl. Cover it and set aside.",
      "Heat the oil in a Pan. Sauté the onion and garlic.",
      "Once the onions soften, add the ground pork. Cook until the color turns light brown.",
      "Add the hotdog. Continue sautéing for 30 seconds.",
      "Add the flour. Continue cooking for 1 minute.",
      "Pour-in the Spaghetti sauce and water into the pan. Stir continuously until the texture of the sauce smoothens. Cover the pan. Let it boil.",
      "Add Knorr Pork Cube. Cook for 15 to 18 minutes or until the sauce gets thick enough.",
      "Add the liver spread and season with salt and ground black pepper as needed.",
      "Add the cooked spaghetti into the pan. Toss until it completely gets coated with the sauce.",
      "Top with shredded cheddar cheese.",
      "Transfer to a serving plate and serve. Share and enjoy!"
    ],
    "cooking_time": "N/A",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/filipino-spaghetti-recipe/",
    "image_url": "",
    "image_path": "",
    "category": "Pork Dishes"
  },
  {
    "title": "Tofu and Broccoli Stir fry",
    "ingredients": [
      "▢ 8 oz. extra firm tofu sliced in 1/2 inch thick pieces",
      "▢ 3 cups sliced broccoli florets",
      "▢ 1 carrot sliced diagonally (optional)",
      "▢ 1 medium onion sliced",
      "▢ 1 teaspoon minced garlic",
      "▢ 1 teaspoon minced ginger",
      "▢ 2 tablespoons oyster sauce",
      "▢ 6 tablespoons cooking oil",
      "▢ Salt and pepper to taste"
    ],
    "instructions": [
      "Heat a pan and then pour-in 4 tablespoons of cooking oil.",
      "When the oil becomes hot, fry both sides of the sliced tofu until the texture becomes crisp (about 8 to 10 minutes per side)",
      "Remove the tofu from the pan and let cool. Slice into smaller rectangular pieces. Set aside.",
      "On a clean frying pan, heat the remaining oil.",
      "Sauté the garlic, ginger, and onion",
      "Add the fried tofu slices along with the oyster sauce. Stir.",
      "Put-in the broccoli florets. Stir and then cook for 5 to 8 minutes.",
      "Add salt and pepper to taste.",
      "Transfer to serving plate.",
      "Serve with rice. Share and enjoy!"
    ],
    "cooking_time": "23 minutes",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/tofu-and-broccoli-stir-fry/",
    "image_url": "",
    "image_path": "",
    "category": "Other Filipino Dishes"
  },
  {
    "title": "Ginisang Puso ng Saging",
    "ingredients": [
      "▢ 1 banana heart",
      "▢ 8 ounces pork thinly sliced",
      "▢ 1 Knorr Pork Cube",
      "▢ 2 ounces vermicelli sotanghon",
      "▢ 1 onion",
      "▢ 3 cloves garlic",
      "▢ ½ cup white vinegar",
      "▢ 5 cups water",
      "▢ 3 tablespoons cooking oil",
      "▢ 1 tablespoon salt",
      "▢ Fish sauce and ground black pepper to taste"
    ],
    "instructions": [
      "Clean the banana heart and slice it into thin pieces. Combine ½ cup vinegar and 1 cup of water in a large bowl. Put the sliced banana heart into the mixture. Rub the salt onto it and soak for 10 to 20 minutes. Drain the liquid mixture and then wring the banana hearts (a chunk at a time) to force the liquid to come out. Set aside.",
      "Soak the vermicelli in 2 cups of water for 12 minutes. Drain the water and then set the vermicelli aside.",
      "Heat the oil in pan. Sauté the garlic and onion until the latter softens.",
      "Add the pork sliced. Continue to cook until it browns.",
      "Pour 1 cup of water into the pan. Cover it and let the water boil. Adjust the heat between low to medium heat setting. Cook until the liquid completely evaporates.",
      "Add the sliced banana hearts. Sauté it for 2 minutes.",
      "Pour the remaining 1 cup of water into the pan. Let it boil. Add Knorr Pork Cube. Cover and cook until the water reduces to half. Note: you can add more water if the banana heart slices needs to be cooked further to soften.",
      "Remove the cover and season with fish sauce and ground black pepper as needed.",
      "Serve with rice. Share and enjoy!"
    ],
    "cooking_time": "N/A",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/ginisang-puso-ng-saging/",
    "image_url": "",
    "image_path": "",
    "category": "Noodles"
  },
  {
    "title": "Panlasang Pinoy Special Pancit Canton",
    "ingredients": [
      "▢ 400 grams pancit canton boiled for 2 minutes.",
      "▢ 1 Knorr Shrimp cube",
      "▢ 12 ounces pork belly",
      "▢ 6 ounces pork liver sliced",
      "▢ 2 Chinese sausage sliced",
      "▢ 5 kikiam",
      "▢ 12 shrimp",
      "▢ 12 quail eggs boiled",
      "▢ 2 cups cabbage sliced",
      "▢ 1 red bell pepper Julienne",
      "▢ 20 long green beans sliced",
      "▢ 1 carrot Julienne",
      "▢ 1 onion sliced",
      "▢ 5 cloves garlic chopped",
      "▢ 1 cup water",
      "▢ ¼ cup soy sauce",
      "▢ 3 ½ tablespoons oyster sauce",
      "▢ 1 teaspoon Sesame oil",
      "▢ 4 cups water",
      "▢ 2 teaspoons cornstarch",
      "▢ 3 tablespoons cooking oil",
      "▢ Salt and ground black pepper to taste"
    ],
    "instructions": [
      "Combine pork liver and milk in a bowl. Marinate for 1 hour. Discard the milk and then rinse the pork liver with water. Set aside.",
      "Boil water in a cooking pot. Add the pork and 1 teaspoon salt. Cover the pot and continue to boil until the pork tenderizes. Remove the pork and slice into thin pieces. Set the pork stock aside.",
      "Clean the shrimp and remove the head and shells. Combine the shell and head of the shrimp with the pork stock. Boil for 2 minutes. Run it through a kitchen sieve to filter the solid parts. Let the stock cool down and combine with cornstarch. Stir. Set it aside.",
      "Heat oil in a large casserole or skillet. Sauté the garlic and onion.",
      "Once the onion softens, add the pork belly, kikiam, and Chinese sausage. Continue sautéing for 2 minutes. Add the pork liver. Cook for 1 ½ minutes.",
      "Pour the oyster sauce. Stir.",
      "Put the vegetables into the skillet starting with the cabbage. Add the long green beans, carrot, and bell pepper. Toss.",
      "Add the shrimp, soy sauce, sesame oil, and stock (from pork and shrimp). Let it boil and then add the Knorr Shrimp Cube. Cook for 3 minutes.",
      "Toss-in the pancit canton. Continue cooking until all the ingredients are well blended.",
      "Season with salt and ground black pepper. Serve. Share and enjoy."
    ],
    "cooking_time": "N/A",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/panlasang-pinoy-special-pancit-canton/",
    "image_url": "",
    "image_path": "",
    "category": "Noodles"
  },
  {
    "title": "How to Cook Chicken Adobo Using Boneless Chicken",
    "ingredients": [
      "▢ 2 lbs. chicken thigh boneless",
      "▢ 6 cloves garlic minced",
      "▢ 1 onion minced",
      "▢ 1 Knorr chicken cube",
      "▢ 4 tablespoons soy sauce",
      "▢ 1 teaspoon oyster sauce",
      "▢ 5 tablespoons vinegar",
      "▢ 2 teaspoons brown sugar",
      "▢ 1 cup water",
      "▢ 3 bay leaves",
      "▢ 3 tablespoons green onion sliced",
      "▢ Salt and ground black pepper to taste"
    ],
    "instructions": [
      "Prepare the chicken by removing the bones. Use a sharp knife and score the meat around the bone until you can easily pull out the bone. You can also remove the skin if preferred.",
      "Crush 3 cloves of garlic and combine with soy sauce, vinegar, sugar, and ¼ teaspoon ground black pepper. Stir and add the chicken. Marinate for at least 1 hour.",
      "Heat oil in a pan. Fry the marinated chicken for 2 minutes per side. Remove the chicken and set aside.",
      "Sauté the onion and remaining garlic. Once the onion softens, add the chicken back into the pan. Sauté for 2 minutes.",
      "Pour the remaining marinade, add oyster sauce, water, and bay leaves, cover and let boil.",
      "Add Knorr Chicken Cube, cook for 30 minutes on low heat setting.",
      "Season with salt and ground black pepper as needed.",
      "Arrange on a serving plate and top with sliced green onions.",
      "Serve. Share and enjoy!"
    ],
    "cooking_time": "N/A",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/how-to-cook-chicken-adobo-using-boneless-chicken/",
    "image_url": "",
    "image_path": "",
    "category": "Chicken Dishes"
  },
  {
    "title": "Easy Chicken Ala King Recipe",
    "ingredients": [
      "▢ 60 grams Knorr Cream of chicken and corn",
      "▢ 1 green bell pepper minced",
      "▢ 1 red bell pepper minced",
      "▢ 2 tablespoons unsalted butter",
      "▢ 2 tablespoons cooking oil",
      "▢ 2 ½ cups water",
      "▢ 6 ounces chicken breast",
      "▢ 1 egg",
      "▢ ¼ cup all-purpose flour",
      "▢ ½ cup Panko breadcrumbs",
      "▢ 1/8 teaspoon salt",
      "▢ 1/8 teaspoon ground black pepper",
      "▢ 1/8 teaspoon garlic powder",
      "▢ 1 cup cooking oil"
    ],
    "instructions": [
      "Prepare the chicken katsu. Flatten the chicken breast by slightly pounding with the flat part of the meat tenderizer tool. Season salt, ground black pepper, and garlic powder all over the chicken.",
      "Heat oil in a pan.",
      "While the oil is heating up, bread the chicken. Dredge it in all-purpose flour. Dip in the beaten egg mixture, dredge in flour again and then dip one more time in beaten egg. Now, roll it over the Panko breadcrumbs making sure that it gets completely coated.",
      "Deep fry the chicken katsu until the color of the breading turns golden brown. Note: if the oil is not enough, you can turn the chicken over to fully cook the opposite side.",
      "Remove the chicken from the pan and arrange in a serving plate. Set aside.",
      "Make the easy chicken ala king sauce by melting the butter in a saucepan. Add the cooking oil.",
      "Once the butter mixture gets hot, add the bell peppers. Saute for 1 ½ minutes.",
      "Combine Knorr Cream of Chicken and Corn and water. Stir until well blended. Pour the mixture into the saucepan. Continue cooking while stirring until the sauce thickens to your desired consistency.",
      "Pour the sauce over the chicken katsu. Serve with rice and Knorr Cream of mushroom soup on the side.",
      "Share and enjoy!"
    ],
    "cooking_time": "N/A",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/easy-chicken-ala-king-recipe/",
    "image_url": "",
    "image_path": "",
    "category": "Chicken Dishes"
  },
  {
    "title": "Nilagang Pata Recipe",
    "ingredients": [
      "▢ 4 lbs. pork hock",
      "▢ 1 Knorr Pork Cube",
      "▢ 3 potatoes quartered",
      "▢ 2 ears sweet corn",
      "▢ ½ head cabbage",
      "▢ 2 bunches  baby bok choy",
      "▢ ½ lb. long green beans",
      "▢ 2 onions quartered",
      "▢ 2 teaspoons whole peppercorn",
      "▢ 8 cups water",
      "▢ Fish sauce to taste"
    ],
    "instructions": [
      "Clean the pork hocks thoroughly. Set aside.",
      "Pour the water into a large cooking pot. Let it boil.",
      "Add the pork hocks. Cover and cook for 10 minutes.",
      "Skim-off the scums from the surface and then add Knorr Pork cube, onion and whole peppercorn. Cover, adjust the heat to the lowest setting. Simmer until the pork tenderizes completely. Note: this can take between 60 to 90 minutes.",
      "Adjust the heat between low and medium setting. Add the corn and potatoes. Cook for 10 minutes.",
      "Add the long green beans, bok choy, and cabbage. Continue boiling for 3 to 5 minutes.",
      "Season with fish sauce. Transfer to a serving bowl. Serve hot with rice.",
      "Share and enjoy!"
    ],
    "cooking_time": "N/A",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/nilagang-pata-recipe-2/",
    "image_url": "",
    "image_path": "",
    "category": "Soups And Stews"
  },
  {
    "title": "Crispy Fried Chicken Recipe",
    "ingredients": [
      "▢ 3 lbs. chicken cut into individual pieces",
      "▢ 1 tablespoon salt",
      "▢ 3 cups cooking oil",
      "▢ 1 cup all-purpose flour",
      "▢ ¾ cup  evaporated milk",
      "▢ 1 Knorr Chicken Cube",
      "▢ 2 eggs",
      "▢ ¾ cups all-purpose flour",
      "▢ 1 teaspoon baking powder",
      "▢ 2 teaspoons garlic powder",
      "▢ ½ teaspoon salt",
      "▢ ¼ teaspoon ground black pepper"
    ],
    "instructions": [
      "Rub salt all over the chicken. Let it stay for 15 minutes.",
      "Heat the oil in a cooking pot.",
      "Prepare the batter. Start by pressing a fork on the chicken cube until it is completely squashed. Combine it with warm milk. Stir until well blended. Set aside.",
      "Combine flour, baking powder, garlic powder, salt, and ground black pepper. Mix well using a fork or a wire whisk. Set aside.",
      "Beat the eggs in a large mixing bowl. Add the milk mixture. Continue to beat until all the ingredients are all incorporated. Add half of flour mixture. Whisk. Add the remaining half and whisk until the texture of the batter becomes smooth.",
      "Dredge the chicken in flour and then dip in batter. Roll it again in flour until completely covered. Fry in medium heat for 7 minutes per side.",
      "Remove from the pot and put in a plate lined with paper towel. This will absorb the oil.",
      "Serve with ketchup or gravy.",
      "Share and enjoy!"
    ],
    "cooking_time": "35 minutes",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/crispy-fried-chicken-recipe/",
    "image_url": "",
    "image_path": "",
    "category": "Chicken Dishes"
  },
  {
    "title": "Beef Empanadas Recipe",
    "ingredients": [
      "▢ 1 lb. ground beef 85% lean",
      "▢ 1/2 cup raisins",
      "▢ 1/2 cup green peas",
      "▢ 1 yellow onion minced",
      "▢ 1/2 cup beef broth",
      "▢ 1 teaspoon salt",
      "▢ 1/2 teaspoon paprika",
      "▢ 1/2 teaspoon ground black pepper",
      "▢ 1 teaspoon granulated white sugar",
      "▢ 2 tablespoons cooking oil",
      "▢ 3 cups AP flour",
      "▢ 1 cup unsalted butter cold, cut into 8 parts",
      "▢ 1/2 teaspoon baking powder",
      "▢ 1/2 teaspoon salt",
      "▢ 3 tablespoons granulated white sugar",
      "▢ 6 tablespoons ice cold water",
      "▢ 3 cups cooking oil for frying"
    ],
    "instructions": [
      "Make the filing by heating 2 tablespoons of cooking oil in a pan.",
      "Saute the onion and then add the ground black pepper.",
      "Put-in the beef and then cook for 5 minutes.",
      "Add the raisins, paprika, sugar, and salt. Stir and then pour-in the beef broth.",
      "Cover and then simmer for 10 to 15 minutes.",
      "Remove the cover and let the liquid evaporate.",
      "Add the green peas.Stir and then cook for 2 minutes.",
      "Turn-off the heat. Set aside.",
      "Prepare the dough by placing the salt, AP flour, baking powder, and sugar in a mixing bowl. Use a wire whisk to mix the ingredients.",
      "Put the butter pieces in the mixing bowl along with the cold water. Mix using a pastry blender. If you don’t have one, use 2 kitchen knives instead. You should mix like you are cutting the dough in several pieces.",
      "Grab about 3 tablespoons of the mixture and then shape it into a ball. do this until all the dough is consumed.",
      "Refrigerate the dough balls for about 20 to 25 minutes.",
      "Flatten the dough ball by gently pressing the center with your hand against a clean flour-dusted flat surface. Use a rolling pin to spread the dough and make a flat circle about 4 to 5 inches in diameter.",
      "Arrange about 4 to 5 tablespoons of filling in the middle of the dough. Lock the edges by folding or by pressing the tip of a fork in both sides.",
      "Meanwhile, heat about 2 to 3 cups of oil in a cooking pot. Deep fry the empanadas for about 3 to 5 minutes or until the color turns golden brown.",
      "Remove from the cooking pot and then arrange in a plate lined with paper towels. Let the excess oil drip-off.",
      "Transfer to a serving plate.",
      "Serve. Share and enjoy!"
    ],
    "cooking_time": "40 minutes",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/beef-empanadas-recipe/",
    "image_url": "",
    "image_path": "",
    "category": "Other Filipino Dishes"
  },
  {
    "title": "Laing Fried Rice Recipe",
    "ingredients": [
      "▢ 5 cups white rice preferably leftovers",
      "▢ 1 cup laing cooked",
      "▢ 6 cloves garlic crushed",
      "▢ 4 tablespoons cooking oil",
      "▢ ½ cup toasted anchovies tustadong dilis",
      "▢ 1/4 teaspoon salt",
      "▢ 3 chili peppers optional"
    ],
    "instructions": [
      "Combine salt and rice in a bowl. Gently mix until well blended.",
      "Heat the oil in a wide pan.",
      "Add the garlic once the oil gets hot. Cook until light brown.",
      "Put the laing in the pan. Stir and cook for 2 minutes.",
      "Add the rice. Continue to cook for 5 to 8 minutes. Stir fry the rice until it blends well with the rest of the ingredients.",
      "Add the toasted anchovies. Stir and cook for 1 minute.",
      "Transfer to a serving plate. Top with red chili.",
      "Serve. Share and enjoy!"
    ],
    "cooking_time": "20 minutes",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/laing-fried-rice/",
    "image_url": "",
    "image_path": "",
    "category": "Other Filipino Dishes"
  },
  {
    "title": "Chili Ginger Chicken",
    "ingredients": [
      "▢ 1 lb. boneless chicken breast sliced into serving pieces",
      "▢ ¾ cup all-purpose flour",
      "▢ 3 tablespoons cornstarch",
      "▢ 2 eggs beaten",
      "▢ 1 red bell pepper sliced",
      "▢ 1 Thai chili pepper chopped",
      "▢ 6 long green beans cut into 2-inch pieces",
      "▢ 2 tablespoons green onion chopped",
      "▢ 3 thumbs ginger minced",
      "▢ 2 cloves garlic minced",
      "▢ 1 cup cooking oil",
      "▢ Salt and ground black pepper to taste",
      "▢ 1 ½ teaspoons Good Life Sesame Oil",
      "▢ ¼ cup soy sauce",
      "▢ 2 tablespoons honey",
      "▢ 4 tablespoons sweet chili sauce",
      "▢ 2 teaspoons white vinegar",
      "▢ 2 tablespoons tomato ketchup",
      "▢ ¼ cup water",
      "▢ 2 tablespoons cornstarch"
    ],
    "instructions": [
      "Sprinkle salt and pepper on the sliced chicken. Toss until the seasonings are well distributed.",
      "Bread the chicken. Start by combining flour and cornstarch in a bowl. Mix well. Dredge the chicken in the flour mixture and then dip it in the beaten egg. Dredge it again into the flour mixture. Arrange on a clean plate.",
      "Combine all the sauce ingredients in a bowl. Mix until the texture smoothens. Set aside.",
      "Heat the oil in a wok. Fry the breaded chicken until it turns golden brown. Set aside.",
      "Heat 3 tablespoons of cooking oil in a clean wok. Sauté ginger and garlic for 30 seconds.",
      "Add green beans, chili pepper, and bell pepper. Sauté for 1 minute.",
      "Put the breaded chicken into the wok. Toss.",
      "Pour the sauce. Stir and continue to cook until it thickens.",
      "Transfer the chicken in a serving plate. Serve with rice.",
      "Share and enjoy!"
    ],
    "cooking_time": "N/A",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/chili-ginger-chicken/",
    "image_url": "",
    "image_path": "",
    "category": "Chicken Dishes"
  },
  {
    "title": "Kangkong and Ground Pork with Oyster Sauce Stir Fry",
    "ingredients": [
      "▢ ¾ lbs. water spinach see note 1",
      "▢ ¼ lb. ground pork see note 2",
      "▢ 3 tablespoons oyster sauce",
      "▢ 1 onion minced",
      "▢ 1 head  garlic crushed",
      "▢ ¼ cup water",
      "▢ 8 tablespoons cooking oil",
      "▢ Salt and Ground Black Pepper to taste"
    ],
    "instructions": [
      "Brown the garlic by slowly frying it in oil until it turns golden brown. Do this by heating the oil in a pan. After around 20 seconds, add the crushed garlic. Stir and fry using a low to medium heat setting until it browns. Separate the garlic with the oil. Set aside. Note: This is an optional step. The browned garlic can be used as a topping or condiment for this dish and for other dishes too.",
      "Using 3 tablespoons of the oil used to fry the garlic, Saute the onion until it softens.",
      "Add the ground pork. Sauté for 3 to 5 minutes or until the pork turns light brown.",
      "Add oyster sauce and water. Stir and cook until the water evaporates completely.",
      "Put the water spinach stalks into the pan. Stir fry for 2 minutes.",
      "Add the water spinach leaves and a portion of the browned garlic. Cook for 1 minute. Note: you may add up to ½ cup of water if you like this with a bit of sauce.",
      "Season with salt and ground black pepper. Arrange on a serving plate and top with more browned garlic.",
      "Serve with rice. Share and enjoy!"
    ],
    "cooking_time": "N/A",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/kangkong-and-ground-pork-with-oyster-sauce-stir-fry/",
    "image_url": "",
    "image_path": "",
    "category": "Pork Dishes"
  }
]