[
  {
    "title": "Sinarsahang Manok",
    "ingredients": [
      "▢ 1 ½ lbs. chicken cut into serving pieces",
      "▢ 1 piece bell pepper Julienne",
      "▢ 1 piece Knorr Chicken Cube",
      "▢ ½ cup green peas",
      "▢ 6 pieces long green beans sliced",
      "▢ 1 piece onion chopped",
      "▢ 3 cloves garlic chopped",
      "▢ 1 piece tomato diced",
      "▢ 3 tablespoons soy sauce",
      "▢ 8 ounces tomato sauce",
      "▢ 1 ½ cups water",
      "▢ ½ cup tomato ketchup",
      "▢ ½ teaspoon white sugar",
      "▢ Salt and ground black pepper to taste",
      "▢ ¼ cup cooking oil"
    ],
    "instructions": [
      "Heat 2 tablespoons of oil in a pan. Sauté the bell pepper, green peas, and long green beans for 45 seconds. Remove from the pan and set aside.",
      "Add remaining oil. Once oil becomes hot, pan-fry chicken pieces for 3 minutes per side. Remove chicken from the pan and place on a clean plate. Set aside.",
      "Sauté garlic, onion, and tomato using the remaining oil. Add soy sauce, tomato sauce, and water once the onion softens. Let it boil.",
      "Add Knorr chicken cube and then put the chicken piece back into the pan. Cover the pan and continue cooking the chicken using medium heat for 15 minutes. Remove the cover and cook until the sauce becomes thick.",
      "Add back the stir-fried vegetables.",
      "Season with sugar, salt, and ground black pepper. Transfer to a serving plate. Serve!"
    ],
    "cooking_time": "N/A",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/sinarsahang-manok/",
    "image_url": "",
    "image_path": "",
    "category": "Chicken Dishes"
  },
  {
    "title": "Chopsuey with Chicken and Broccoli",
    "ingredients": [
      "▢ 4 ounces chicken breast sliced",
      "▢ 1 piece Knorr Chicken Cube",
      "▢ 1 1/2 cups broccoli florets",
      "▢ 1 ½ cups cauliflower florets",
      "▢ 2 pieces carrot sliced crosswise",
      "▢ 12 pieces snow peas",
      "▢ 2 cups cabbage chopped",
      "▢ 1 piece red bell pepper sliced",
      "▢ 1 piece green bell pepper sliced",
      "▢ 12 pieces quail eggs boiled",
      "▢ 14 ounces young corn",
      "▢ 1 cup water",
      "▢ 5 cloves garlic chopped",
      "▢ 1 piece onion sliced",
      "▢ 2 tablespoons soy sauce",
      "▢ 2 tablespoons oyster sauce",
      "▢ 1 tablespoon cornstarch diluted in ¾ cup water",
      "▢ 3 tablespoons cooking oil",
      "▢ Salt and ground black pepper to taste"
    ],
    "instructions": [
      "Heat oil on a pan. Saute onion until layers separate.",
      "Add garlic. Continue sautéing until the onion starts to soften.",
      "Add chicken, stir fry until the outer part turns light brown.",
      "Pour soy sauce, oyster sauce, and water. Stir. Cover the pan and let the liquid boil.",
      "Add Knorr Chicken Cube. Stir. Cover and cook using medium heat until the sauce reduces to half.",
      "Add the carrot. Cook for 3 minutes.",
      "Pour the cornstarch and water mixture. Stir.",
      "Add your corn, cauliflower, bell pepper, broccoli, snow peas, and cabbage. Toss. Cover and cook for 1 ½ minutes.",
      "Toss and season with ground black pepper and salt.",
      "Add boiled quail eggs.",
      "Transfer to a serving plate. Serve. Share and enjoy!"
    ],
    "cooking_time": "N/A",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/chopsuey-with-chicken-and-broccoli/",
    "image_url": "",
    "image_path": "",
    "category": "Vegetable Dishes"
  },
  {
    "title": "No Oven Baked Macaroni (Filipino Style)",
    "ingredients": [
      "▢ 1 lb. elbow macaroni",
      "▢ 1 lb. ground beef",
      "▢ 1 piece Knorr Beef Cube",
      "▢ 3 pieces hotdogs sliced crosswise",
      "▢ 4 ounces ham chopped",
      "▢ 16 ounces tomato sauce",
      "▢ 1 1/4 cups banana ketchup",
      "▢ 1 piece onion chopped",
      "▢ 3 cloves garlic chopped",
      "▢ 3 tablespoons all-purpose cream optional",
      "▢ 1 piece red bell pepper chopped",
      "▢ 1 cup cheddar cheese shredded",
      "▢ 1 1/2 tablespoons white sugar",
      "▢ 2 ½ cups water",
      "▢ Salt and ground black pepper to taste",
      "▢ 3 tablespoons cooking oil"
    ],
    "instructions": [
      "Cook the elbow macaroni based on package instructions. Set aside.",
      "Prepare the sauce by heating oil in a cooking pot. Add ground beef. Continue to brown the beef until enough oil gets extracted. (note: scoop off the oil).",
      "Add onion and garlic. Continue sauteing until the onion softens.",
      "Add hotdogs and ham.",
      "Pour tomato sauce and water. Stir. Cover the pot and let the liquid boil.",
      "Add Knorr Beef Cube. Continue cooking uncovered using low to medium heat until the liquid reduces to half.",
      "Add banana ketchup and half of the chopped red bell pepper. Stir.",
      "Add ½ cup shredded cheese and all-purpose cream. Season with sugar, salt, and ground black pepper. Stir and continue cooking until the sauce becomes thick.",
      "Combine the cooked macaroni and sauce. Gently fold until well blended.",
      "Arrange the macaroni with sauce on a baking tray. Top with remaining cheese and bell pepper.",
      "Broil in 350F for 20 minutes using a turbo broiler. Serve warm. Share and enjoy!"
    ],
    "cooking_time": "N/A",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/no-oven-baked-macaroni-filipino-style/",
    "image_url": "",
    "image_path": "",
    "category": "Other Filipino Dishes"
  },
  {
    "title": "Pata Estofado",
    "ingredients": [
      "▢ 2 lbs. pork pata boiled for 15 minutes",
      "▢ 1 piece Knorr Pork Cube",
      "▢ 2 pieces banana sliced",
      "▢ 1 piece carrot. sliced",
      "▢ 8 tablespoons brown sugar",
      "▢ 5 tablespoons soy sauce",
      "▢ 5 tablespoons white vinegar",
      "▢ 3 cloves garlic chopped",
      "▢ 3 pieces dried bay leaves",
      "▢ 1 teaspoon whole peppercorn",
      "▢ 4 cups water",
      "▢ 4 tablespoons cooking oil"
    ],
    "instructions": [
      "Heat oil in a pan. Add bananas and fry each side until it turns brown. Remove from the pan and set aside.",
      "Pan fry the pork pata on the same pan for 3 minutes per side.",
      "Add garlic directly over the oil. Stir.",
      "Add brown sugar. Stir and continue cooking until the sugar melts.",
      "Pour soy sauce, vinegar, and water into the pot. Cover and let boil.",
      "Add Knorr Pork cube, whole peppercorn, and dried bay leaves. Stir. Cover the pot and continue boiling the pata in low heat until tender (around 40 minutes).",
      "Turn the pork pata over. Cover the pot once more and boil for 30 to 40 minutes.",
      "Add the carrot and fried bananas. Cover and cook for 5 minutes.",
      "Transfer to a serving plate. Serve. Share and enjoy!"
    ],
    "cooking_time": "N/A",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/pata-estofado/",
    "image_url": "",
    "image_path": "",
    "category": "Pork Dishes"
  },
  {
    "title": "Killer Pork Sinigang",
    "ingredients": [
      "▢ 2 lbs. Pork belly cubed",
      "▢ 66 g. Knorr Sinigang sa Sampaloc Mix with Gabi",
      "▢ 2 pieces talong sliced",
      "▢ 8 pieces okra",
      "▢ 18 pieces string beans cut in 2-inch pieces",
      "▢ 5 ounces daikon radish (labanos) sliced",
      "▢ 1 bunch  kangkong",
      "▢ 1 piece onion wedged",
      "▢ 2 pieces tomato wedged",
      "▢ 6 pieces shishito pepper",
      "▢ 8 cups water",
      "▢ Fish sauce and ground black pepper to taste",
      "▢ 3 tablespoons cooking oil"
    ],
    "instructions": [
      "Heat oil in a cooking pot. Saute onion until layers separate. Add half of the tomato. Saute for 2 minutes.",
      "Add pork belly. Continue sauteeing until the pork browns while adding around 1 tablespoon fish sauce.",
      "Pour water. Cover the pot and let the liquid boil.",
      "Add Knorr Sinigang sa Sampaloc with Gabi. Cover and adjust heat between low to medium. Cook for 30 minutes or until the pork gets tender.",
      "Add labanos. Cover and continue cooking for 30 minutes.",
      "Add eggplant, string beans, and okra. Cook for 5 minutes.",
      "Add kangkong stalks and remaining tomato. Cook for 3 minutes.",
      "Season with fish sauce (as needed) and ground black pepper."
    ],
    "cooking_time": "N/A",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/killer-pork-sinigang/",
    "image_url": "",
    "image_path": "",
    "category": "Seafood"
  },
  {
    "title": "Pork Chao Fan",
    "ingredients": [
      "▢ 6 ounces ground pork or grilled pork belly",
      "▢ 4 cups rice leftover",
      "▢ ½ cup carrot chopped",
      "▢ ¾ cup green peas",
      "▢ 1 piece onion minced",
      "▢ 2 pieces eggs beaten",
      "▢ ½ cup green onions chopped",
      "▢ 2 tablespoons hoisin sauce",
      "▢ 1 tablespoon soy sauce",
      "▢ 1 teaspoon Sesame oil",
      "▢ Salt and ground white pepper to taste",
      "▢ 5 tablespoons cooking oil"
    ],
    "instructions": [
      "Heat oil in a wok. Add beaten eggs. Fry until eggs are fully cooked. Remove eggs from the pan. Set aside.",
      "Sauté onion using remaining oil until it softens.",
      "Add ground pork. Cook while stirring until pork turns medium brown.",
      "Pour soy sauce, Sesame oil, and hoisin sauce into the wok. Stir.",
      "Add carrots and leftover rice. Stir-fry for 2 minutes. Toss until all ingredients are well distributed.",
      "Add green peas and green onions. Cook for 1 minute.",
      "Add the chopped fried egg and then season with salt and ground white pepper.",
      "Serve warm. Share and enjoy!"
    ],
    "cooking_time": "N/A",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/pork-chao-fan/",
    "image_url": "",
    "image_path": "",
    "category": "Pork Dishes"
  },
  {
    "title": "Baked Macaroni Recipe",
    "ingredients": [
      "▢ 1 lb elbow macaroni uncooked",
      "▢ 3 tablespoon butter",
      "▢ 1 lb ground beef",
      "▢ 1 ½ cup tomatoes diced (in can)",
      "▢ 1 piece onions diced",
      "▢ 1/2 cup green bell pepper diced",
      "▢ 1/2 cup tomato paste",
      "▢ 1 teaspoon paprika",
      "▢ 1 piece beef cube",
      "▢ 1 cup water",
      "▢ 1 tablespoon sugar",
      "▢ Salt and pepper to taste",
      "▢ 3 tbsp butter",
      "▢ 3 tbsp all-purpose flour",
      "▢ 2 cups fresh milk",
      "▢ 1/4 teaspoon salt",
      "▢ 1 ounce parmesan cheese grated",
      "▢ 2 ounces sharp cheddar cheese grated"
    ],
    "instructions": [
      "Prepare the elbow macaroni according to instructions in the package and intentionally cut the cooking time so that the macaroni is not well done (the macaroni will be fully cooked once baked) then drain and set aside.",
      "Prepare the meat sauce by heating a cooking pot and melt-in the butter.",
      "When the butter is hot enough, add the ground beef and cook for 5 minutes or until the color turns medium brown.",
      "Add the onion, green bell pepper, and diced tomatoes then stir and simmer for 3 minutes or until the vegetables are soft.",
      "Add the tomato paste and paprika then stir and cook for a minute",
      "Add the beef cube and water then stir until everything is well distributed. Simmer for 20 minutes.",
      "Put-in the sugar, salt, and pepper then mix well. Turn of the heat and set aside.",
      "Prepare the Mornay sauce by melting the butter in a sauce pan over medium heat.",
      "Add the flour stir constantly for about a minute (color must be yellowish and not brown).",
      "Slowly whisk in the milk and continue to whisk until the sauce thickens and comes to a boil.",
      "Add salt and pepper then simmer for 2 to 3 minutes.",
      "Stir in the cheeses and whisk until melted. Set aside",
      "Combine the cooked macaroni and meat sauce in a baking dish then toss until the meat sauce is well distributed.",
      "Arrange the macaroni and pour the Mornay sauce over it. (Spread the Mornay sauce over the macaroni and meat sauce mixture ensuring that every space is covered)",
      "Preheat oven to 350 degrees Fahrenheit and bake for about 15 to 20 minutes.",
      "Remove from the oven and allow to cool down a bit.",
      "Serve hot. Share and Enjoy!"
    ],
    "cooking_time": "45 minutes",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/how-to-make-pasta-cheese-baked-macaroni-recipe/",
    "image_url": "",
    "image_path": "",
    "category": "Other Filipino Dishes"
  },
  {
    "title": "Ketchup Fried Chicken",
    "ingredients": [
      "▢ 3 pieces chicken leg quarters",
      "▢ 5 tablespoons soy sauce",
      "▢ 5 tablespoons white vinegar",
      "▢ 3 pieces dried bay leaves",
      "▢ 2 teaspoons whole peppercorn",
      "▢ 5 cloves garlic crushed",
      "▢ 2 cups lemon lime soda",
      "▢ 1 cup banana ketchup",
      "▢ 1 cup cooking oil"
    ],
    "instructions": [
      "Combine all the ingredients in a cooking pot, except for the oil. Stir until well blended. Cover the pot and let the liquid boil. Adjust heat between low to medium. Continue boiling for 10 minutes.",
      "Turn the chicken over. Continue boiling the opposite for another 10 minutes while leaving the pot uncovered.",
      "Remove chicken and let it cool down. Save the remaining liquid as a sauce.",
      "Rub salt all over the chicken. Let it air dry for 30 minutes.",
      "Heat oil in a pan. Fry the chicken on medium heat until brown. Turn the chicken over and do the same to the other side.",
      "Remove chicken from the pan. Arrange on a serving plate. Serve with rice and ketchup sauce (remaining liquid used to boil the chicken). Share and enjoy!"
    ],
    "cooking_time": "N/A",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/ketchup-fried-chicken/",
    "image_url": "",
    "image_path": "",
    "category": "Chicken Dishes"
  },
  {
    "title": "How to Cook Dinuguan Using Sinigang Mix",
    "ingredients": [
      "▢ 2 lbs. pork cubed",
      "▢ 22 grams Knorr Sinigang sa Sampaloc Mix Original",
      "▢ 10 ounces pork blood",
      "▢ 1 piece onion chopped",
      "▢ 2 thumbs  ginger chopped",
      "▢ 5 cloves garlic chopped",
      "▢ 3 tablespoons cooking oil",
      "▢ 4 pieces dried bay leaves",
      "▢ 3 pieces long green pepper",
      "▢ 2 tablespoons sugar",
      "▢ Ground black pepper to taste"
    ],
    "instructions": [
      "Heat oil in a wok. Saute onion, garlic, and ginger until the onion softens.",
      "Add pork. Saute until the color of the outer part turns light brown.",
      "Add Knorr Sinigang sa Sampaloc Mix. Stir.",
      "Add Knorr Pork Cube and dried bay leaves.",
      "Pour soy sauce and water. Cover and let boil. Continue boiling using low to medium heat for 35 minutes.",
      "Add long green pepper and pour the pork blood into the wok. Stir and cook for 5 to 8 minutes.",
      "Season with ground black pepper and sugar (note: you can add salt if needed). Serve warm. Share and enjoy!"
    ],
    "cooking_time": "N/A",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/how-to-cook-dinuguan-using-sinigang-mix/",
    "image_url": "",
    "image_path": "",
    "category": "Seafood"
  },
  {
    "title": "Laswa Recipe",
    "ingredients": [
      "▢ 8 pieces shrimp cleaned",
      "▢ 2 pieces Chinese eggplant sliced",
      "▢ 1 1/2 cups kalabasa squash diced",
      "▢ 15 pieces string beans cut into 2 inch pieces",
      "▢ 1 cup saluyot leaves",
      "▢ 2 cups alugbati",
      "▢ 1 cup Amaranth leaves (kulitis)",
      "▢ 8 pieces okra",
      "▢ 2 pieces tomato wedged",
      "▢ 1 piece onion wedged",
      "▢ 2 teaspoons bagoong alamang or guinamos",
      "▢ 5 cups water",
      "▢ Salt and ground black pepper to taste"
    ],
    "instructions": [
      "Boil water in a cooking pot.",
      "Add onion and tomato. Cover and boil for 5 minutes using medium heat.",
      "Add kalabasa and bagoong alamang. Boil for 5 minutes.",
      "Add eggplant, string beans, and okra. Cook for 4 to 5 minutes.",
      "Put shrimp into the pot. Cover and cook for 1 minute.",
      "Add saluyot, amaranth leaves (kulitis), and alugbati. Stir.",
      "Season with salt and ground black pepper. Serve with fried fish on the side. Share and enjoy!"
    ],
    "cooking_time": "30 minutes",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/laswa-recipe/",
    "image_url": "",
    "image_path": "",
    "category": "Seafood"
  },
  {
    "title": "Chicken Barbecue",
    "ingredients": [
      "▢ 4 pieces chicken leg quarters cleaned",
      "▢ 1/2 cup soy sauce",
      "▢ 1 piece lemon or 4 pieces calamansi",
      "▢ 2 teaspoons salt",
      "▢ 1 teaspoon ground black pepper",
      "▢ 1/2 cup banana ketchup"
    ],
    "instructions": [
      "Make the marinade by combining the soy sauce, juice of 1 lemon, banana ketchup, salt, and ground black pepper in a bowl. Stir to mix.",
      "Put the chicken leg quarters inside a large freezer bag, and then pour-in the marinade.",
      "Shake the bag gently to coat the chicken with marinade then remove the air inside the bag. Seal the bag then refrigerate overnight.",
      "Remove the chicken from the bag and transfer the remaining marinade to a bowl.",
      "Heat-up your grill and start grilling the chicken under medium heat for 12 to 15 minutes per side or until the chicken is completely cooked. Do not forget to baste the chicken with the remaining marinade mixture.",
      "Note: Chicken takes a long time to cook. Grilling it in high heat will cause the outer part of the chicken to cook earlier leaving the inside raw.",
      "Remove from the grill and transfer to a serving plate.",
      "Serve with steamed rice.",
      "Share and enjoy!"
    ],
    "cooking_time": "1 hour",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/chicken-barbecue-recipe/",
    "image_url": "",
    "image_path": "",
    "category": "Chicken Dishes"
  },
  {
    "title": "Java Rice with Pork Chop",
    "ingredients": [
      "▢ 1 1/2 cups rice uncooked (washed)",
      "▢ 1 piece Knorr Pork Cube",
      "▢ 1/4 teaspoon turmeric powder",
      "▢ 2 tablespoons onion minced",
      "▢ 1 clove garlic minced",
      "▢ 1/2 teaspoon sugar",
      "▢ 3 tablespoons annatto oil",
      "▢ 2 cups water",
      "▢ 2 tablespoons margarine",
      "▢ Salt to taste",
      "▢ 4 pieces pork chops",
      "▢ 2 pieces egg beaten",
      "▢ 1 cup all-purpose flour",
      "▢ 1/8 teaspoon baking powder",
      "▢ 1/2 teaspoon onion powder",
      "▢ 1/2 teaspoon garlic powder",
      "▢ ½ cup cooking oil",
      "▢ 4 cups water cold",
      "▢ 1/4 cup salt",
      "▢ 4 pieces dried bay leaves"
    ],
    "instructions": [
      "Prepare the pork chop by combining all brine ingredients in a large bowl. Mix well. Add pork chop in the brine solution and brine for 7 hours. Note: Cover the bowl and place it inside the refrigerator to avoid contamination.",
      "Make the Java rice by combining washed rice and water in a cooking pot. Let the mixture boil. Add Knorr Pork Cube. Stir until well blended. Cover the pot and adjust heat between low to medium. Continue cooking until rice is done. Remove the cover from the pot and let the rice cool down.",
      "Once the rice cools down completely, heat annatto oil on a pan and then add margarine. Sauté garlic and onion until the latter softens.",
      "Add cooked rice. Stir-fry for 2 minutes.",
      "Add turmeric powder and season with sugar and salt as needed. Set aside.",
      "Start cooking the pork chop by heating oil on a clean pan.",
      "Combine flour, garlic powder, onion powder, and baking soda in a resealable bag. Seal and shake.",
      "Place a piece of brined pork chop in the bag and shake. Dip it in beaten egg and then put it back into the bag and shake until well coated.",
      "Fry one side in medium heat until it turns golden brown. Turn the pork over and do the same to the other side. Note: perform this step on all pork chops.",
      "Arrange a cup of Java rice with a piece of pork chop on a plate. Serve with papaya atchara. Share and enjoy!"
    ],
    "cooking_time": "N/A",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/java-rice-with-pork-chop/",
    "image_url": "",
    "image_path": "",
    "category": "Pork Dishes"
  }
]