[
  {
    "title": "Kilawing Kambing Recipe (Chopped Goatskin Kilawin)",
    "ingredients": [
      "▢ 1 lb. goatskin",
      "▢ 6 pieces spicy Thai chili",
      "▢ 1 ½ tablespoons minced fresh ginger",
      "▢ 1 medium red onion minced",
      "▢ 6 to 10 tablespoons coconut vinegar or white vinegar",
      "▢ 4 cups water",
      "▢ 4 pieces dried bay leaves",
      "▢ Salt and ground black pepper to taste"
    ],
    "instructions": [
      "Pour water in a cooking pot. Bring to a boil.",
      "Add the bay leaves and goatskin. Cover and boil in low heat for 60 minutes or until the skin gets tender.",
      "Remove the tender skin from the cooking pot and discard the water. Let it cool down and then chop into small pieces. Set aside.",
      "In a large glass or plastic bowl, combine chili, ginger, onion, and vinegar. Mix well.",
      "Add the chopped goat. Toss to mix all the ingredients.",
      "Add salt and pepper according to your taste preference. Toss one more time to ensure that the salt and pepper blends well.",
      "Cover the bowl with a clear plastic wrap, or simply with a wide plate. Refrigerate for 3 hours.",
      "Transfer to a serving platter. Serve.",
      "Share and enjoy!"
    ],
    "cooking_time": "3 hours",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/kilawing-kambing-recipe/",
    "image_url": "",
    "image_path": "",
    "category": "Other Filipino Dishes"
  },
  {
    "title": "Tinapa Fried Rice (Smoked Fish Fried Rice)",
    "ingredients": [
      "▢ 4 cups leftover white rice",
      "▢ 3/4 to 1 cup tinapa flakes",
      "▢ 2 pieces alter duck eggs sliced",
      "▢ 2 medium plum tomato cubed",
      "▢ 1/2 cup chopped green onions",
      "▢ 6 cloves crushed garlic",
      "▢ 1 teaspoon salt",
      "▢ 4 to 5 tablespoons cooking oil"
    ],
    "instructions": [
      "Combine salt and leftover rice. Toss to mix well. Set aside.",
      "Heat oil in a large pan. Add the garlic and cook until light brown. Add the tinapa flakes. Cook for 3 minutes.",
      "Slowly add the rice. Stir fry for 2 to 5 minutes or until all the ingredients are well blended.",
      "Add the ground black pepper and chopped green onions. Toss and stir fry for another 3 to 5 minutes.",
      "Transfer to serving plate. Top with sliced salted eggs and cubed tomatoes.",
      "Serve. Share and enjoy!"
    ],
    "cooking_time": "20 minutes",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/tinapa-fried-rice-smoked-fish-fried-rice/",
    "image_url": "",
    "image_path": "",
    "category": "Seafood"
  },
  {
    "title": "Sigarilyas Gising Gising Recipe",
    "ingredients": [
      "▢ 10 pieces winged bean sigarilyas, sliced crosswise",
      "▢ 2 cups coconut milk",
      "▢ 1 medium red onion sliced",
      "▢ 5 cloves garlic crushed and chopped",
      "▢ 1/2 lb. ground pork",
      "▢ 6 pieces long green peppers siling pansigang",
      "▢ 3 tablespoons fish sauce",
      "▢ 1/8 teaspoon ground black pepper",
      "▢ 3 tablespoons cooking oil"
    ],
    "instructions": [
      "Heat the oil in a deep pan.",
      "Once the oil is hot, saute the garlic and onion. Continue to cook until the onion starts to soften.",
      "Add the ground pork. Saute for 5 minutes or until the pork turns brown.",
      "Pour the coconut milk in the pan and let boil. Stir and add the sigarilyas and long green peppers. Cover and adjust the heat to low. cook for 30 to 35 minutes or until the liquid reduces in half.",
      "Remove the cover and add fish sauce and ground black pepper. Stir and cook for a few more minutes until the coconut milk reduces, but do not let the liquid evaporate totally.",
      "Transfer to a serving plate. Serve!",
      "Share and enjoy!"
    ],
    "cooking_time": "55 minutes",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/sigarilyas-gising-gising-recipe/",
    "image_url": "",
    "image_path": "",
    "category": "Vegetable Dishes"
  },
  {
    "title": "Beef in Oyster Sauce Stir Fry with Ampalaya",
    "ingredients": [
      "▢ 1/2 lb beef sirloin sliced into thin strips",
      "▢ 1 medium bitter gourd ampalaya, cored and sliced",
      "▢ 2 tablespoons soy sauce",
      "▢ 2 tablespoons sherry or shaoxing cooking wine",
      "▢ 1 tablespoon cornstarch",
      "▢ 3 tablespoons oyster sauce",
      "▢ 1 teaspoon Sesame oil",
      "▢ 1/4 teaspoon ground black pepper",
      "▢ 4 tablespoons cooking oil"
    ],
    "instructions": [
      "Combine beef, soy sauce, cooking wine, Sesame oil, and ground black pepper. Mix well.",
      "Add cornstarch to the mixture. Continue to mix until all the ingredients are well blended. Set aside.",
      "Heat 3 tablespoons of cooking oil in a pan or wok. Once the oil gets hot, stir-fry the beef slices for 4 to 6 minutes or until the beef turns brown. Remove the stir fried beef from the pan and place in a clean plate.",
      "Using the same pan, add the remaining cooking oil. Add the bitter gourd (ampalaya) slices and stir-fry for 2 minutes.",
      "Pour-in the oyster sauce. Continue to stir-fry for 30 seconds.",
      "Add the stir-fried beef. Cook for 1 minute more.",
      "Transfer to a serving plate. Serve with warm rice.",
      "Share and enjoy!"
    ],
    "cooking_time": "25 minutes",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/beef-in-oyster-sauce-stir-fry-with-ampalaya/",
    "image_url": "",
    "image_path": "",
    "category": "Other Filipino Dishes"
  },
  {
    "title": "Lechon Carajay Recipe",
    "ingredients": [
      "▢ 2 lbs. pork belly",
      "▢ 6 pieces dried bay leaves",
      "▢ 6 cloves garlic peeled",
      "▢ 1 medium red onion sliced",
      "▢ 6 teaspoons salt",
      "▢ 1/2 tablespoon garlic powder",
      "▢ 1/2 teaspoon ground black pepper",
      "▢ 5 to 6 cups water",
      "▢ 4 to 5 cups cooking oil for deep frying"
    ],
    "instructions": [
      "In a cooking pot, bring water to a boil.",
      "Put-in the garlic, onion, dried bay leaves, and 3 teaspoons of salt. Let boil for 3 minutes.",
      "Add the pork belly. Cover and boil in medium heat for 40 minutes.",
      "Remove the boiled pork belly from the cooking pot and place in a clean plate. Let it cool down for a few minutes.",
      "Rub the remaining salt along with the garlic powder and ground black pepper all over the belly slices. Cover the belly and refrigerate for at least 2 hours (this will let the meat absorb the flavors from the rub).",
      "Heat cooking oil in a large cooking pot or a deep fryer. Once the oil gets hot (around 375F), start to deep fry the pork belly per batch. Cook it until the color turns golden brown and the skin gets crisp. Note: be extra careful during this step.",
      "Remove the belly from the fryer and let the excess oil drip.",
      "Slice the deep fried lechon carajay into bite sized pieces. Arrange in a serving plate and serve with a dip composed of chopped onion, soy sauce, vinegar, and chili peppers.",
      "Serve. Share and enjoy!"
    ],
    "cooking_time": "2 hours",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/lechon-carajay-recipe/",
    "image_url": "",
    "image_path": "",
    "category": "Pork Dishes"
  },
  {
    "title": "Chili Crab with Snake Beans",
    "ingredients": [
      "▢ 6 pieces crab alimasag or alimango, cut in half",
      "▢ 8 pieces snake beans sitaw, cut in 2 inch length",
      "▢ 1 knob ginger minced",
      "▢ 6 cloves garlic crushed and minced",
      "▢ 1 piece onion minced",
      "▢ 5 pieces chili pepper",
      "▢ 1 piece egg beaten",
      "▢ 2 tablespoons cornstarch",
      "▢ 1/4 cup tomato ketchup",
      "▢ 1 cup chicken broth",
      "▢ 1 teaspoon soy sauce",
      "▢ 3 tablespoons cooking oil",
      "▢ Salt and pepper to taste"
    ],
    "instructions": [
      "Combine chicken broth, soy sauce, ketchup, and cornstarch in a bowl. Stir to mix. Set aside.",
      "Heat the oil in a wok or large pan. Once the oil gets hot, saute the garlic, onion, and ginger.",
      "Once the onion gets soft, add the chili and snake beans. Stir fry in high heat for 2 to 3 minutes.",
      "Add the crab. Continue to stir fry for 5 minutes.",
      "Sprinkle salt and ground black pepper. Pour-in the chicken broth mixture and then toss to coat. Cook for 1 minute.",
      "Pour the beaten egg and stir fry for 3 minutes.",
      "Transfer to a serving plate. Serve with warm white rice.",
      "Share and enjoy!"
    ],
    "cooking_time": "35 minutes",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/chili-crab-with-snake-beans/",
    "image_url": "",
    "image_path": "",
    "category": "Chicken Dishes"
  },
  {
    "title": "Seafood Kare Kare Recipe",
    "ingredients": [
      "▢ 1/2 lb. shrimp cleaned",
      "▢ 2 crabs steamed",
      "▢ 1/2 lb. mussels boiled in 3/4 cup water",
      "▢ 1 squid",
      "▢ 8 string beans tied in knots",
      "▢ 1 banana heart sliced",
      "▢ 2 cups coconut cream",
      "▢ 5 tablespoons peanut butter",
      "▢ 1 1/2 tablespoons annatto powder astuete diluted in 3 tablespoons water",
      "▢ 2 tablespoons fish sauce",
      "▢ 3 tablespoons shrimp paste",
      "▢ 4 cloves  garlic crushed and chopped",
      "▢ 1 onion chopped",
      "▢ Water",
      "▢ 6 tablespoons cooking oil"
    ],
    "instructions": [
      "Pour 5 cups of water in a cooking pot. Let boil. Blanch the string beans and banana heart by placing these in the pot with boiling water and cook it for 3 to 4 minutes. Remove the vegetables and put these on a bowl with cold water and ice. Let it stay in the bowl for 3 minutes. Remove from the bowl and set aside.8 string beans, Water, 1 banana heart",
      "Heat 3 tablespoons of cooking oil in a pan. Pan fry the shrimp in medium heat for 2 minutes per side.Remove the shrimp from the pan. Set aside.6 tablespoons cooking oil, 1/2 lb. shrimp",
      "On the same pan, pan fry the squid using the remaining oil for 2 minutes per side. Do not overcook the squid as it will get tough. Remove the squid from the pan and set it aside.1 squid",
      "Pan fry the steamed crabs on the same pan for 2 1/2 minutes per side. Add more oil if needed. Set aside.2 crabs",
      "Put the mussels on the same pan and pan fry or stir fry for 4 minutes total. Pour-in the water used to boil the mussels (or if you are using pre-cooked mussels, use the water in the package). Deglaze the pan by gently rubbing your spatula on the surface until bits of seafood are diluted in the liquid. Remove the mussels from the pan and then place the liquid on a separate bowl.1/2 lb. mussels",
      "Using a clay pot (palayok) or regular cooking pot, heat 3 tablespoons of cooking oil and then saute the garlic and onion.4 cloves  garlic, 6 tablespoons cooking oil, 1 onion",
      "Once the onion turns soft, pour-in the coconut cream. Let boil.2 cups coconut cream",
      "Add the liquid from the frying pan. Stir.",
      "Add the peanut butter. Stir and cook until it is completely diluted.5 tablespoons peanut butter",
      "Add the fish sauce (patis). Stir.2 tablespoons fish sauce",
      "Pour-in the annatto powder diluted in water. You may add more annatto powder to get your desired color. Cook for 2 to 5 minutes in medium heat while stirring.1 1/2 tablespoons annatto powder",
      "Top with shrimp paste and serve.3 tablespoons shrimp paste"
    ],
    "cooking_time": "55 minutes",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/seafood-kare-kare-recipe/",
    "image_url": "",
    "image_path": "",
    "category": "Seafood"
  },
  {
    "title": "Crispy Nilasing na Hipon (Fried Shrimp Marinated in Wine)",
    "ingredients": [
      "▢ 1 pound shrimp head and shell on",
      "▢ 3/4 cup all purpose flour",
      "▢ 1/4 cup Shao Xing Cooking wine",
      "▢ 1/4 teaspoon ground black pepper",
      "▢ 1 1/2 teaspoons garlic salt",
      "▢ 1/4 teaspoon ground cayenne red pepper",
      "▢ 3 tablespoons cornstarch",
      "▢ 1 1/2 cups cooking oil"
    ],
    "instructions": [
      "Wash the shrimp with running water. Drain the water and place the shrimp in a bowl.",
      "Add garlic salt and ground black pepper. Mix the ingredients either by tossing using your hands.",
      "Add the cooking wine. Toss and ensure that all the ingredients are well blended. Let the mixture stand for 10 minutes.",
      "In another bowl, combine flour, cornstarch, and ground cayenne red pepper. Mix well.",
      "Heat a cooking pot or a deep frying pan or wok. Pour cooking oil. Let the oil get hot until it reaches 325F.",
      "Dredge the marinated shrimp in the flour mixture. Make sure that the shrimp is coated all throughout.",
      "Fry one side of the shrimp for 1 to 2 minutes or until it turns dark orange and the texture gets crispy. Turn it over and do the same with the other side.",
      "Remove the crispy nilasing na hippo from the cooking pot and place in a plate lined with paper towel.",
      "Arrange in a serving plate and serve with spicy vinegar.",
      "Share and enjoy!"
    ],
    "cooking_time": "19 minutes",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/cripsy-nilasing-na-hipon-fried-shrimp-marinated-wine/",
    "image_url": "",
    "image_path": "",
    "category": "Other Filipino Dishes"
  },
  {
    "title": "Grilled St. Louis Style Ribs with Ensaladang Talong and Bagoong",
    "ingredients": [
      "▢ 2 1/2 pounds St. Louis-style spare ribs",
      "▢ 1 serving eggplant salad",
      "▢ 1 cup bagoong guisado",
      "▢ 2 teaspoons garlic powder",
      "▢ 1 teaspoon onion powder",
      "▢ 1 teaspoon paprika",
      "▢ 1 teaspoon salt",
      "▢ 1/2 teaspoon lemon pepper",
      "▢ 1/4 cup brown sugar"
    ],
    "instructions": [
      "Combine all the rub ingredients. Mix well.",
      "Rub the mixture all over the spare ribs. Let is stay for 10 minutes.",
      "Heat the grill to 250F (we need to grill this in low heat for best results). Grill one side for 1 1/2 hours. Turn the ribs over to grill the other side. continue to grill for 1 hour.",
      "Remove from the grill. Let it rest for 15 minutes. Slice the ribs.",
      "Serve with eggplant salad and shrimp paste -- and rice, of course.",
      "Share and enjoy!"
    ],
    "cooking_time": "2 hours",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/grilled-st-louis-style-ribs-with-ensaladang-talong-and-bagoong/",
    "image_url": "",
    "image_path": "",
    "category": "Other Filipino Dishes"
  },
  {
    "title": "Scrambled Eggs with Tomato, Onion, and Spinach",
    "ingredients": [
      "▢ 4 eggs",
      "▢ 1 medium plum tomato cubed",
      "▢ 1 medium yellow onion sliced",
      "▢ 1 cup baby spinach",
      "▢ a pinch of salt",
      "▢ a pinch of ground black pepper",
      "▢ 2 tablespoons cooking oil",
      "▢ 2 tablespoons butter"
    ],
    "instructions": [
      "Crack the eggs in a bowl. Add salt and pepper. Beat until smooth. Set aside.",
      "Heat the cooking oil and butter in a pan. Make sure that the entire area of the pan is coated with oil and butter.",
      "Add the tomato and onion. Cook for 2 to 3 minutes in medium heat or until the onion gets soft.",
      "Add the spinach and then stir fry for 30 seconds.",
      "Pour-in the beaten egg. Cook one side until it starts to set. Gently scrape the the eggs from one end of the pan going towards the center using either a spatula or wooden spoon. Repeat the process until soft curds form.",
      "Transfer to a serving plate. Serve with toast.",
      "Share and enjoy!"
    ],
    "cooking_time": "18 minutes",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/scrambled-eggs-with-tomato-onion-and-spinach/",
    "image_url": "",
    "image_path": "",
    "category": "Other Filipino Dishes"
  },
  {
    "title": "Fried Daing na Bangus with Garlic Fried Rice, Fried Egg, and Pickled Papaya (Daing Silog)",
    "ingredients": [
      "▢ 3 medium daing na bangus fried",
      "▢ 3 eggs",
      "▢ 5 cups garlic fried rice",
      "▢ 3/4 cups papaya atchara optional",
      "▢ 3 1/2 tablespoons cooking oil",
      "▢ 2 tablespoons chopped scallions"
    ],
    "instructions": [
      "Prepare daing na bangus according to the instructions on the recipe link above. Set aside.",
      "Prepare sinangag (garlic fried rice). See link above for the recipe. Set Aside",
      "Heat oil in a pan. Once the oil gets hot, fry the eggs. You can make it sunny side-up, over easy, or basted. Get more details here",
      "Arrange the fried daing na bangus, sinangag, and fried egg on individual plates. Serve with papaya atchara and spicy vinegar. Sprinkle some chopped scallions on top.",
      "Share and enjoy"
    ],
    "cooking_time": "50 minutes",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/fried-daing-na-bangus-garlic-fried-rice-fried-egg-pickled-papaya-daing-silog/",
    "image_url": "",
    "image_path": "",
    "category": "Seafood"
  },
  {
    "title": "Beef Batchoy with Liver and Bung",
    "ingredients": [
      "▢ 1 to 1 1/2 lbs. fresh miki noodles",
      "▢ 2 lbs. beef tendon",
      "▢ 2 lbs. beef shank",
      "▢ 1 lb. bung pork large intestine, cleaned and boiled until tender",
      "▢ 1/2 lb. pork liver sliced unti strips",
      "▢ 10 to 12 cups water",
      "▢ 4 tablespoons fish sauce",
      "▢ 1/2 teaspoon ground black pepper",
      "▢ 2 large onions around 1 1/2 cup, minced",
      "▢ 5 cloves crushed garlic",
      "▢ 1/2 cup chopped celery",
      "▢ 3 tablespoons cooking oil",
      "▢ 1 cup crushed chicharon",
      "▢ 1/2 cup chopped scallions",
      "▢ 3 tablespoons toasted garlic"
    ],
    "instructions": [
      "Sliced the pork bung into serving pieces. Set aside.",
      "Heat oil in a large cooking pot.",
      "Saute the garlic, onion and celery until the onion gets soft.",
      "Add the ground black pepper. Stir and cook for 30 seconds.",
      "Put the beef tendon and shank in the cooking pot. Stir and cook for 1 minute.",
      "Add the pork bung and pour-in water. Let boil. Cover and simmer for 2 to 3 hours.",
      "Increase the heat to medium. Bring back to a boil. Add the sliced liver and continue to cook for 10 to 15 minutes.",
      "Pour-in the fish sauce. Stir. Add more water if needed.",
      "Dip the fresh miki noodles in boiling water for 1 minutes. Remove the noodles and drain the water by placing the noodles in a colander, wire mesh, or strainer.",
      "Arrange the noodles in large individual bowls. Add the meats from the cooking pot and pour the piping hot soup. Top with toasted garlic, scallions, and chicharon.",
      "Serve. Share and enjoy!"
    ],
    "cooking_time": "3 hours",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/beef-batchoy-with-liver-and-bung/",
    "image_url": "",
    "image_path": "",
    "category": "Soups And Stews"
  }
]