[
  {
    "title": "Grilled Pork Belly",
    "ingredients": [
      "▢ 3 lbs. pork belly",
      "▢ 3/4 cup soy sauce",
      "▢ Juice of 5 pieces lime",
      "▢ 1 tablespoon garlic powder",
      "▢ 1/4 tablespoon ground black pepper",
      "▢ 1 teaspoon sriracha sauce or hot sauce"
    ],
    "instructions": [
      "In a large bowl, combine the soy sauce, lime juice, ground black pepper, garlic powder, and hot sauce. Mix well.",
      "Put the cleaned pork belly in a large resealable bag. You can slice the pork belly thinner so that it can quickly absorb the marinade.",
      "Pour the soy sauce mixture in the resealable bag. Let all the air out then seal. Let the pork belly marinate for at least 1 hour. You can place the bag in the refrigerator during the process.",
      "Heat-up the grill. Start to grill the marinated pork belly for 3 minutes per side. Baste the pork belly with the remaining marinade. Note: Do this process at least 3 times. This means that each side of the pork belly is grilled for a minimum of 9 minutes (3 minutes x 3 times). This will prevent the pork from getting burnt quickly. Make sure that you baste it every time you flip it over. Grill longer if the pork belly is not cooked enough.",
      "Remove the pork belly from the grill. Let cool. Slice into serving pieces.",
      "Serve with spicy vinegar. Share and enjoy!"
    ],
    "cooking_time": "1 hour",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/grilled-pork-belly/",
    "image_url": "",
    "image_path": "",
    "category": "Pork Dishes"
  },
  {
    "title": "Filipino Spaghetti Recipe",
    "ingredients": [
      "▢ 2 lbs. Spaghetti noodles",
      "▢ 1 lb. ground pork",
      "▢ 6 ounces luncheon meat minced",
      "▢ 4 pieces hotdogs or beef franks",
      "▢ 35 ounces Filipino Style Spaghetti Sauce",
      "▢ 1/2 cup shredded cheddar cheese",
      "▢ 1 1/2 cups beef broth",
      "▢ 1 medium onion minced",
      "▢ 1 teaspoon minced garlic",
      "▢ Salt and pepper to taste",
      "▢ 3 tablespoons cooking oil"
    ],
    "instructions": [
      "Cook the Spaghetti noodles according to package instructions. Once cooked, transfer to a bowl. Set aside.",
      "Heat the oil in a Pan.",
      "Saute the onion and garlic.",
      "Once the onions becomes soft, add the ground pork. Cook until the color turns light brown.",
      "Add the luncheon meat and hotdog. Stir and cook for 2 to 3 minutes.",
      "Pour-in the Spaghetti sauce and beef broth. Stir and let boil. Cover and simmer for 30 minutes.",
      "Try to taste the sauce and add salt and pepper if needed.",
      "Pour the Filipino Style Spaghetti sauce over the Spaghetti. Top with shredded cheese.",
      "Serve. Share and enjoy!"
    ],
    "cooking_time": "55 minutes",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/filipino-style-spaghetti/",
    "image_url": "",
    "image_path": "",
    "category": "Pork Dishes"
  },
  {
    "title": "Meatball Adobo with Shrimp Fried Rice and Egg",
    "ingredients": [
      "▢ 1 serving of Meatball adobo see recipe here",
      "▢ 1 1/2 serving of Shrimp Fried Rice click for the recipe",
      "▢ 4 to 6 pieces fried eggs you can also cook eggs through these 10 different ways"
    ],
    "instructions": [
      "Prepare the adobo meatball and shrimp fried rice according to the recipe provided in the links above.",
      "In 4 to 6 individual plates, arrange a portion of the fried rice and adobo meatballs. Top with fried egg. your fried egg does not need to be perfect, unless you really insist.",
      "Serve for either breakfast, lunch or dinner. This can also be a good \"baon\" for school or for the office.",
      "Share and enjoy!"
    ],
    "cooking_time": "40 minutes",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/meatball-adobo-with-shrimp-fried-rice-and-egg/",
    "image_url": "",
    "image_path": "",
    "category": "Chicken Dishes"
  },
  {
    "title": "Shrimp Pancit Canton Recipe",
    "ingredients": [
      "▢ 1 lb. medium to large shrimp  deveined, shell and head removed",
      "▢ 16 ounces Pancit Canton noodles",
      "▢ 1 cup baby bok choy chopped",
      "▢ 1 cup Napa cabbage chopped",
      "▢ 1/2 small red bell pepper  cut into strips",
      "▢ 1/2 small yellow bell pepper  cut into strips",
      "▢ 1/2 small green bell pepper  cut into strips",
      "▢ 1 medium yellow onion sliced",
      "▢ 2 1/2 cups chicken broth",
      "▢ 2 tablespoons oyster sauce",
      "▢ 1 teaspoon garlic powder",
      "▢ Salt and ground black pepper to taste",
      "▢ 3 tablespoons cooking oil"
    ],
    "instructions": [
      "Combine the shrimp with garlic powder, a sprinkle of salt, and ground black pepper. Toss to coat the shrimp evenly and let it marinate for at least 10 minutes.1 teaspoon garlic powder, Salt and ground black pepper to taste, 1 lb. medium to large shrimp",
      "Heat a wok and pour in 2 tablespoons of cooking oil. Once the oil is hot, pan-fry the shrimp for 1 minute on each side until they’re cooked through. Remove the shrimp and place them on a clean plate. Set aside.3 tablespoons cooking oil",
      "Add the remaining cooking oil to the wok. When the oil is hot, stir-fry the bell peppers and onion for about 2 minutes.1/2 small red bell pepper, 1/2 small yellow bell pepper, 1/2 small green bell pepper, 1 medium yellow onion",
      "Add the bok choy and Napa cabbage to the wok and continue to stir-fry for another 2 minutes. Remove the veggies from the wok and set them aside on a plate.1 cup Napa cabbage, 1 cup baby bok choy",
      "In the same wok, pour in the chicken broth and add the oyster sauce. Stir and bring it to a boil. Add the Pancit Canton noodles and let them absorb the liquid, tossing every minute so all the noodles get the same amount of flavor.2 1/2 cups chicken broth, 2 tablespoons oyster sauce, 16 ounces Pancit Canton noodles",
      "Once the noodles have absorbed all the chicken broth, add the stir-fried veggies back into the wok. Toss everything together and cook for 2 minutes.",
      "Stir in the cooked shrimp and mix well. Cook for an additional 2 to 3 minutes, adding more salt and pepper to taste.",
      "Transfer the Shrimp Pancit Canton to a serving plate. Enjoy with a side of calamansi and a nice cold drink. Share and savor every delicious bite!"
    ],
    "cooking_time": "25 minutes",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/shrimp-pancit-canton-recipe/",
    "image_url": "",
    "image_path": "",
    "category": "Noodles"
  },
  {
    "title": "Crispy Fried Jeprox",
    "ingredients": [
      "▢ 3 ounces packaged dried jeprox",
      "▢ 4 tablespoons cooking oil",
      "▢ 1/2 cup spicy vinegar"
    ],
    "instructions": [
      "Heat the oil in a frying pan",
      "Once the oil heats-up add around 3 pieces of dried jeprox and fry each side until the color turns golden brown and the fish starts to curl. Make sure that the oil is not too hot when you put the fish in. This will prevent it from getting burnt quickly and will avoid a bitter aftertaste. Perform this step until all the fish are consumed.",
      "Using a spoon, scoop some hot oil from the pan and pour-it over the fish so that the opposite side will get cooked and crispy. Turning the fish over will not cook the fish equally since it is already curly.",
      "Remove the fried jeprox from the hot pan. Place in a plate lined with paper towels.",
      "Transfer to a serving plate. Serve with rice and spicy vinegar.",
      "Share and enjoy!"
    ],
    "cooking_time": "13 minutes",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/crispy-fried-jeprox/",
    "image_url": "",
    "image_path": "",
    "category": "Seafood"
  },
  {
    "title": "Sinigang na Hipon sa Sampaloc",
    "ingredients": [
      "▢ 2 lbs. medium to large shrimp with head and shell",
      "▢ 1 lb. unripe tamarind",
      "▢ 1 small daikon white radish, sliced",
      "▢ 1 bunch spinach or kangkong",
      "▢ 12 pieces okra",
      "▢ 2 tablespoons fish sauce",
      "▢ 2 medium plum tomato quartered",
      "▢ 1 medium yellow onion quartered",
      "▢ 6 cups water",
      "▢ Ground black pepper to taste"
    ],
    "instructions": [
      "Pour the water in a cooking pot. Bring to a boil.",
      "Add the tamarind. Cover and boil for 30 minutes. Add more water if needed.",
      "Separate the tamarind from the water. Make sure to squeeze the juice out of the tamarind for maximum flavor.",
      "Heat the cooking pot with the remaining water and tamarind extract. You can add more water if you think that the amount of remaining liquid is less than 5 cups. Let boil.",
      "Add the tomato and onion. Cook for 5 minutes.",
      "Put-in the daikon,okra, and shrimp. Cook for 3 to 8 minutes in medium heat.",
      "Add the spinach and fish sauce. Stir. Cover and turn the heat off.",
      "Sprinkle some ground black pepper to taste.",
      "Transfer to a serving bowl. Serve.",
      "Share and enjoy!"
    ],
    "cooking_time": "1 hour",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/sinigang-na-hipon-sa-sampaloc/",
    "image_url": "",
    "image_path": "",
    "category": "Seafood"
  },
  {
    "title": "Beef Morcon Recipe",
    "ingredients": [
      "▢ 2 lbs. flank steak thinly sliced",
      "▢ 1 medium carrot sliced into sticks",
      "▢ 1 serving flank steak marinade see recipe here",
      "▢ 4 pieces hard boiled eggs wedged",
      "▢ 3 pieces medium whole sweet pickles sliced into 4 long sticks",
      "▢ 2 pieces chorizo de bilbao or beef franks",
      "▢ 1/2 cup all-purpose flour",
      "▢ 3 tablespoons cooking oil",
      "▢ 1 cup beef broth",
      "▢ 1 tablespoon soy sauce",
      "▢ 1 cup water",
      "▢ Salt and ground black pepper to taste"
    ],
    "instructions": [
      "Combine the flank steak with the flank steak marinade in a large bowl. Cover the bowl and place inside the refrigerator. Marinate for 1 to 3 hours.",
      "Lay the marinated flank steak in a plate. Assemble the stuffing in the middle. Start by lining the carrot sticks, sweet pickle sticks, sliced chorizo, and egg. Make sure that the stuffings are close to each other. Roll the flank steak from one end to another to cover the stuffing. Use a kitchen twine to tie the meat. This will seal the stuffing inside. You can watch our previous morcon recipe video for the procedure.",
      "Meanwhile, heat the oil in a frying pan.",
      "While the oil is starting to heat-up, dredge the rolled flank steak (morcon) in flour. Make sure that the entire piece is coated.",
      "Pan fry the morcon until the outer part turns light to medium brown. This should be around 2 minutes per side.",
      "Remove the pan-fried morcon from the frying pan. Arrange in a wide cooking pot and pour-in water, soy sauce, and beef broth.",
      "Heat the cooking pot and let boil. Cover and simmer for 60 minutes or until the meat gets tender.",
      "Add salt and ground black pepper to taste.",
      "Slice the beef morcon into serving pieces and arrange in a serving plate. Pour the sauce on top.",
      "Serve. Share and enjoy!"
    ],
    "cooking_time": "2 hours",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/beef-morcon-recipe/",
    "image_url": "",
    "image_path": "",
    "category": "Desserts"
  },
  {
    "title": "Adobo Meatballs Recipe",
    "ingredients": [
      "▢ 1 1/2 lb meatballs see meatball recipe here",
      "▢ 1/4 cup soy sauce",
      "▢ 2 tablespoons vinegar",
      "▢ 6 cloves garlic crushed",
      "▢ 3/4 cup beef broth",
      "▢ 1 teaspoon peppercorn",
      "▢ 4 pieces dried bay leaves",
      "▢ 2 tablespoon cooking oil",
      "▢ 1/2 teaspoon granulated white sugar",
      "▢ Salt to taste"
    ],
    "instructions": [
      "Heat oil in a pan.",
      "Put-in the garlic. Let the garlic cook until the color turns light brown. Make sure to keep an eye on the garlic so that it won't get burnt.",
      "Add the meatballs, peppercorn, and bay leaves. I am using cooked meatballs and the recipe link is available above.",
      "Pour-in the soy sauce and beef broth. Add the sugar. Stir and let boil.",
      "Cover and simmer for 15 minutes. Add vinegar and a little water if the liquid starts to dry-up.",
      "Try to taste your meatball adobo and add salt if necessary.",
      "Transfer to a serving bowl. Serve.",
      "Share and enjoy!"
    ],
    "cooking_time": "30 minutes",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/adobo-meatballs-recipe/",
    "image_url": "",
    "image_path": "",
    "category": "Chicken Dishes"
  },
  {
    "title": "Crispy Tilapia Sticks Recipe",
    "ingredients": [
      "▢ 1 lb. thick tilapia fillet. each piece sliced lengthwise into 3 to 4 pieces",
      "▢ 1/2 teaspoon garlic powder",
      "▢ 1/2 teaspoon onion powder",
      "▢ 1 teaspoon sea salt",
      "▢ 1/4 teaspoon ground black pepper",
      "▢ 2 eggs beaten",
      "▢ 1 cup Panko breadcrumbs",
      "▢ 2 cups cooking oil"
    ],
    "instructions": [
      "Combine the salt, garlic powder, onion powder, and ground black pepper in a bowl mix well.",
      "Rub the mixture all over the sliced tilapia fillets.",
      "Meanwhile, pour the oil in a deep cooking pot. Turn-on the heat and start to heat-up the oil.",
      "Dip the tilapia fillet in the bowl with beaten egg then dredge the tilapia in Panko breadcrumbs. ake sure that the tilapia is well coated. To save more breadcrumbs and for better coating, you can place the breadcrumbs in a container with cover. Simply put 2 to 3 pieces if tilapia fillet in the container with breadcrumbs, cover it, and then shake the container back and forth. You will see that the tilapia will be coated properly.",
      "Put the breaded tilapia into the hot oil and start to deep fry the fish until the color turns golden brown. Use medium heat in this step",
      "Remove the deep fried crispy tilapia sticks from the cooking pot and place in a plate lined with paper towel.This will absorb the excess oil.",
      "Transfer the crispy tilapia sticks in a serving plate and serve with a bowl of fresh ranch dressing. You can also serve this with tartar sauce.",
      "Share and enjoy!"
    ],
    "cooking_time": "25 minutes",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/crispy-tilapia-sticks-recipe/",
    "image_url": "",
    "image_path": "",
    "category": "Seafood"
  },
  {
    "title": "Sinigang na Bangus sa Bayabas",
    "ingredients": [
      "▢ 1 medium milkfish bangus, cleaned and scales removed and sliced into steaks",
      "▢ 2 cups baby spinach",
      "▢ 4 to 6 pieces guava ripe",
      "▢ 8 pieces okra",
      "▢ 1 small onion wedged",
      "▢ 2 medium tomato wedged",
      "▢ 2 pieces Jalapeno pepper",
      "▢ 2 tablespoons fish sauce",
      "▢ 1 teaspoon ground black pepper",
      "▢ 4 to 5 cups water"
    ],
    "instructions": [
      "Pour the water in a cooking pot. Bring to a boil.",
      "Put-in the guava, tomato, onion, and whole peppercorn. Let it boil. Continue to boil (covered) for 15 minutes or until the guava and vegetables are soft. You may add more water if needed.",
      "Using a fork of potato masher, mash the guava and vegetables inside the cooking pot to extract the flavors. This is an optional step, be extra careful.",
      "Pour-in the fish sauce. Stir.",
      "Add the milk fish. Cook for 5 to 10 minutes in medium heat.",
      "Add the okra and Jalapeno. Continue to cook for 5 minutes.",
      "Put-in the spinach. Cover the cooking pot. Turn the heat off. Let the spinach stay in the pot for 5 minutes.",
      "Transfer to a serving bowl. Serve.",
      "Share and enjoy!"
    ],
    "cooking_time": "55 minutes",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/sinigang-na-bangus-sa-bayabas/",
    "image_url": "",
    "image_path": "",
    "category": "Seafood"
  },
  {
    "title": "Shrimp Fried Rice Recipe",
    "ingredients": [
      "▢ 4 cups cooked white rice",
      "▢ ¾ cup frozen green peas",
      "▢ ¾ cup frozen small shrimp with no shell",
      "▢ ½ cup carrot diced",
      "▢ 1/2 teaspoon garlic powder",
      "▢ ¼ teaspoon salt",
      "▢ ¼ teaspoon onion powder",
      "▢ 3 tablespoons butter"
    ],
    "instructions": [
      "Combine the rice, salt, garlic powder, and onion powder Gently mix to blend all the ingredients.",
      "Melt the butter in a pan.",
      "Once the butter starts to get hot (make sure not to get the butter very hot), put-in green peas and carrots. Cook for 1 to 2 minutes.",
      "Put the shrimp in the wok and cook for 1 minute.",
      "Add the rice mixture. Cook for 10 minutes in medium heat while tossing once in a while. Make sure to toss the ingredients while cooking to blend them properly.",
      "Transfer to a serving bowl. Serve for breakfast or lunch with your favorite dish.",
      "Share and enjoy!"
    ],
    "cooking_time": "20 minutes",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/shrimp-fried-rice-recipe/",
    "image_url": "",
    "image_path": "",
    "category": "Other Filipino Dishes"
  },
  {
    "title": "Pork Adobo Paksiw Recipe",
    "ingredients": [
      "▢ 2 lbs. pork adobo",
      "▢ 1 cup lechon sauce",
      "▢ 1 teaspoon granulated white sugar",
      "▢ 1/2 cup water"
    ],
    "instructions": [
      "Heat the leftover pork adobo in a cooking pot.",
      "Add the lechon sauce, sugar, and water, stir, cover and cook in low heat for 20 minutes. Try to stir after every 5 minutes. You can add more water if the sauce is getting too thick.",
      "Transfer to a serving bowl and serve.",
      "Share and enjoy!"
    ],
    "cooking_time": "25 minutes",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/pork-adobo-paksiw-recipe/",
    "image_url": "",
    "image_path": "",
    "category": "Pork Dishes"
  }
]