[
  {
    "title": "Adobo Steak Recipe",
    "ingredients": [
      "▢ 1 1/2 lbs beef tenderloin",
      "▢ 1/3 cup soy sauce",
      "▢ 4 tablespoons red wine vinegar",
      "▢ 1/2 cup water",
      "▢ 2 tablespoons honey",
      "▢ 1 green bell pepper sliced lengthwise",
      "▢ 1 medium onion sliced",
      "▢ 4 tablespoons extra virgin olive oil",
      "▢ salt and pepper to taste"
    ],
    "instructions": [
      "Heat a cooking pot then pour-in 2 tablespoons of olive oil.",
      "Put-in the beef and cook for 1 to 2 minutes.",
      "Pour-in soy sauce and water then allow to boil. Simmer for 15 to 20 minutes. Note: Add more water if the mixture dries-up.",
      "Put-in the honey and red wine vinegar and allow to boil. Stir and simmer for 10 minutes. Turn-off heat and set aside.",
      "Heat a wok and pour-in remaining olive oil.",
      "Put-in bell pepper and onion then cook for 3 minutes.",
      "Add the cooked beef tenderloin, salt, and pepper then stir. Cook for a minute more.",
      "Transfer to a serving plate then serve. Share and enjoy!"
    ],
    "cooking_time": "45 minutes",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/how-to-cook-adobo-steak/",
    "image_url": "",
    "image_path": "",
    "category": "Chicken Dishes"
  },
  {
    "title": "Shrimp Pasta in Tomato Cream Cheese Sauce Recipe",
    "ingredients": [
      "▢ 1 lb spaghetti noodles cooked according to packaged instructions",
      "▢ 1 lb shrimp; cleaned head and shells removed",
      "▢ 1 medium onion minced",
      "▢ 8 ounces cream cheese",
      "▢ 28 ounces large can crushed tomato",
      "▢ 1/4 teaspoon dried thyme",
      "▢ 3 tablespoons extra virgin olive oil",
      "▢ salt and pepper to taste"
    ],
    "instructions": [
      "Arrange the cooked spaghetti in a serving plate. Set aside.",
      "Heat a cooking pot then pour-in olive oil",
      "When the oil is hot, saute the onion.",
      "Pour-in crushed tomato and stir. Let boil and simmer for 10 minutes.",
      "Put-in the thyme, salt, and pepper. Stir.",
      "Add the cream cheese and stir thoroughly until melted. Simmer for 5 minutes.",
      "Put-in the shrimp and cook for 3 to 5 minutes more.",
      "Turn-off heat then pour the sauce over the pasta.",
      "Serve. Share and enjoy!"
    ],
    "cooking_time": "50 minutes",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/how-to-cook-shrimp-and-pasta-in-tomato-cream-cheese-sauce/",
    "image_url": "",
    "image_path": "",
    "category": "Other Filipino Dishes"
  },
  {
    "title": "Baked Cilantro Lime Cod Recipe",
    "ingredients": [
      "▢ 4 pieces cod fillets",
      "▢ 1 cup cilantro",
      "▢ 1/3 cup extra virgin olive oil",
      "▢ 1 clove garlic",
      "▢ 2 teaspoon lime juice",
      "▢ 1 teaspoon granulated white sugar",
      "▢ 1/4 teaspoon red pepper flakes",
      "▢ salt and pepper to taste."
    ],
    "instructions": [
      "Preheat oven to 350 degrees Fahrenheit.",
      "Brush the cod fillets with olive oil then sprinkle some salt and pepper.",
      "Place the cod fillets in a baking pan and bake for 15 minutes. Set aside.",
      "Make the sauce by combining cilantro, lime juice, extra virgin olive oil, sugar, and red pepper flakes in a blender. Blend until the texture becomes smooth.",
      "Arrange the baked cod fillets in a serving plate then spoon the sauce on top.",
      "Serve with steamed rice.",
      "Share and enjoy!"
    ],
    "cooking_time": "25 minutes",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/how-to-cook-baked-cilantro-lime-cod/",
    "image_url": "",
    "image_path": "",
    "category": "Other Filipino Dishes"
  },
  {
    "title": "Apple Pie Recipe",
    "ingredients": [
      "▢ 2 Pastry doughs",
      "▢ 1/2 cup butter divided",
      "▢ 3 tablespoons flour",
      "▢ 1/2 cup granulated white sugar",
      "▢ 1/2 cup brown sugar",
      "▢ 6 to 8 pieces baking apples granny smith's; peeled, cored, and sliced",
      "▢ 1/2 teaspoon ground cinnamon",
      "▢ 1/8 teaspoon nutmeg"
    ],
    "instructions": [
      "Preheat oven to 425 degrees Fahrenheit.",
      "In a mixing bowl, combine apples, sugars, flour, nutmeg, and cinnamon then mix well.",
      "Set 1 pastry dough on a round cake or pie pan then put-in the apple mixture and arrange.",
      "Distribute butter on top of the apple mixture.",
      "Cover with the second pie crust then seal the edges.",
      "Bake for 15 minutes then reduce heat to 300 degrees Fahrenheit and bake for another 40 to 45 minutes.",
      "Remove from the oven and serve.",
      "Share and enjoy!"
    ],
    "cooking_time": "55 minutes",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/apple-pie-recipe/",
    "image_url": "",
    "image_path": "",
    "category": "Other Filipino Dishes"
  },
  {
    "title": "Bacon wrapped Scallops in Lemon Garlic Butter Sauce",
    "ingredients": [
      "▢ 1 lb scallops",
      "▢ 8 strips of bacon",
      "▢ 1 teaspoon garlic powder",
      "▢ 4 tablespoons butter",
      "▢ 1 teaspoon lemon juice"
    ],
    "instructions": [
      "Wrap each scallop with a strip of bacon then secure using a wooden toothpick.",
      "Heat a frying pan then put-in the butter and allow to melt.",
      "Fry the bacon-wrapped scallops for about 3 minutes per side.",
      "Pre-heat oven to 350 degrees Fahrenheit. Bake the fried bacon-wrapped scallops for 15 minutes.",
      "Heat the same pan where the scallops were fried. With the remaining butter, sprinkle the garlic powder and put-in the lemon juice. Cook for a minute then turn-off heat.",
      "Arrange the baked bacon-wrapped scallops in a serving plate then top with lemon garlic butter sauce.",
      "Serve. Share and enjoy!"
    ],
    "cooking_time": "26 minutes",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/how-to-cook-bacon-wrapped-scallops-in-lemon-garlic-butter-sauce/",
    "image_url": "",
    "image_path": "",
    "category": "Other Filipino Dishes"
  },
  {
    "title": "Paella Marinera Recipe",
    "ingredients": [
      "▢ 2 lbs seasoned yellow rice arroz amarillo",
      "▢ 1 lb mussels tahong",
      "▢ 1/2 lb  squid cleaned",
      "▢ 1 lb clams almejas, cooked",
      "▢ 8  crabs cleaned",
      "▢ 1 lb shrimp cleaned",
      "▢ 43 ounces tomato sauce",
      "▢ A hint of Tabasco sauce",
      "▢ 3/4 cup pimiento sliced",
      "▢ 3  onions diced",
      "▢ 1 head garlic minced",
      "▢ 1/2 teaspoon  saffron",
      "▢ 3 to 4 cups water",
      "▢ 1/4 cup olive oil",
      "▢ salt and ground black pepper to taste"
    ],
    "instructions": [
      "Combine seasoned yellow rice and water and soak for 3 hours.",
      "Heat a Paellera or large pan then pour-in olive oil.",
      "When the oil is hot, saute the garlic and onions.",
      "Put-in the crabs, mussels, shrimps, clams, squid, Tabasco sauce, salt, and ground black pepper. Cover the pan and cook for 3 minutes or until the juices come out.",
      "Add tomato sauce then cover the pan. Cook for a minute.",
      "Stir then simmer for 4 to 6 minutes. Transfer the cooked seafoods on a clean plate.",
      "With the remaining juices and tomato sauce on the pan, put-in the rice soaked in water and stir well. Simmer for 5 minutes.",
      "Add the Spanish saffron then gently stir. Cover the pan and continue cooking in low heat until the rice are done.",
      "Top the cooked yellow rice with pimiento then arrange the cooked seafoods over it.",
      "Serve with some lemon or lime wedges.",
      "Share and enjoy!"
    ],
    "cooking_time": "1 hour",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/paella-marinara-arroz-recipe/",
    "image_url": "",
    "image_path": "",
    "category": "Rice Dishes"
  },
  {
    "title": "Chicken Fajita Recipe",
    "ingredients": [
      "▢ 4 pieces skinless chicken breast sliced lengthwise",
      "▢ 1 medium yellow onion sliced",
      "▢ 1/2 cup red bell pepper sliced lenghtwise",
      "▢ 1/2 cup green bell pepper sliced lenghtwise",
      "▢ 1/2 cup yellow bell pepper sliced lenghtwise",
      "▢ 1 tablespoon olive oil",
      "▢ 2 tablespoons lime juice",
      "▢ 1/4 teaspoon chilli powder",
      "▢ 1/2 teaspoon garlic powder",
      "▢ 1/2 teaspoon cumin",
      "▢ 1 teaspoon paprika",
      "▢ 2 tablespoons olive oil",
      "▢ 1 teaspoon salt",
      "▢ 1/2 teaspoon ground black pepper"
    ],
    "instructions": [
      "In a mixing bowl, combine all the marinade ingredients then mix.",
      "Put the chicken breast slices in the mixing bowl then cover with marinade. Let stand for at least 1 hour.",
      "Grill the chicken for 3 to 4 minutes.",
      "Heat a cooking pan and pour-in 1 tablespoon of olive oil.",
      "When the oil becomes hot, put-in the onion and bell peppers then stir. Cook for a minute.",
      "Add the grilled chicken and cook for 2 to 4 minutes more.",
      "Meanwhile, heat a fajita plate (sizzling plate) then transfer the cooked Chicken Fajitas.",
      "Serve with hot flour tortillas, sour cream, and salsa.",
      "Share and enjoy!"
    ],
    "cooking_time": "28 minutes",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/how-to-cook-chicken-fajita/",
    "image_url": "",
    "image_path": "",
    "category": "Chicken Dishes"
  },
  {
    "title": "Marinara Sauce Recipe",
    "ingredients": [
      "▢ 2 teaspoons garlic minced",
      "▢ 1  teaspoon  dried oregano",
      "▢ 2 pieces dried bay leaves",
      "▢ 1/2 teaspoon dried parsley",
      "▢ 3 cups crushed tomatoes",
      "▢ 1 small onion minced",
      "▢ 3 cups tomato sauce",
      "▢ 2 1/2 tablespoons olive oil",
      "▢ 1/2 cup Parmesan cheese grated",
      "▢ 1/2 teaspoon crushed chili or chili powder"
    ],
    "instructions": [
      "Heat a cooking pot then pour-in olive oil.",
      "Sauté garlic and onions.",
      "When the onions gets soft, add crushed tomatoes and tomato sauce and let boil.",
      "Put-in dried oregano, parsley, chili, bay leaves, and parmesan cheese. Stir.",
      "Reduce heat to low and simmer for 3 minutes or until the mixture thickens.",
      "Turn-off heat and let the marinara sauce cool down.",
      "Transfer to a container and store in the fridge or cook as an ingredient, right away."
    ],
    "cooking_time": "30 minutes",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/how-to-make-marinara-sauce/",
    "image_url": "",
    "image_path": "",
    "category": "Other Filipino Dishes"
  },
  {
    "title": "Vegetable Stir-fry Pasta Recipe",
    "ingredients": [
      "▢ 1 lb. tri-color rotini cooked according to package instructions",
      "▢ 1 medium onion sliced",
      "▢ 1 medium red bell pepper julliened",
      "▢ 1 medium green bell pepper julliened",
      "▢ 1 cup white mushrooms chopped",
      "▢ 1 small yellow squash chopped",
      "▢ 1 1/2 to 2 cups marinara sauce",
      "▢ salt and pepper to taste"
    ],
    "instructions": [
      "Heat a wok and put-in the cooking oil.",
      "When the oil becomes hot, put-in the onion and cook for 2 minutes.",
      "Add the bell peppers and white mushrooms then stir. Cook for 2 minutes.",
      "Add salt, pepper, and yellow squash then stir and cook for 3 to 5 minutes.",
      "Put-in the rotini pasta and cook for 2 to 3 minutes.",
      "Pour-in the marinara sauce and mix well. Cook for a minute.",
      "Serve. Share and enjoy!"
    ],
    "cooking_time": "35 minutes",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/vegetable-stir-fry-pasta-recipe/",
    "image_url": "",
    "image_path": "",
    "category": "Other Filipino Dishes"
  },
  {
    "title": "No-Bake Chocolate Fudge Tart",
    "ingredients": [
      "▢ 5 to 6 ounces semi-sweet chocolate chopped",
      "▢ 2 to 3 ounces unsweetened chocolate chopped",
      "▢ 1 chocolate cookie pie crust",
      "▢ 3/4 cup half and half",
      "▢ 3 tablespoons sugar",
      "▢ 1 teaspoon vanilla extract",
      "▢ 1 cup heavy whipping cream"
    ],
    "instructions": [
      "Combine half and half and 2 tablespoons of sugar in a mixing bowl then stir well.",
      "Heat the mixture in a microwave oven for 1 1/2 to 2 minutes",
      "Put-in sweet and semi-sweet chopped chocolates and vanilla extract then mix thoroughly. You'll know that you are done when the mixture thickens.",
      "Pour-in the mixture on the chocolate cookie pie crust then refrigerate for at least 3 hours.",
      "Pour heavy whipping cream in a mixing bowl then beat until soft peaks forms. Add remaining teaspoon of sugar then continue mixing for a minute. Use an electric hand mixer of an electric stand mixer to make the job easier and faster.",
      "Top the refrigerated chocolate tart with the heavy whipping cream mixture by spreading the mixture gently in the center of the tart.",
      "Garnish with chocolate curls.",
      "Serve. Share and enjoy!"
    ],
    "cooking_time": "3 hours",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/no-bake-chocolate-fudge-tart-cake/",
    "image_url": "",
    "image_path": "",
    "category": "Other Filipino Dishes"
  },
  {
    "title": "Banana Cream Pie Recipe",
    "ingredients": [
      "▢ 1 1/2 cup graham cracker crumbs",
      "▢ 1 cup sugar",
      "▢ 8 tablespoons butter",
      "▢ 1/3 cup cornstarch",
      "▢ 1/4 teaspoon salt",
      "▢ 3 1/2 cups milk",
      "▢ 5 egg yolks",
      "▢ 2 teaspoons vanilla extract",
      "▢ 3 pieces ripe bananas sliced crosswise about 1/4 inch thick",
      "▢ 3/4 cup heavy whipping cream"
    ],
    "instructions": [
      "Make the crust by combining the graham cracker crumbs, 6 tablespoons butter, and 1/4 cup sugar in a mixing bowl then mix.",
      "Arrange the mixture in a 9 inch pie or cake pan. Gently Press the mixture to make it more compact.",
      "Refrigerate for at least 1 hour.",
      "Make the filling by heating a saucepan. Put-in 3/4 cup sugar, salt, cornstarch, and milk. Continuously stir until the mixture thickens and reaches boiling point.",
      "Meanwhile, place the egg yolks in another mixing bowl and beat. Get 1/2 cup of the milk mixture from the sauce pan (do not turn off the heat yet) then mix with the beaten egg yolks.",
      "Stir-in egg yolk mixture on the saucepan and continue cooking in low heat for 2 to 3 minutes while Stirring continuously.",
      "Turn off the heat then put-in 2 tablespoons butter and vanilla extract then stir.",
      "Transfer the mixture on a bowl then refrigerate for 1 to 1 1/2 hours.",
      "Scoop half of the filling and arrange on the pie or cake pan with graham cracker crust.",
      "Arrange the sliced bananas on top of the mixture.",
      "Pour the remaining filling over the sliced bananas.",
      "Prepare the topping by combining the heavy whipping cream and 1/2 teaspoon vanilla extract. Beat using an electric mixer until soft peaks form.",
      "Spread the topping over the last layer of filling.",
      "Garnish with chocolate curls (optional).",
      "Serve. Share and enjoy!"
    ],
    "cooking_time": "50 minutes",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/banana-cream-pie-recipe/",
    "image_url": "",
    "image_path": "",
    "category": "Other Filipino Dishes"
  },
  {
    "title": "Suman sa Lihiya Recipe",
    "ingredients": [
      "▢ 2 1/4 cups glutinous rice",
      "▢ 1 teaspoon lye water",
      "▢ 2 cups water",
      "▢ 1 whole banana leaf cleaned"
    ],
    "instructions": [
      "Place the glutinous rice in a mixing bowl then pour-in water. Stir and soak for 2 to 3 hours.",
      "Drain excess water from the mixing bowl then add lye water and stir thoroughly. The mixture will turn yellowish. Let stand for 30 minutes. Note: do not go beyond the recommended measurement for lye water.",
      "Prepare the banana leaves. Note: Fresh banana leaves can be heated directly in fire for a very short time. This releases the natural aroma of the leaf and makes it more flexible. If you are using fresh frozen banana leaves, it is better to just wash it in warm water. You’ll need a pair of leaves per serving. The bigger leaf should measure about 12 by 10 inches while the smaller is 4 by 5 inches.",
      "Arrange the banana leaves by placing the larger leaf first in a flat surface then put the smaller leaf in the center of the larger leaf.",
      "Scoop about 1/4 cup of the rice mixture and place it over the smaller leaf.",
      "Fold the leaf to secure the rice mixture (see video for procedure) and tie with a kitchen twine.",
      "Arrange the folded banana leaves with rice mixture in a cooking pot then pour-in enough water.",
      "Turn-on heat then let boil. Simmer for 80 minutes.",
      "Turn-off heat and transfer the banana leaf covered rice cake on a serving dish.",
      "Serve with white sugar, brown sugar, or latik.",
      "Share and enjoy!"
    ],
    "cooking_time": "1 hour",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/suman-sa-lihiya/",
    "image_url": "",
    "image_path": "",
    "category": "Desserts"
  }
]