[
  {
    "title": "Pork and Chicken Adobo Recipe",
    "ingredients": [
      "▢ 1 1/2 lbs pork belly chopped",
      "▢ 1 1/2 lbs chicken cut into serving pieces",
      "▢ 4 pieces dried bay leaves",
      "▢ 2 teaspoons whole peppercorn",
      "▢ 1 head  garlic slightly crushed",
      "▢ 6 tablespoons vinegar white",
      "▢ 1/2 cup soy sauce",
      "▢ 1 tablespoon oyster sauce",
      "▢ 2 teaspoons brown sugar",
      "▢ 2 cups water",
      "▢ Salt to taste",
      "▢ 3 tablespoons cooking oil"
    ],
    "instructions": [
      "Heat oil in a pan",
      "Once the oil becomes hot, add the garlic. Cook until the color turns golden brown.",
      "Remove the garlic and set aside. Add pork and chicken. Cook for 5 minutes or until the color turns light brown.",
      "Add whole peppercorn, bay leaves, oyster sauce, soy sauce, and water. Let boil and simmer until the meat gets tender.",
      "Add the sugar and stir.",
      "Pour-in vinegar and let boil.Simmer until most of the liquid evaporates.",
      "Add salt to taste. Put-in the fried garlic, stir, and cook for 2 minutes.",
      "Serve. Share and enjoy!"
    ],
    "cooking_time": "1 hour",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/pork-and-chicken-adobo/",
    "image_url": "",
    "image_path": "",
    "category": "Chicken Dishes"
  },
  {
    "title": "Red Wine Beef Stew",
    "ingredients": [
      "▢ 2 lbs. beef chuck cubed",
      "▢ 1 1/2 cup red wine",
      "▢ 3 cups beef broth",
      "▢ 4 strips  bacon chopped",
      "▢ 15 pieces pearl onion",
      "▢ 3 ounces tomato paste",
      "▢ 1 piece carrot sliced",
      "▢ 5 sprigs thyme",
      "▢ 1 piece onion chopped",
      "▢ 6 cloves garlic minced",
      "▢ Salt and pepper to taste"
    ],
    "instructions": [
      "Sear bacon in a cooking pot until fat gets extracted.",
      "Add onion. Cook for 25 seconds while stirring.",
      "Add minced garlic. Sauté for 30 seconds.",
      "Put the beef into the pot and then continue to cook until the color turns light brown.",
      "Add tomato paste and then stir.",
      "Pour red wine and beef broth into the pan. Stir and let boil.",
      "Add carrot and thyme. Cover the pot and continue to cook between low to medium heat for 2 to 3 hours or until beef gets tender.",
      "Put the pearl onions into the pot. Cook for 5 minutes.",
      "Season with salt and ground black pepper.",
      "Transfer to a serving plate. Serve. Share and enjoy!"
    ],
    "cooking_time": "N/A",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/red-wine-beef-stew/",
    "image_url": "",
    "image_path": "",
    "category": "Other Filipino Dishes"
  },
  {
    "title": "Paksiw na Pata Recipe",
    "ingredients": [
      "▢ 2 lbs Pork hock pata, sliced crosswise",
      "▢ 1 teaspoon garlic crushed",
      "▢ ½ cup soy sauce",
      "▢ 2 cups water",
      "▢ 3 tablespoons vinegar",
      "▢ ½ cup brown sugar",
      "▢ 100 grams banana blossoms dried, soaked in water",
      "▢ 5 pieces dried bay leaves",
      "▢ 1 tablespoon whole pepper corn",
      "▢ Salt  to taste"
    ],
    "instructions": [
      "Boil 6 cups water in a pot. Add the pork hock. Continue to boil for 15 minutes. Discard water and wash the pork with running water until all impurities are cleaned.",
      "Pour the water in a pot and bring to a boil. Add the whole pepper corn and dried bay leaves",
      "Pour soy sauce into the pot and add the garlic.",
      "Put-in the sliced pork hock and simmer for 1 to 1.5 hours (or cook in pressure cooker for 30 minutes)",
      "Add the vinegar and simmer for 10 minutes",
      "Place the banana blossoms in and simmer for 5 to 7 minutes",
      "Add the brown sugar and salt and simmer for 2 minutes",
      "Serve hot. Share and Enjoy!"
    ],
    "cooking_time": "1 hour",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/filipino-food-network-pork-recipe-paksiw-na-pata-ng-baboy/",
    "image_url": "",
    "image_path": "",
    "category": "Pork Dishes"
  },
  {
    "title": "Galbi Recipe",
    "ingredients": [
      "▢ 3 lbs beef short ribs sliced",
      "▢ 3/4 cups light soy sauce",
      "▢ 3 tablespoons garlic minced",
      "▢ 4 tablespoons brown sugar",
      "▢ 2 tablespoons granulated white sugar",
      "▢ 1 tablespoon rice wine",
      "▢ 1 tablespoon sesame oil",
      "▢ 1/4 teaspoon chili powder"
    ],
    "instructions": [
      "Make the marinade by combining soy sauce, garlic, sugars, rice wine, sesame oil, and chili powder in a bowl. Stir.",
      "Place the beef short ribs in a heavy duty freezer bag and pour in the marinade.",
      "Secure the freezer bag by sealing the edges. Make sure to release all the air inside the bag before closing.",
      "Place the bag in the fridge and marinate overnight.",
      "Grill the short ribs for about 4 to 8 minutes per side (depending on the heat) while basting with the remaining marinade.",
      "Place in a serving plate. Serve.",
      "Share and enjoy!"
    ],
    "cooking_time": "3 hours",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/galbi/",
    "image_url": "",
    "image_path": "",
    "category": "Other Filipino Dishes"
  },
  {
    "title": "Paklay Recipe",
    "ingredients": [
      "▢ 1 cup bamboo shoots julienned",
      "▢ 1 lb. pig liver sliced into thin strips",
      "▢ 20 oz pineapple chunks",
      "▢ 5 pieces dried bay leaves",
      "▢ 1/2 lb. pig kidney cleaned",
      "▢ 1/2 lb. pig heart",
      "▢ 1 lb. ox tripe",
      "▢ 1/2 lb. pig stomach",
      "▢ 1 piece red onion minced",
      "▢ 1 head garlic minced",
      "▢ 2 1/2 teaspoons annatto powder",
      "▢ 2 thumbs ginger minced",
      "▢ 1 piece red bell pepper julienned",
      "▢ 1 piece beef cube or 2 teaspoons beef powder",
      "▢ 2 cups water  for cooking",
      "▢ 5 cups water  for boiling",
      "▢ salt and pepper to taste",
      "▢ 3 tablespoons olive oil"
    ],
    "instructions": [
      "Boil 5 cups of water in a large cooking pot.5 cups water",
      "Once the water starts to boil, add 1 tablespoon of salt, pig stomach, and ox tripe. Boil over medium heat for 60 minutes.1/2 lb. pig stomach, salt and pepper to taste, 1 lb. ox tripe",
      "Add the kidney and heart. Continue to boil for another 60 minutes or until all the innards are tender. Discard the water and let the innards cool down. Chop the innards and set aside.1/2 lb. pig kidney, 1/2 lb. pig heart",
      "Meanwhile, heat the cooking oil in a large clean pot.3 tablespoons olive oil",
      "Sauté the onion, garlic, and ginger until the onion becomes soft.1 piece red onion, 1 head garlic, 2 thumbs ginger",
      "Add the chopped innards, bay leaves, and liver. Cook for 3 minutes.5 pieces dried bay leaves, 1 lb. pig liver",
      "Add the pineapple chunks, bell pepper, and beef cube.20 oz pineapple chunks, 1 piece red bell pepper, 1 piece beef cube or 2 teaspoons beef powder",
      "Pour in 2 cups of water and add the annatto powder. Stir and let it boil.2 cups water, 2 1/2 teaspoons annatto powder",
      "Add the bamboo shoots, cover, and simmer for 25 minutes. Add more water if needed.1 cup bamboo shoots",
      "Season with salt and pepper to taste.salt and pepper to taste",
      "Transfer to a serving bowl.",
      "Serve, share, and enjoy!"
    ],
    "cooking_time": "2 hours",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/paklay-recipe/",
    "image_url": "",
    "image_path": "",
    "category": "Other Filipino Dishes"
  },
  {
    "title": "Air Fryer Bangus Salpicao",
    "ingredients": [
      "▢ 1 piece boneless milkfish",
      "▢ 4 teaspoons  garlic minced",
      "▢ 5 tablespoons extra virgin olive oil",
      "▢ 5 tablespoons Worcestershire sauce",
      "▢ 1/2 teaspoon salt",
      "▢ 4 tablespoons cooking oil",
      "▢ 1/4 teaspoon ground black pepper"
    ],
    "instructions": [
      "Slice the boneless bangus into serving pieces.",
      "Prepare the marinade. Combine half of the garlic, ground black pepper, salt, olive oil, and Worcestershire sauce in a bowl. Mix well.",
      "Place the milksfish inside a resealable bag. Add the marinade. Make sure that the fish gets coated all throughout. Release the air from the bag and seal. Marinate for 30 minutes.",
      "Prepare the toasted garlic. Heat cooking oil in a sauce pan. Add remaining garlic. Cook until golden brown. Separate the garlic from the oil using a kitchen sieve. Set aside.",
      "Arrange the marinated milkfish in an air fryer. Air-fry for 8 minutes at 350F.",
      "Remove from the air fryer. Arrange on a serving plate. Top the milkfish with toasted garlic and chopped parsley. Serve. Share and enjoy!"
    ],
    "cooking_time": "N/A",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/air-fryer-bangus-salpicao/",
    "image_url": "",
    "image_path": "",
    "category": "Seafood"
  },
  {
    "title": "Chicken Lumpia",
    "ingredients": [
      "▢ 30 pieces lumpia wrapper",
      "▢ 2 cups cooking oil",
      "▢ 1 ¼ lbs. ground chicken",
      "▢ 2 sachet Knorr SavorRich Chicken Liquid Seasoning",
      "▢ 1 piece onion minced",
      "▢ ¾ cup carrot minced",
      "▢ 1 piece egg",
      "▢ ½ teaspoon ground black pepper"
    ],
    "instructions": [
      "Combine all the lumpia filling ingredient in a large bowl. Mix well.1 ¼ lbs. ground chicken, 2 sachet Knorr SavorRich Chicken Liquid Seasoning, 1 piece onion, ¾ cup carrot, 1 piece egg, ½ teaspoon ground black pepper",
      "Start to wrap the lumpia. Lay a piece of lumpia wrapper on a flat surface. Scoop 1 ½ tablespoons of ground chicken mixture and place it on the lower bottom part of the wrapper, 2 inches from the tip. Spread the mixture sideways 3 ½ to 4 inches in length. Initially fold the bottom part of the wrapper until the meat mixture is covered. Fold the sides of the wrapper inward to secure the mixture. Roll from bottom to top and secure by brushing a bit of water on the tip of the wrapper. Perform this step until all the meat mixture is consumed.30 pieces lumpia wrapper",
      "Heat oil in a pan to around 260F.2 cups cooking oil",
      "Deep fry a batch of chicken lumpia for 8 minutes. Note: cooking in low heat over a long period of time ensures that the meat gets cooked completely while the wrapper slowly browns.",
      "Remove the fried chicken lumpia from the pan. Arrange over a wire rack or on a plate lined with paper towel. Let it cool down for 5 minutes.",
      "Transfer to a serving plate. Enjoy!"
    ],
    "cooking_time": "N/A",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/chicken-lumpia/",
    "image_url": "",
    "image_path": "",
    "category": "Vegetable Dishes"
  },
  {
    "title": "Fried Ham and Cheese Roll",
    "ingredients": [
      "▢ 8 slices bread",
      "▢ 4 ounces ham sliced into thick strips",
      "▢ 3 ounces cheese sliced into thick strips",
      "▢ 1/4 cup pimento optional",
      "▢ 3/4 cup Panko bread crumbs",
      "▢ 2 pieces eggs beaten",
      "▢ 2 cups cooking oil",
      "▢ 1/2  cup mayonnaise"
    ],
    "instructions": [
      "Remove the dark ends of the sliced bread.",
      "Heat the cooking oil in a cooking pot.",
      "Place the bread slices in a zip lock bag. Flatten using a rolling pin.",
      "Spread mayonnaise on the flatten piece of bread",
      "Arrange the ham, cheese, and pimento strips on the bread. Roll the bread until the filling is covered. Secure with a toothpick.",
      "Dip the rolled bread in beaten egg. Place the Panko bread crumbs in a large Ziploc bag and then put the dipped rolls in. Shake until everything is covered with crumbs.",
      "Fry in low to medium heat until the color turns golden brown (about 5 to 7 minutes).",
      "Arrange the fried rolls in a plate line with paper towels.",
      "Serve as a snack or slice into pieces and serve as an appetizer.",
      "Share and enjoy!"
    ],
    "cooking_time": "17 minutes",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/fried-ham-and-cheese-roll/",
    "image_url": "",
    "image_path": "",
    "category": "Other Filipino Dishes"
  },
  {
    "title": "Chicken Pasta with Creamy Basil Sauce",
    "ingredients": [
      "▢ 3/4 lb. bowtie pasta",
      "▢ 2 cups broccoli florets",
      "▢ 3 tablespoons Knorr SavorRich Chicken Liquid Seasoning",
      "▢ 12 ounces chicken breast cubed",
      "▢ 1/2 pint heavy whipping cream",
      "▢ 1 cup fresh milk",
      "▢ 1/4 cup basil chopped",
      "▢ 1/2 cup cheddar cheese shredded",
      "▢ 1/4 all-purpose flour",
      "▢ 5 tablespoons salted butter",
      "▢ 1/8 teaspoon ground black pepper",
      "▢ Water for cooking the pasta"
    ],
    "instructions": [
      "Prepare the chicken by adding 3 tablespoons of Knorr SavorRich Chicken Liquid Seasoning. Mix until the chicken is completely coated. Let it stay for 15 minutes.",
      "Boil water in a cooking pot. Add pasta. Cook for 7 minutes. Put the broccoli into the same pot. Boil for 4 minutes. Drain the water and set the pasta and broccoli aside.",
      "Melt 1 ½ tablespoons butter in a pan. Add the marinated chicken once the butter starts to bubble. Continue to cook for 5 minutes more after the chicken turns light brown. Set aside.",
      "Prepare the creamy basil sauce by melting the remaining butter on a cooking pot. Add all-purpose flour and stir thoroughly until both ingredients are well blended. Pour milk and continue to stir until it starts to boil. Add the fresh chopped basil. Stir and cook for 30 seconds. Pour heavy whipping cream and add cheese. Stir until all ingredients are well blended.",
      "Add the cooked chicken back into the pot. Stir. Cook for 30 seconds.",
      "Add red bell pepper and season with ground black pepper.",
      "Put the cooked pasta and broccoli back into the pot. Toss.",
      "Transfer to a serving plate. Share and enjoy!"
    ],
    "cooking_time": "N/A",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/chicken-pasta-with-creamy-basil-sauce/",
    "image_url": "",
    "image_path": "",
    "category": "Chicken Dishes"
  },
  {
    "title": "Sinigang na Pata with Gabi",
    "ingredients": [
      "▢ 4 lbs. pata",
      "▢ 1 piece Knorr Pork Cube",
      "▢ 40 grams Knorr Sinigang sa Sampaloc Recipe Mix",
      "▢ 1 bunch kangkong",
      "▢ 1 piece Chinese eggplant sliced",
      "▢ 12 pieces snake beans sliced in 2 inch length",
      "▢ 2 pieces tomato wedged",
      "▢ 3 pieces taro (gabi)sliced in half",
      "▢ 10 pieces okra",
      "▢ 1 piece onion sliced",
      "▢ 3 pieces long green pepper",
      "▢ 8 cups water",
      "▢ 1/2 teaspoon salt",
      "▢ Fish sauce and ground black pepper to taste"
    ],
    "instructions": [
      "Boil water in a cooking pot. Add pata. Boil for 15 minutes. Discard the water and clean the pata by washing in running water.",
      "Pour 6 cups water into a pressure cooker. Add boiled pata and salt. Pressure cook for 12 minutes.",
      "Transfer everything in a large cooking pot. Add 2 cups water. Let boil.",
      "Add onion and taro. Cover the pot and boil for 15 minutes.",
      "Put the tomato into the pot and add Knorr Pork Cube and Knorr Sinigang sa Sampaloc Recipe Mix. Stir. Cook for 5 minutes.",
      "Add long green pepper, eggplant, okra, snake beans, and kangkong stalk. Cover and cook for 5 minutes.",
      "Season with ground black pepper and fish sauce.",
      "Add kangkong leaves. Turn the heat off. Cover the pot and let the residual heat completely cook the leaves.",
      "Transfer to a serving bowl. Share and enjoy!"
    ],
    "cooking_time": "N/A",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/sinigang-na-pata-with-gabi/",
    "image_url": "",
    "image_path": "",
    "category": "Seafood"
  },
  {
    "title": "Pork Lomi",
    "ingredients": [
      "▢ 12 ounces pork belly",
      "▢ 1 piece Knorr Pork Cube",
      "▢ 12 ounces fresh noodles",
      "▢ 1 piece Chorizo de Bilbao",
      "▢ 1 cup cabbage shredded",
      "▢ 1/2 cup carrot sliced",
      "▢ 1 piece egg",
      "▢ 1 1/2 tablespoons cornstarch",
      "▢ 1 piece onion chopped",
      "▢ 4 cloves garlic minced",
      "▢ 6 cups water",
      "▢ Salt and ground black pepper to taste"
    ],
    "instructions": [
      "Boil 5 cups water in a cooking pot. Add pork belly. Cover and continue to boil between low to medium heat for 30 minutes. Remove the pork from the pot and slice into thin pieces. Save the pork stock.",
      "Heat oil on a clean cooking pot. Sauté garlic and onion.",
      "Once the onion softens, add chorizo. Sauté for 2 minutes.",
      "Add the sliced boiled pork. Sauté for 1 minute.",
      "Pour pork stock into the pot and add 1 to 2 cups water. Let boil.",
      "Add Knorr Pork Cube. Stir. Cover the pot and cook for 10 minutes.",
      "Add carrots, cabbage, and fresh noodles. Stir. Cover and cook for 8 minutes.",
      "Combine cornstarch and ½ cup water. Stir until well blended. Pour the mixture into the pot and stir thoroughly until the soup thickens.",
      "Crack a piece of egg into the pot. Stir until well distributed.",
      "Season with salt and ground black pepper.",
      "Serve. Share and enjoy!"
    ],
    "cooking_time": "N/A",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/pork-lomi/",
    "image_url": "",
    "image_path": "",
    "category": "Pork Dishes"
  },
  {
    "title": "Ginataang Bitsuelas",
    "ingredients": [
      "▢ 2 cups long green beans sliced",
      "▢ 1 cup spinach",
      "▢ 3 tablespoons shrimp paste bagoong alamang",
      "▢ 3 ounces pork sliced into small thin pieces",
      "▢ 2 cups coconut milk",
      "▢ 3 pieces Thai chili chopped",
      "▢ 1 thumb  ginger minced",
      "▢ 1 piece onion chopped",
      "▢ 3 cloves garlic minced",
      "▢ 3 tablespoons cooking oil",
      "▢ ground black pepper to taste"
    ],
    "instructions": [
      "Heat oil in a pan.",
      "Saute onion, garlic, and ginger.",
      "Add pork once the onion softens. Cook until the color of the pork turns brown.",
      "Pour coconut milk into the pot. Let boil.",
      "Add chili pepper. Stir. Cover the pot and cook between low to medium heat for 15 minutes.",
      "Add shrimp paste (bagoong alamang). Stir and cook for 3 to 5 minutes.",
      "Put the sliced long green beans in the pot. Stir and cook for 3 minutes.",
      "Add spinach. Cook for 1 minute.",
      "Season with ground black pepper. Note: you can add salt if needed.",
      "Transfer to a serving bowl. Serve. Share and enjoy!"
    ],
    "cooking_time": "N/A",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/ginataang-bitsuelas/",
    "image_url": "",
    "image_path": "",
    "category": "Pork Dishes"
  }
]