[
  {
    "title": "Ginisang Pechay at Giniling with Oyster Sauce",
    "ingredients": [
      "▢ 2 bunches pechay chopped",
      "▢ 6 ounces ground pork",
      "▢ 4 tablespoons oyster sauce",
      "▢ 1 piece onion chopped",
      "▢ 4 cloves garlic minced",
      "▢ 1 cup water",
      "▢ Salt and ground black pepper to taste",
      "▢ 3 tablespoons cooking oil"
    ],
    "instructions": [
      "Heat oil in a pan. Saute onion and garlic.",
      "Once the onion softens, add ground pork. Continue to saute until color turns light brown.",
      "Add oyster sauce and water. Stir. Cook uncovered in medium heat until water reduces to half.",
      "Put the pechay into the pan. Cover and cook for 2 minutes.",
      "Season with salt and ground black pepper.",
      "Serve with rice. Enjoy!"
    ],
    "cooking_time": "N/A",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/ginisang-pechay-at-giniling-with-oyster-sauce/",
    "image_url": "",
    "image_path": "",
    "category": "Vegetable Dishes"
  },
  {
    "title": "Talong Bola Bola",
    "ingredients": [
      "▢ 2 pieces Chinese eggplant",
      "▢ 6 ounces ground pork",
      "▢ 3/4 cup bread crumbs",
      "▢ 3/4 cup all-purpose flour",
      "▢ 1 piece onion minced",
      "▢ 1 teaspoon garlic powder",
      "▢ 1 piece egg",
      "▢ 1 1/2 teaspoons salt",
      "▢ 1/2 teaspoon ground black pepper",
      "▢ 1 1/2 cups cooking oil",
      "▢ 4 cups water for boiling",
      "▢ ½ cup mayonnaise",
      "▢ ¼ cup banana ketchup"
    ],
    "instructions": [
      "Boil water in a cooking pot. Add eggplant. Cover and continue to boil for 6 minutes or until tender. Remove from the pot and let it cool down. Peel the skin off the eggplant and chop into small pieces.",
      "Arrange the eggplant in a bowl. Add ground pork, onion, salt, ground black pepper, garlic powder, egg, and all-purpose flour. Mix until all ingredients are well blended.",
      "Heat oil in a cooking pot using low fire.",
      "Scoop a portion of the mixture. Dredge in breadcrumbs. Deep-fry for 8 minutes. Remove from the pot and arrange on a wire rack. Note: continue to perform this step until the entire mixture is consumed.",
      "Prepare the dipping sauce by combining mayonnaise and banana ketchup. Mix well.",
      "Transfer the fried meatballs and dipping sauce on a serving plate and bowl respectively. Serve. Share and enjoy!"
    ],
    "cooking_time": "N/A",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/talong-bola-bola/",
    "image_url": "",
    "image_path": "",
    "category": "Pork Dishes"
  },
  {
    "title": "Kilawing Labanos",
    "ingredients": [
      "▢ 1 piece daikon radish",
      "▢ 5 ounces pork minced",
      "▢ 3 ounces pork liver minced",
      "▢ 3/4 cup white vinegar",
      "▢ 1 1/2 teaspoons sugar",
      "▢ 1 piece onion sliced",
      "▢ 4 cloves garlic minced",
      "▢ 3 tablespoons cooking oil",
      "▢ 2 tablespoons salt for prep",
      "▢ Salt and pepper to taste"
    ],
    "instructions": [
      "Slice the daikon radish into thin pieces. Arrange in a bowl and then add 2 tablespoons salt. Rub salt all over the radish slices and let is stay for 15 minutes. Squeeze the juice out of the radish. Rinse with water until all the salt goes off. Squeeze to release water.",
      "Combine prepared radish, pork, pork liver, sugar, onion, and white vinegar in a large bowl. Toss until well blended. Marinate for 20 minutes.",
      "Heat oil in a cooking pot. Saute garlic until golden brown.",
      "Add the marinated mixture. Let boil. Stir and then adjust the heat between low to medium. Cover the pot and continue to cook for 20 to 25 minutes.",
      "Season with salt and ground black pepper. Serve with warm white rice."
    ],
    "cooking_time": "N/A",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/kilawing-labanos/",
    "image_url": "",
    "image_path": "",
    "category": "Pork Dishes"
  },
  {
    "title": "Nilagang Manok",
    "ingredients": [
      "▢ 1 1/2 lbs. chicken sliced into serving pieces",
      "▢ 3 pieces Saba banana sliced",
      "▢ 2 pieces potato cubed",
      "▢ 5 cups water",
      "▢ 2 cups chicken broth",
      "▢ 2 bunches bok choy base removed",
      "▢ 1 piece onion wedged",
      "▢ 3 tablespoons fish sauce",
      "▢ 1 teaspoon whole peppercorn"
    ],
    "instructions": [
      "Boil water in a pot.",
      "Add onion and whole peppercorn. Pour-in chicken broth. Cover and let boil.",
      "Gently add chicken pieces. Boil in medium heat for 30 minutes.",
      "Add banana and potato. Cover and continue to boil for 12 minutes.",
      "Season with fish sauce.",
      "Add bok choy. Cover the pot and let the residual heat cook it for around 5 minutes.",
      "Transfer to a serving bowl. Serve with white rice. Share and enjoy!"
    ],
    "cooking_time": "N/A",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/nilagang-manok/",
    "image_url": "",
    "image_path": "",
    "category": "Soups And Stews"
  },
  {
    "title": "Ube Kalamay Recipe",
    "ingredients": [
      "▢ 4 cups coconut milk",
      "▢ 3/4 cup grated purple yam ube",
      "▢ 2 teaspoons purple ube flavoring",
      "▢ 2 cups glutinous rice flour",
      "▢ 1 ½ cup granulated white sugar",
      "▢ ½ cup latik",
      "▢ 2 tablespoons coconut oil"
    ],
    "instructions": [
      "Combine water, glutinous rice flour, and 2 cups of coconut milk in a bowl. Mix well using a wire whisk. Set aside.",
      "Heat a cooking pot. Pour 2 cups of coconut milk. Let boil.",
      "Add shredded purple yam. Stir and cook in medium heat for 3 minutes.",
      "Pour the glutinous rice flour mixture into the cooking pot. Stir until all the ingredients are well blended.",
      "Gradually add the sugar while stirring. Continue to cook until the mixture becomes very thick.",
      "Brush coconut oil in a mold (I used a quiche mold for this recipe). Put the cooked ube kalamay in the mold. Spread it around the mold. Brush remaining coconut oil over the ube kalamay. Flatten top using a spoon. Top with latik.",
      "Let the kalamay cool down for 1 hour. Serve.",
      "Share and enjoy!"
    ],
    "cooking_time": "1 hour",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/ube-kalamay-recipe/",
    "image_url": "",
    "image_path": "",
    "category": "Other Filipino Dishes"
  },
  {
    "title": "Sweet and Sour Pork Recipe",
    "ingredients": [
      "▢ 1 lb pork sliced",
      "▢ 1 piece red bell pepper",
      "▢ 1 piece green bell pepper",
      "▢ 3 tablespoons soy sauce",
      "▢ 1 piece red onion wedged",
      "▢ 1 piece carrot sliced",
      "▢ 1/2 cup all-purpose flour",
      "▢ 3 tablespoons cornstarch",
      "▢ 1 1/4 cup water",
      "▢ 3 1/2 tablespoons vinegar",
      "▢ 5 tablespoons tomato ketchup",
      "▢ 4 tablespoons white sugar",
      "▢ Salt and pepper to taste"
    ],
    "instructions": [
      "Place the pork loin in a bowl. Add soy sauce (you may also add salt if desired). Marinate for 10 minutes.",
      "Pour the cooking oil in a pan then apply heat.",
      "Combine the flour and cornstarch in a bowl then mix until both ingredients are evenly distributed.",
      "Dip the marinated pork in beaten egg then on the flour and cornstarch mixture.",
      "Deep fry the pork (coated with cornstarch and flour) for 10 minutes or until the color turns medium brown. Set aside.",
      "Heat a separate pan then pour-in the sweet and sour sauce ingredients. Let boil.",
      "Add the carrots. Cook for 3 minutes.",
      "Put-in the onions and bell pepper (green and red). Cook for 4 minutes (add extra water as needed).",
      "Add the deep-fried pork loin and stir. Cook for 2 minutes. Season with salt and pepper.",
      "Transfer to a serving dish and serve hot. Share and enjoy!"
    ],
    "cooking_time": "1 hour",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/sweet-and-sour-pork-recip/",
    "image_url": "",
    "image_path": "",
    "category": "Pork Dishes"
  },
  {
    "title": "Chicken Adobo Fried Rice and Tortang Corned Beef",
    "ingredients": [
      "▢ 1  cup chicken adobo shredded and chopped",
      "▢ 4 cups leftover rice",
      "▢ 1/2  teaspoon salt",
      "▢ 4 cloves garlic crushed",
      "▢ 3 tablespoons cooking oil",
      "▢ 1 1/2 cups corned beef sauteed",
      "▢ 1 piece egg",
      "▢ 1/8 teaspoon  ground black pepper",
      "▢ 4  tablespoons  cooking oil"
    ],
    "instructions": [
      "Prepare the omelette by combining corned beef, egg, and ground black pepper in a bowl. Mix well.",
      "Heat 4 tablespoons of cooking oil in a pan. Scoop a quarter portion of the corned beef mixture and fry. Gently flatten the mixture in the pan and continue to fry in medium heat for 1 to 2 minutes. Flip the corned beef omelette and fry the opposite side until done. Remove from the pan and place in a clean plate. Perform the same steps until the mixture is completely consumed.",
      "Prepare the rice by combining rice and salt. Gently mix while trying to separate the rice with each other.",
      "Heat 3 tablespoons oil in a pan. Add crushed garlic. Continue to cook in medium heat until garlic turns light brown in color.",
      "Add chopped chicken adobo. Stir-fry for 1 minute.",
      "Add rice. Toss and stir-fry for 3 to 5 minutes.",
      "Transfer the chicken adobo fried rice in a plate and then top with tortang corned beef. Serve with your favorite condiment.",
      "Share and enjoy!"
    ],
    "cooking_time": "N/A",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/chicken-adobo-fried-rice-and-tortang-corned-beef/",
    "image_url": "",
    "image_path": "",
    "category": "Chicken Dishes"
  },
  {
    "title": "Grilled Tuna Belly",
    "ingredients": [
      "▢ 4 lbs. Tuna belly",
      "▢ 1 cup soy sauce",
      "▢ 2 tablespoons sugar",
      "▢ 4 pieces calamansi",
      "▢ ¼ teaspoon ground black pepper"
    ],
    "instructions": [
      "Prepare the marinade by combine soy sauce, calamansi, ground black pepper, and sugar in a bowl. Stir until well blended.",
      "Place the tuna in a Ziploc bag. Pour the soy sauce marinade.Let the air out of the bag. Seal. Marinate inside the fridge for at least 3 hours.",
      "Heat-up the grill. Arrange the tuna belly on the grate of the grill. Brush a generous amount marinade mixture on the tuna.  Grill for 3 to 5 minutes.",
      "Turn the tuna belly over and grill the opposite side. Baste the top and sides. Continue to grill for another 5 minutes. Continue performing the process until the tuna is completely cooked.",
      "Serve with a dipping sauce composed of soy sauce, calamansi, and chili pepper. Share and enjoy!"
    ],
    "cooking_time": "N/A",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/grilled-tuna-belly/",
    "image_url": "",
    "image_path": "",
    "category": "Other Filipino Dishes"
  },
  {
    "title": "Fried Tilapia Recipe",
    "ingredients": [
      "▢ 2 pieces tilapia cleaned and scales removed",
      "▢ 2 teaspoons salt",
      "▢ 1 cup cooking oil"
    ],
    "instructions": [
      "Rub salt all over the fish including the insides.",
      "Heat oil in a wide frying pan",
      "When the oil is hot, put-in the tilapia. Cover the frying pan, but make sure to open it a little so that steam can come out. Fry each side in medium heat for about 6 to 10 minutes. Note: I usually wait until I don’t hear any sound. This means that the liquid is gone and the fish is crisp.",
      "Remove from the pan and arrange in a serving plate.",
      "Serve with your favorite condiments and side dish.",
      "Share and enjoy!"
    ],
    "cooking_time": "20 minutes",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/filipino-food-fried-fish-tilapia-dish/",
    "image_url": "",
    "image_path": "",
    "category": "Seafood"
  },
  {
    "title": "Suman sa Ibos Recipe",
    "ingredients": [
      "▢ 4 cups glutinous rice",
      "▢ 1 1/4 tablespoons sea salt",
      "▢ 2 1/4 cups coconut milk",
      "▢ 1 cup water"
    ],
    "instructions": [
      "Make the buri container by swirling the buri leaves on a mold that is about 1 1/2 inches in width. Lock the cylindrical leaf container that you made to prevent the leaf from swirling back.",
      "Wash the rice and then place in a large bowl.",
      "Pour-in water. Let the rice absorb the water.",
      "Pour-in the coconut milk and then add the salt. Gently mix and let stand for 10 minutes.",
      "Scoop the mixture to the buri container and then seal. Set aside.",
      "Arrange the suman in a large cooking pot. Pour-in about a quart of water. Let boil.",
      "Adjust the heat to low-medium and let the suman cook for 60 to 90 minutes.",
      "Remove from the cooking pot. Let the temperature cool down.",
      "Serve with ripe mangoes on the side. Share and enjoy!"
    ],
    "cooking_time": "1 hour",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/suman-sa-ibos-recipe/",
    "image_url": "",
    "image_path": "",
    "category": "Desserts"
  },
  {
    "title": "Turon Recipe (Banana Lumpia with Caramel)",
    "ingredients": [
      "▢ 6 pieces bananas saba or plantains, cut in half (lengthwise)",
      "▢ 1 cup jackfruit ripe, sliced",
      "▢ 1 1/2 cup sugar",
      "▢ 12 pieces lumpia wrapper",
      "▢ 2 cups cooking oil"
    ],
    "instructions": [
      "Roll the banana on the sugar plate and ensure that the banana is coated with enough sugar6 pieces bananas, 1 1/2 cup sugar",
      "Place the banana with sugar coating on the lumpia wrapper. Add a slice of ripe jackfruit on top.12 pieces lumpia wrapper, 1 cup jackfruit",
      "Fold and lock the spring roll wrapper, use water to seal the edge",
      "In a pan, heat the oil and put-in some sugar.Wait until the brown sugar floats2 cups cooking oil",
      "Put-in the wrapped banana and fry until the wrapper turns golden brown and the extra sugar sticks on wrapper",
      "Serve hot as a dessert or snack. Share and Enjoy!"
    ],
    "cooking_time": "22 minutes",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/turon/",
    "image_url": "",
    "image_path": "",
    "category": "Vegetable Dishes"
  },
  {
    "title": "Asian Beef with Mushroom",
    "ingredients": [
      "▢ 1 lb. sirloin thinly sliced and cut into serving pieces",
      "▢ 1 1/2 cups white mushrooms sliced",
      "▢ 15 pieces snow peas",
      "▢ 6 tablespoons soy sauce",
      "▢ 1/2 teaspoon  ginger minced",
      "▢ 1/2 teaspoon garlic powder",
      "▢ 1/2 cup beef broth",
      "▢ 1 piece yellow onion sliced",
      "▢ 1/4 cup cooking wine",
      "▢ 3 tablespoons cooking oil",
      "▢ 1 1/2 tablespoons cornstarch  diluted in 3 tablespoons water",
      "▢ 1/8 teaspoon ground black pepper",
      "▢ Salt to taste"
    ],
    "instructions": [
      "Combine soy sauce, ginger, garlic powder, ground black pepper, and sherry (or Chinese cooking wine) in a bowl. Mix well. Set aside",
      "Meanwhile, heat the cooking oil in a wok or wide pan.",
      "Once the oil gets hot, slowly add the beef slices. Stir fry for 1 to 2 minutes until the beef turns brown.",
      "Add the onion. Cook for 1 minute.",
      "Put-in the mushrooms and snow peas. continue to stir fry for 1 minute.",
      "Pour-in the soy sauce mixture. Stir. Make sure that all the ingredients are blended properly. Continue to cook for a minute.",
      "Pour-in the beef broth. Let boil. Add the cornstarch diluted in water. Stir. Cook until the sauce gets thick.",
      "Add salt if needed.",
      "Transfer to a serving plate. Serve.",
      "Share and enjoy!"
    ],
    "cooking_time": "30 minutes",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/asian-beef-with-mushroom/",
    "image_url": "",
    "image_path": "",
    "category": "Other Filipino Dishes"
  }
]