[
  {
    "title": "All Out Pancit Canton",
    "ingredients": [
      "▢ 350 grams pancit canton noodles",
      "▢ 1 Knorr shrimp cube",
      "▢ 1/2 lb. shrimp head and shell removed",
      "▢ 3 ounces chicken breast sliced",
      "▢ 2 links  Chinese sausage sliced",
      "▢ 6 squid balls halved",
      "▢ 2 tablespoons oyster sauce",
      "▢ 4 tablespoons soy sauce",
      "▢ 3 tablespoons parsley chopped",
      "▢ 1 onion sliced",
      "▢ 4 cloves garlic crushed",
      "▢ 8 cups water",
      "▢ 3 tablespoons cooking oil",
      "▢ Salt and ground black pepper to taste",
      "▢ 1 red bell pepper sliced",
      "▢ 1 green bell pepper sliced",
      "▢ ½ head  cabbage  chopped",
      "▢ 1 cup carrots  julienned",
      "▢ 3 ounces snow peas"
    ],
    "instructions": [
      "Boil water and then add salt. Put the pancit canton noodles. Cook for 2 minutes. Remove the noodles and set aside.",
      "Using the remaining water, blanch the vegetable ingredients for 1 to 2 minutes. Remove from the pot and soak in ice cold water for 30 seconds. Drain the water and set the vegetables aside.",
      "Heat oil in a clean cooking pot. Saute onion and garlic until the onion softens.",
      "Add chicken breast, squid balls, and Chinese sausage. Saute for 1 to 2 minutes.",
      "Add the shrimp. Cook for 1 minute.",
      "Pour the soy sauce in the cooking pot and then add oyster sauce, and 1 cup water. Let the liquid boil.",
      "Add Knorr shrimp cube. Stir and gently toss-in the pancit canton noodles and add the chopped parsley. Cover the pot. Adjust the heat setting of your stove between low and medium. Cook the noodles cook for 2 to 3 minutes or until well done, but not soggy (Note: add more water if needed).",
      "Toss the blanched vegetables in the pot. Season with salt and ground black pepper.",
      "Transfer to a serving plate. Serve with lemon wedges or calamansi. Share and enjoy!"
    ],
    "cooking_time": "N/A",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/all-out-pancit-canton/",
    "image_url": "",
    "image_path": "",
    "category": "Noodles"
  },
  {
    "title": "Crispy Lechon Belly with Bacon",
    "ingredients": [
      "▢ 4 lbs. pork belly",
      "▢ 2 ½ tablespoons Knorr Liquid Seasoning",
      "▢ 8 strips bacon",
      "▢ 1 bunch spring onions",
      "▢ 3 tablespoons white vinegar",
      "▢ 2 teaspoons salt",
      "▢ 2 teaspoons garlic powder",
      "▢ ½ teaspoon ground black pepper",
      "▢ 1 teaspoon onion powder"
    ],
    "instructions": [
      "Poke the skin of the pork. I use a meat tenderizing tool for this.",
      "Combine all the seasoning ingredients. Mix well. Set aside.",
      "Season the inside part of the pork belly with Knorr Liquid Seasoning. Spread the seasoning mixture by sprinkling over the meat part of the pork. Rub to make sure that it gets distributed evenly.",
      "Arrange the bacon strips over the seasoned side of the belly and top with lemongrass and spring onions. Roll the belly and secure using a kitchen twine.",
      "Brush vinegar all over the skin part of the belly and sprinkle salt.",
      "Arrange in an air fryer or turbo broiler. Cook at 325F for 90 minutes.",
      "Dab the oil from the skin and adjust the temperature of the broiler to 400F. Continue broiling until the skin becomes crispy.",
      "Serve with lechon sauce or spiced vinegar"
    ],
    "cooking_time": "N/A",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/crispy-lechon-belly-with-bacon/",
    "image_url": "",
    "image_path": "",
    "category": "Pork Dishes"
  },
  {
    "title": "Sisig Paella",
    "ingredients": [
      "▢ 1 lb. pork belly grilled and diced",
      "▢ 1 Knorr Pork Cube",
      "▢ 1 chorizo de Bilbao diced",
      "▢ 5 quail eggs",
      "▢ 2 cups paella rice",
      "▢ 3 teaspoons Knorr Liquid Seasoning",
      "▢ 3 ½ cups water",
      "▢ ¼ cups green onions chopped",
      "▢ 2 teaspoons smoked paprika",
      "▢ 2 long green pepper sliced",
      "▢ ¼ cup red bell pepper chopped",
      "▢ 1 onion minced",
      "▢ 4 cloves garlic minced",
      "▢ 3 tablespoons cooking oil",
      "▢ 1 lemon wedged",
      "▢ ¾ cup Lady’s Choice Mayonnaise",
      "▢ 2 ½ teaspoons Knorr Liquid Seasoning"
    ],
    "instructions": [
      "Heat oil. Sauté onion and garlic until the onion softens.",
      "Add chorizo, pork belly, and Knorr Pork Cube. Sauté for 1 minute.",
      "Add the paella rice. Cook for 1 minute while stirring.",
      "Pour the water into the pan and add Knorr Liquid Seasoning and bell pepper. Stir. Cover the pot. Continue cooking until the rice is done.",
      "Sprinkle green onions on top. Crack the eggs and top over the rice. Add long green pepper. Cover and cook for 2 minutes.",
      "Combine the dressing ingredients and drizzle over the sisig paella. Serve with lemon wedges.",
      "Share and enjoy!"
    ],
    "cooking_time": "N/A",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/sisig-paella/",
    "image_url": "",
    "image_path": "",
    "category": "Pork Dishes"
  },
  {
    "title": "Festive Tuna Carbonara",
    "ingredients": [
      "▢ 8 ounces  tuna canned",
      "▢ 4 strips bacon chopped",
      "▢ 62 grams Knorr cream of mushroom mix",
      "▢ 3 tablespoons butter",
      "▢ 1 red bell pepper sliced into strips",
      "▢ 1 yellow onion minced",
      "▢ 2 cloves garlic minced",
      "▢ 3 tablespoons parsley minced",
      "▢ ¾ cup Parmesan cheese",
      "▢ 2 cups water",
      "▢ 12 ounces fettuccine"
    ],
    "instructions": [
      "Boil water and add some salt. Cook the pasta based on package instructions. Separate the pasta from the pasta water. Set aside.",
      "Heat a pan. Add bacon and cook until crispy. Remove the bacon and set aside. Also remove half of the bacon fat and keep it for later use while leaving the other half on the pan.",
      "Combine butter and bacon fat on the pan. Heat the pan and let the butter melt.",
      "Once the butter and bacon fat mixture get hot enough, sauté onion and garlic until the onion softens.",
      "Add the tuna. Cook for 1 minute.",
      "Combine Knorr cream of mushroom with 1 ½ cup water. Mix well. Pour the mixture into the pot and let it boil.",
      "Add bell pepper, half of the parsley, and half of the Parmesan cheese. Stir.",
      "Add the fettuccine. Arrange until well blended. Note: add pasta water to make the sauce thinner, if needed.",
      "Arrange the tuna carbonara on a pasta bowl and top with crispy bacon, parsley, and Parmesan.",
      "Serve. Share and enjoy!"
    ],
    "cooking_time": "N/A",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/festive-tuna-carbonara/",
    "image_url": "",
    "image_path": "",
    "category": "Other Filipino Dishes"
  },
  {
    "title": "Garlic Pepper Beef",
    "ingredients": [
      "▢ 1 lb. beef sirloin",
      "▢ 5 cloves garlic minced",
      "▢ 1/2 Knorr beef cube",
      "▢ 1 tablespoon butter",
      "▢ 1 cup water",
      "▢ 4 tablespoons canola oil",
      "▢ 2 tablespoons soy sauce",
      "▢ 1 tablespoon oyster sauce",
      "▢ 1/2 teaspoon ground black pepper",
      "▢ 1 teaspoon garlic powder",
      "▢ 1 tablespoon cornstarch"
    ],
    "instructions": [
      "Combine beef sirloin and all the marinade ingredients. Mix well. Let it stay for at least 10 minutes.",
      "Meanwhile, make the toasted garlic by heating oil in a pan. Add the garlic. Cook in a low heat setting until golden brown. Filter the garlic using a kitchen strainer. Set the toasted garlic and garlic oil aside.",
      "Heat the garlic oil on the same pan.",
      "Fry both sides of the marinated beef until it browns. Remove the fried beef from the pan. Set aside.",
      "Combine butter with the remaining oil. Let it melt. Add half of the knorr beef cube.",
      "Add the fried beef back into the pan. Stir fry for 30 seconds.",
      "Pour water. Let boil. Stir and continue cooking until the sauce thickens to your desired consistency.",
      "Sprinkle toasted garlic on top.",
      "Transfer to a serving bowl. Serve with rice. Share and enjoy!"
    ],
    "cooking_time": "N/A",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/garlic-pepper-beef/",
    "image_url": "",
    "image_path": "",
    "category": "Other Filipino Dishes"
  },
  {
    "title": "Quick and Easy Pan Fried Pork Chops",
    "ingredients": [
      "▢ 3 pieces pork chops",
      "▢ 3 tablespoons Knorr SavorRich Pork Liquid Seasoning",
      "▢ 1 piece egg",
      "▢ 3/4 cup all-purpose flour",
      "▢ 10 tablespoons Panko bread crumbs",
      "▢ 2 cups cooking oil"
    ],
    "instructions": [
      "Lay the pork chops flat on a large plate. Brush Knorr SavorRich Pork Liquid Seasoning on both sides of each pork chop. Let it stay for at least 15 minutes.",
      "Prepare the basic fried pork chop by heating 4 tablespoons of oil in pan. Once the oil gets hot, pan-fry one piece of marinated pork chop in medium heat for 30 seconds. Adjust the heat to low and continue to fry for 7 to 8 minutes. Turn the pork chop over and so the same step on the opposite side. Remove from the pan. Set aside.",
      "Start to prepare the flour coated fried pork chop by heating the remaining oil in a pan. Beat a piece of egg in a bowl. Dredge one piece of marinated pork chop in all-purpose flour and then dip in beaten egg. Dredge the pork chop back in flour and then fry one side in medium heat for 6 minutes. Flip and continue to fry the other side for the same amount of time. Remove from the pan and place on a plate lined with paper towel. Set aside.",
      "Prepare the breaded pork chop by dredging the remaining pork in flour. Dip in beaten egg and then dredge in Panko bread crumbs. Fry in medium heat for 6 minutes per side. Remove from the pan and place on a plate lined with paper towel.",
      "Arrange all pan-fried pork chops in a large serving plate. Serve! Share and enjoy!"
    ],
    "cooking_time": "27 minutes",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/quick-and-easy-pan-fried-pork-chops/",
    "image_url": "",
    "image_path": "",
    "category": "Pork Dishes"
  },
  {
    "title": "Seafood Boil Recipe",
    "ingredients": [
      "▢ 1 lb. mussels cleaned",
      "▢ 2 lbs. crab legs",
      "▢ 4 pieces sweet corn on the cob cut in half",
      "▢ 1 lb. medium shrimp with shell",
      "▢ 7 qt. water",
      "▢ 1 teaspoon ground cloves",
      "▢ 2 tablespoons salt",
      "▢ 2 thumbs  ginger crushed",
      "▢ 1 tablespoon  garlic minced",
      "▢ 3 oz. crab boil"
    ],
    "instructions": [
      "Pour water on a large stockpot. Bring to a boil.",
      "Add the cloves, salt, pepper, ginger, garlic, and crab boil. Continue to boil for 5 minutes.",
      "Slowly add the potato and corn. Cook for 4 to 5 minutes.",
      "Add the crab and mussels. Boil for 3 minutes.",
      "Put-in the shrimps and cook for 3 to 5 minutes more.",
      "Remove the seafood along with the potatoes and corn from the pot. Let the water drip.",
      "Transfer to a serving tray. Serve with lemon butter sauce.",
      "Share and enjoy!"
    ],
    "cooking_time": "30 minutes",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/seafood-boil-recipe/",
    "image_url": "",
    "image_path": "",
    "category": "Other Filipino Dishes"
  },
  {
    "title": "Easy Seafood Paella",
    "ingredients": [
      "▢ 1 lb. shrimp cleaned",
      "▢ 3 ounces squid rings",
      "▢ 1 lb. mussels",
      "▢ 1 Knorr Shrimp cube",
      "▢ 2 cups paella rice",
      "▢ 1 cup green peas",
      "▢ 1 ½ teaspoons saffron",
      "▢ 2 ½ teaspoons smoked paprika",
      "▢ 1 red bell pepper sliced",
      "▢ 1 tomato diced",
      "▢ 1 onion minced",
      "▢ 4 cloves garlic minced",
      "▢ 3 tablespoons olive oil",
      "▢ 3 tablespoons parsley minced",
      "▢ 3 ½ cups water",
      "▢ Salt and ground black pepper to taste"
    ],
    "instructions": [
      "Heat oil. Pan-fry shrimp until both sides turn orange. Also, fry the squid rings separately for around 30 seconds. Separately pan-fry the mussels for 1 minute. Set aside.",
      "Sauté garlic and onion.",
      "Add Knorr Shrimp cube, paprika, and paella rice. Continue sautéing for 1 minute.",
      "Pour-in the water and let it boil. Add tomato, green peas, parsley, and saffron. Season with salt and ground black pepper. Stir. Cover and cook until the rice is done.",
      "Top with red bell pepper and seafood. Cover and continue cooking for 2 minutes.",
      "Serve with lemon wedges. Share and enjoy!"
    ],
    "cooking_time": "N/A",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/easy-seafood-paella/",
    "image_url": "",
    "image_path": "",
    "category": "Rice Dishes"
  },
  {
    "title": "Pinoy Chicken Sopas",
    "ingredients": [
      "▢ 1 lb. rotisserie chicken shredded",
      "▢ 2 Knorr Chicken Cubes",
      "▢ ¾ cup hotdog cubed",
      "▢ 1 cup cabbage sliced",
      "▢ 3 stalks celery diced",
      "▢ 1 carrot minced",
      "▢ 1 cup evaporated milk",
      "▢ 8 ounces elbow macaroni",
      "▢ 1 onion minced",
      "▢ 3 cloves garlic minced",
      "▢ 8 cups water",
      "▢ 3 tablespoons cooking oil",
      "▢ Fish sauce and ground black pepper to taste"
    ],
    "instructions": [
      "Heat cooking oil in a cooking pot. Sauté onion, garlic, and celery for 1 minute.",
      "Add the shredded chicken, hot dogs, and 1 tablespoon of fish sauce. Cook for 1 minute.",
      "Pour the water and let it boil.",
      "Add Knorr chicken cube. Cover the cooking pot. Adjust the heat of your stove to the lowest setting. Cook for 10 minutes.",
      "Add elbow macaroni. Continue cooking for 18 minutes.",
      "Add cabbage and evaporated milk.",
      "Season with ground black pepper and fish sauce if needed.",
      "Serve hot. Share and enjoy!"
    ],
    "cooking_time": "N/A",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/pinoy-chicken-sopas/",
    "image_url": "",
    "image_path": "",
    "category": "Soups And Stews"
  },
  {
    "title": "KFC Style Popcorn Chicken with Gravy",
    "ingredients": [
      "▢ 1 lb. boneless chicken breast cubed",
      "▢ 1 cup cooking oil",
      "▢ 1 cup buttermilk",
      "▢ 1 tablespoon Knorr Liquid Seasoning",
      "▢ 1 cup all-purpose flour",
      "▢ 1/4 teaspoon salt",
      "▢ 1/4 teaspoon thyme",
      "▢ 1/4 teaspoon basil",
      "▢ 1/4 teaspoon oregano",
      "▢ 1/2 teaspoon celery salt",
      "▢ 1/2 teaspoon ground black pepper",
      "▢ 1/2 teaspoon dried mustard",
      "▢ 2 teaspoons paprika",
      "▢ 1 teaspoon garlic salt",
      "▢ 1/2 teaspoon ground ginger",
      "▢ 1 1/2 teaspoons white pepper",
      "▢ 1 Knorr Chicken Cube",
      "▢ 1/4 cup all-purpose flour",
      "▢ 1/4 cup butter",
      "▢ 2 cups water",
      "▢ 1/4 teaspoon onion powder",
      "▢ 1/4 teaspoon garlic powder",
      "▢ Salt and ground black pepper to taste"
    ],
    "instructions": [
      "Start making the popcorn chicken by combining buttermilk and Knorr Liquid seasoning in a mixing bowl. Stir until blended. Add the cubed chicken breast. Marinate for at least 1 hour.",
      "Meanwhile, make the gravy by melting the butter in a saucepan. Wait for it to bubble and then gradually add the flour while stirring once the bubbles subside. Continue cooking and stirring until the mixture turns medium brown in color. Gradually add water. Stir until the mixture becomes smooth. Add Knorr Chicken Cube, garlic powder, onion powder, salt, and ground black pepper. Stir and set aside. Cover the pot to keep the gravy warm.",
      "Continue working on the popcorn chicken by combining all the breading ingredients in a bowl. Mix well.",
      "Heat the oil in a small cooking pot.",
      "Dredge the marinated chicken in the breading mixture making sure that it is completely coated. Shake off excess breading.",
      "Deep fry the breaded chicken for 3 to 4 minutes or until it turns golden brown.",
      "Serve with your favorite side dish and gravy. Share and enjoy!"
    ],
    "cooking_time": "N/A",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/kfc-style-popcorn-chicken-with-gravy/",
    "image_url": "",
    "image_path": "",
    "category": "Chicken Dishes"
  },
  {
    "title": "Idol Cheesedog Bites and Bread Roll",
    "ingredients": [
      "▢ 12 CDO Idol Cheesedog",
      "▢ 2 cups all-purpose flour",
      "▢ 1 ¼ cup evaporated milk",
      "▢ 1 egg",
      "▢ 2 teaspoons canola oil",
      "▢ 2 teaspoons baking powder",
      "▢ 2 teaspoon salt",
      "▢ 1 egg",
      "▢ 1 tablespoon evaporated milk",
      "▢ 12 CDO Idol Cheesedog",
      "▢ 12 sliced tasty bread",
      "▢ ¼ cup mayonnaise",
      "▢ 1 cup Panko breadcrumbs",
      "▢ 2 eggs beaten",
      "▢ 1 ½ cups cooking oil"
    ],
    "instructions": [
      "Start making the idol bites by preparing the dough. Combine flour, evaporated milk, and salt in a bowl. Mix well and set aside. On another bowl, combine milk, canola oil, and egg. Mix well until all the ingredients are well blended. Combine the dry and wet ingredients. Knead the dough until it is smooth and elastic. Mold into a ball figure. Cover and let it rest for 15 minutes.",
      "Divide the dough into 2 parts to make it easier to flatten. Use a rolling pin to flatten the dough and then slice it into small triangles.",
      "Wrap 2 triangular dough near the two sides of each piece of CDO Idol Cheese Dog. Do this step until all cheese dogs are done.",
      "Make an egg wash by mixing the egg wash ingredients. Brush it over the wrapped dough.",
      "Bake for 12 to 15 minutes at 190C or air fry at 180C for 8 minutes. Slice in half and arrange on a serving plate. Serve.",
      "Prepare the Idol Cheese Dog Bread Roll. Flatten each slice of bread using a rolling pin. Spread mayonnaise on one side. Wrap the bread around each CDO Idol Cheese Dog. Secure with a toothpick.",
      "Heat the oil in a small cooking pot.",
      "While the oil is heating up. Dip the wrapped cheese dog in beaten egg and then roll it over the Panko breadcrumbs until it gets completely coated. Deep fry until the breading turns golden brown. Slice into half and arrange on a serving plate. Share and enjoy!"
    ],
    "cooking_time": "N/A",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/idol-cheesedog-bites-and-bread-roll/",
    "image_url": "",
    "image_path": "",
    "category": "Other Filipino Dishes"
  },
  {
    "title": "Perfect Chicken Adobo on a Budget",
    "ingredients": [
      "▢ 2 lbs. chicken cut into serving pieces",
      "▢ 1 Knorr Chicken Cube",
      "▢ 5 eggs medium size",
      "▢ ¼ cup soy sauce",
      "▢ ¼ cup vinegar",
      "▢ 1 cup water",
      "▢ 3 bay leaves",
      "▢ 2 teaspoons whole peppercorn",
      "▢ 8 cloves garlic crushed",
      "▢ 1 teaspoon sugar",
      "▢ 3 tablespoons cooking oil"
    ],
    "instructions": [
      "Combine chicken, soy sauce, vinegar, and 5 cloves garlic. Mix well until all ingredients are well incorporated. Marinate for 30 minutes.",
      "Meanwhile, boil the eggs for 10 minutes. Let the eggs cool down afterwards and peel off the shell.",
      "Heat oil in a pan. sauté the remaining garlic until it starts to turn brown.",
      "Add the marinated chicken (do not include the marinade yet). Cook for 3 minutes.",
      "Pour the remaining marinade into the pan and add water. Let boil.",
      "Add bay leaves, whole peppercorn, and Knorr Chicken Cube. Stir. Cover the pan and continue cooking using low to medium heat for 15 to 20 minutes.",
      "Add the sugar and put the eggs into the pan. Gently stir. Cook for 2 minutes.",
      "Transfer to a serving plate and serve along with a huge bowl of newly cooked rice.",
      "Share and enjoy!"
    ],
    "cooking_time": "N/A",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/perfect-chicken-adobo-on-a-budget/",
    "image_url": "",
    "image_path": "",
    "category": "Chicken Dishes"
  }
]