[
  {
    "title": "How to Make Meatloaf",
    "ingredients": [
      "▢ 1 lb. ground beef",
      "▢ 1/2 lb. ground pork",
      "▢ ½ cup yellow or white onion minced",
      "▢ 4 teaspoons brown sugar",
      "▢ 1 whole egg beaten",
      "▢ 1 can or 8 ounces of tomatoes diced",
      "▢ ¼ cup breadcrumbs or oats",
      "▢ 1 1/2 teaspoons salt",
      "▢ 1/4 teaspoon ground black pepper"
    ],
    "instructions": [
      "Heat the oven to 375F while you prepare the meatloaf mixture.",
      "Combine ground beef, ground pork, onions, egg, tomatoes and breadcrumbs or oats, sugar, salt, and pepper in a large bowl. Mix all the ingredients until well blended. If necessary, use hands to make sure all ingredients are mixed well.",
      "Transfer your meatloaf mixture into a bread pan or baking dish to shape like a loaf. Rub a little cool water on the top of the loaf and bake for 50 min. to 1 hour. Meatloaf is ready when it reaches an internal temperature of 170 F. Pork meatloaf is ready at 185F.",
      "Cool and serve.",
      "Share and enjoy!"
    ],
    "cooking_time": "1 hour",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/how-to-make-meatloaf/",
    "image_url": "",
    "image_path": "",
    "category": "Pork Dishes"
  },
  {
    "title": "Steamed Lobster with Lemon Butter Sauce",
    "ingredients": [
      "▢ 3 fresh lobsters",
      "▢ 6 cups water",
      "▢ 1/4 cup butter",
      "▢ juice from 1 lemon",
      "▢ a pinch of salt"
    ],
    "instructions": [
      "Pour water in a large steamer. Let boil.",
      "Once the water starts to boil, arrange the lobsters in the steamer. Steam for 12 to 14 minutes. Make sure to shake the steamer every 4 minutes.",
      "Meanwhile, prepare the lemon butter sauce by transferring the butter in a bowl. Melt by microwaving for 20 to 30 seconds or until the butter melts completely. Squeeze the lemon juice on the melted butter and add a pinch of salt. Stir until all the ingredients are well blended.",
      "Remove the lobsters from the steamer and transfer to a serving plate. Serve with lemon butter sauce. Share and enjoy!"
    ],
    "cooking_time": "19 minutes",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/steamed-lobster-with-lemon-butter-sauce/",
    "image_url": "",
    "image_path": "",
    "category": "Other Filipino Dishes"
  },
  {
    "title": "Paksiw na Pata with Pineapple",
    "ingredients": [
      "▢ 3 lbs. pork or ham hock pata, sliced crosswise",
      "▢ 1 8 oz. can pineapple chunks",
      "▢ 2 teaspoons minced garlic",
      "▢ 8 cups water",
      "▢ 3 tablespoons white vinegar",
      "▢ 4 tablespoon brown sugar or panutsa",
      "▢ 1 pack 1 oz. dried banana blossoms, washed and soaked in water",
      "▢ 4 to 6 pieces bay leaves",
      "▢ 1 tablespoon whole peppercorn",
      "▢ 1 piece beef cube optional",
      "▢ 1/4 cup soy sauce",
      "▢ 2 tablespoons cooking oil",
      "▢ salt to taste"
    ],
    "instructions": [
      "Pour 6 cups water in a cooking pot. Let boil.",
      "Add the pork hocks. Continue to boil for 30 minutes. Discard the water used for boiling and then place the boiled pork hock in a plate. Set aside.",
      "Heat the oil in a clean cooking pot. Once the oil gets hot, sauté the garlic until it turns light brown.",
      "Put the boiled pork hock in the cooking pot. Stir and then add soy sauce, pineapple chunks including the juice, and remaining 2 cups water. Let boil.",
      "Add bay leaves, peppercorn, and vinegar. Let boil. Continue to cook for 15 minutes.",
      "Add the beef cube and brown sugar (or panutsa). Stir.",
      "Add the banana blossom. Let the liquid reboil and then stir. Continue to cook until the pork becomes tender. Note that you may add more water if you need extra time to tenderize the pork.",
      "Add salt to taste.",
      "Transfer to a serving plate.",
      "Serve. Share and enjoy!"
    ],
    "cooking_time": "1 hour",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/paksiw-na-pata-with-pineapple/",
    "image_url": "",
    "image_path": "",
    "category": "Pork Dishes"
  },
  {
    "title": "Seafood Paella Recipe",
    "ingredients": [
      "▢ 2 cups paella rice",
      "▢ 13 pieces cooked little-neck clams",
      "▢ 13 pieces large tiger shrimp",
      "▢ 13 pieces cooked mussels",
      "▢ 1 large squid sliced into rings",
      "▢ 16 ounces clam juice",
      "▢ 1 cup water",
      "▢ 1/4 cup chopped parsley",
      "▢ 1 medium tomato diced",
      "▢ 1 cup green peas",
      "▢ 1 1/2 teaspoons saffron",
      "▢ 1 medium onion chopped",
      "▢ 1 small red bell pepper roasted and sliced into strips",
      "▢ 1 tablespoon paprika",
      "▢ 1 1/2 tablespoons garlic paste",
      "▢ 6 tablespoons olive oil",
      "▢ 2 teaspoons salt",
      "▢ 2 pieces lemon sliced into wedges"
    ],
    "instructions": [
      "Gently pound the garlic using a mortar and pestle tool. Grind until the texture becomes smooth similar to a paste.",
      "Combine the parsley, salt, garlic paste, paprika, and 2 tablespoons olive oil in the same mortar and pestle tool (mortar and pestle is also known as almires or dikdikan) and then continue to grind using the pestle until the entire mixture turns into a paste. Set aside.",
      "Heat the pan. Pour the remaining olive oil on the paellera or pan.",
      "Fry the tiger shrimp and shrimp for 1 minute per side. Remove the shrimp and squid and put in a plate.",
      "On the same pan with the remaining oil, saute onion and tomato.",
      "Add the green peas and paste mixture (this is the mixture from step 2). Stir.",
      "Pour-in water and clam juice. Let boil.",
      "Add the saffron and paella rice. Cover and adjust the heat to low. Cook for 20 minutes.",
      "Arrange clams, mussels, shrimp, squid, and roasted bell pepper.Cover and continue to cook for 8 minutes or until the rice is done. You can add more water if needed.",
      "Arrange the lemon wedges on the side.",
      "Serve. Share and enjoy!"
    ],
    "cooking_time": "50 minutes",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/seafood-paella/",
    "image_url": "",
    "image_path": "",
    "category": "Rice Dishes"
  },
  {
    "title": "Roasted Pork Belly (Lechon Liempo)",
    "ingredients": [
      "▢ 1 slab 5 lbs. pork belly bones removed",
      "▢ 3 stalks lemongrass leaves",
      "▢ 3 pieces scallions",
      "▢ 1 small red onion sliced",
      "▢ 1 tablespoon salt",
      "▢ 2 tablespoons fresh milk",
      "▢ 1/4 teaspoon ground black pepper",
      "▢ 1 tablespoon canola oil"
    ],
    "instructions": [
      "Lay the pork belly on a flat surface in a way that the side with the skin is facing down. Rub the salt and pepper all over the top of the pork belly (meat part). Let it stand for 15 minutes.",
      "Arrange the lemongrass, scallions, and onion slices on one one of the belly. Roll the side where you had the lemongrass all the way to the opposite side until a spiral shape is formed. Secure the rolled pork belly by tying it with a kitchen twine. Rub the oil all over the skin.",
      "Preheat oven to 350F. Arrange the pork belly in a roasting pan and roast for 2 hours.",
      "Remove the belly from the oven and brush with fresh milk. Put it back into the oven and continue to roast for 30 minutes or until the skin is brown and crispy.",
      "Remove from the oven. Let it cool down for 15 minutes. Slice the Roasted Pork Belly and serve with homemade lechon sauce.",
      "Share and enjoy!"
    ],
    "cooking_time": "3 hours",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/roasted-pork-belly-lechon/",
    "image_url": "",
    "image_path": "",
    "category": "Pork Dishes"
  },
  {
    "title": "Crown Roast of Lamb",
    "ingredients": [
      "▢ 2 racks lamb",
      "▢ 2 teaspoons minced garlic",
      "▢ 2 tablespoons minced fresh thyme",
      "▢ 1 tablespoon minced fresh rosemary",
      "▢ 1 1/2 teaspoons coarse sea salt",
      "▢ 1/2 teaspoons ground black pepper",
      "▢ 2 tablespoons olive oil"
    ],
    "instructions": [
      "Make a crown out of the racks of lamb by combining both racks sideways using a kitchen twine. Pinch a hole on one end of of both racks before the last rib.",
      "Bring both racks together side by side. The part with the hole should be right by each other. Insert a kitchen twine on one hole (first rack) then secure by tieing around the last rib near it. Insert the other end of the twine in the hole of the other rack (second rack) and then pull until the two racks are connected to each other. Secure the twine. Repeat these steps on the other sides of the racks to create a crown.",
      "Rub salt and pepper all over the meat. Let is stay for 30 minutes.",
      "Meanwhile, combine rosemary, thyme, and olive oil in a bowl. Stir and rub all over the crown of lamb. Let is stand for at least 15 minutes.",
      "Preheat the oven to 370F. While the oven is warming-up, wrap the exposed ribs with aluminum foil.",
      "Arrange the crown of lamb in a baking tray or circular cake pan. Roast for 35 to 40 minutes.",
      "Remove from the oven and let it cool down for 15 minutes. Slice into individual servings and serve. Share and enjoy!"
    ],
    "cooking_time": "1 hour",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/crown-roast-of-lamb/",
    "image_url": "",
    "image_path": "",
    "category": "Other Filipino Dishes"
  },
  {
    "title": "Kielbasa Fried Rice",
    "ingredients": [
      "▢ 4 cups cooked white rice preferably leftovers",
      "▢ 3 tablespoons butter",
      "▢ 1 teaspoon garlic powder",
      "▢ 2 eggs",
      "▢ 1 cup sliced Kielbasa sausage",
      "▢ 1/2 cup green peas",
      "▢ 1/4 cup chopped green onions",
      "▢ 3 tablespoons soy sauce"
    ],
    "instructions": [
      "Melt butter in a pan.",
      "Add the Kielbasa sausage. Cook in low to medium heat for 1 minute per side.",
      "Push the Kielbasa on the side. Crack the eggs and stir. Continue to cook until the eggs are formed.",
      "Put the rice in the pan. Gently fold until all the ingredients are well blended.",
      "Add the green peas, garlic powder and soy sauce. Stir fry until blended.",
      "Put the chopped green onions on top. Stir fry for 2 to 3 minutes.",
      "Serve. Share and enjoy!"
    ],
    "cooking_time": "22 minutes",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/kielbasa-fried-rice/",
    "image_url": "",
    "image_path": "",
    "category": "Other Filipino Dishes"
  },
  {
    "title": "Beef Sinigang sa Kamias (Sinigang na Baka)",
    "ingredients": [
      "▢ 2 lbs. beef chuck sliced into cibes",
      "▢ 2 medium tomato wedged",
      "▢ 1 medium yellow onion wedged",
      "▢ 10 to 12 pieces fresh or dried bilimbi kamias",
      "▢ 7 to 10 pieces okra",
      "▢ 4 pieces Indian eggplant sliced in half",
      "▢ 12 pieces string beans cut into 2 inch. length",
      "▢ 2 to 3 cups spinach or kangkong",
      "▢ 2 to 3 tablespoons fish sauce",
      "▢ 4 to 5 pieces taro root (gabi), peeled and cleaned",
      "▢ 9 cups water",
      "▢ 2 cups beef broth"
    ],
    "instructions": [
      "Pour the 5 cups water and beef broth in a cooking pot. Let boil.",
      "Add the tomato, onion, and kamias.Cook for 5 to 8 minutes.",
      "Add the beef continue to boil in low to medium heat for 45 minutes.",
      "Put the taro roots in the boiling mixture. Cook for another 45 minutes or until the beef gets tender.",
      "Meanwhile, boil the remaining 4 cups of water in a second cooking pot.",
      "Once the water starts to boil, blanch the vegetables for 3 minutes (45 seconds for the spinach). (Blanching means cooking the vegetables in boiling water and then removing these quickly and place in a bowl with cold water.) Drain water and arrange the vegetables in a plate.",
      "Once the beef gets tender, add the fish sauce and stir. Note: you can add more water if needed.",
      "Transfer the beef, taro, and soup to individual bowls and arrange blanched vegetables on top.",
      "Serve warm. Share and enjoy!"
    ],
    "cooking_time": "1 hour",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/beef-sinigang-sa-kamias-with-gabi-beef-in-sour-broth-with-taro/",
    "image_url": "",
    "image_path": "",
    "category": "Seafood"
  },
  {
    "title": "Lumpiang Gulay (Vegetable Egg Roll Recipe)",
    "ingredients": [
      "▢ 1 lb. mung bean sprouts cleaned",
      "▢ 6 ounces fried extra firm tofu cut into cubes",
      "▢ 2 cups shredded cabbage",
      "▢ 1 medium yellow onion sliced",
      "▢ 1 small tomato cubed (optional)",
      "▢ 1 teaspoon minced garlic",
      "▢ 2 teaspoons coarse sea salt",
      "▢ 1/4 teaspoon ground black pepper",
      "▢ Egg roll or sprig roll wrapper",
      "▢ 1 1/2 cups cooking oil"
    ],
    "instructions": [
      "Heat 3 tablespoons of cooking oil. Once the oil gets hot, saute garlic and onion.",
      "When the onion gets soft, add tomato and tofu. Stir fry for 2 minutes.",
      "Put some salt and ground black pepper. Stir.",
      "Add the cabbage and then cook for 3 minutes.",
      "Stir-in the bean sprouts and cook for 5 minutes.",
      "Transfer the cooked vegetable in a plate. Drain the excess liquid.",
      "Once the vegetable cools-off, start to wrap it using the egg roll wrappers. Lay the wrapper flat on a big plate. Place around 2 to 2 1/2 tablespoon of vegetable on one end of the wrapper. Fold the opposite edges of the wrapper and then roll until the vegetables are secured. Seal the end of the wrapper by dipping your finger in water and run it over the end of the wrapper; gently press the wet loose end towards the egg roll.",
      "Heat the remaining cooking oil in a cooking pot. Once the oil gets hot, fry one side of the egg rolls in medium heat until the color of the wrapper turns golden brown. Flip the egg roll to cook the opposite side.",
      "Remove the egg rolls from the cooking pot and arrange in a plate lined with paper towel.",
      "Serve warm with spiced vinegar.",
      "Share and enjoy!"
    ],
    "cooking_time": "20 minutes",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/lumpiang-gulay-vegetable-egg-roll-recipe/",
    "image_url": "",
    "image_path": "",
    "category": "Vegetable Dishes"
  },
  {
    "title": "Inabraw Recipe (Boiled Vegetables with Fried Fish in Anchovy Sauce)",
    "ingredients": [
      "▢ 1 whole tilapia fried (get the recipe here)",
      "▢ 2 large plum tomato wedged",
      "▢ 1 large yellow onion wedged",
      "▢ 2 thumbs ginger sliced",
      "▢ 12 pieces string beans cut into 2 inch. length",
      "▢ 3 to 4 pieces Indian eggplant halved",
      "▢ 6 to 8 pieces okra",
      "▢ 1 cup jute leaves",
      "▢ 1 medium bitter melon cored and sliced",
      "▢ 2 cups water",
      "▢ 1/4 cup bagoong balayan or bagoong monamon anchovy sauce"
    ],
    "instructions": [
      "Pour water in a pan or cooking pot. Let boil.",
      "Add the ginger, onion, and tomato. Cover and boil in medium heat for 10 to 12 minutes.",
      "Pour-in the anchovy sauce. Stir. Add the bitter melon, string beans, okra, and eggplant. Cover and cook for 8 to 12 minutes.",
      "Add the jute leaves. Stir and then add the fried fish on top. Cook for 3 minutes.",
      "Transfer to a serving plate. Serve with warm white rice and calamansi or lime.",
      "Share and enjoy!"
    ],
    "cooking_time": "35 minutes",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/inabraw-recipe-boiled-vegetables-with-fried-fish/",
    "image_url": "",
    "image_path": "",
    "category": "Seafood"
  },
  {
    "title": "Teriyaki Chicken Thighs",
    "ingredients": [
      "▢ 1 lb. chicken thighs cut into serving pieces",
      "▢ 1 serving Teriyaki Sauce get the recipe here",
      "▢ 1/8 teaspoon ground black pepper",
      "▢ 1/2 teaspoon Garlic powder",
      "▢ A pinch of salt",
      "▢ 1 tablespoon roasted sesame seeds"
    ],
    "instructions": [
      "Arrange the chicken in a mixing bowl. Pour the teriyaki sauce in the bowl and add garlic powder, salt, and ground black pepper. Mix well. Cover the mixing bowl. Marinate the chicken overnight. Make sure to place the chicken inside the refrigerator.",
      "Grill the chicken. You can use any type of grill. I am using a grill plate (on a stovetop). Grill one side of the chicken for 5 minutes and then flip it over and grill the other side for 5 minutes.",
      "Remove the skin from the chicken. Continue to grill both sides for 7 to 10 minutes per side or until the chicken is fully cooked. Make sure to baste the chicken with the leftover marinade every 3 minutes to keep it moist.",
      "Transfer to a serving plate. Sprinkle sesame seeds on top. Share and enjoy!"
    ],
    "cooking_time": "3 hours",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/teriyaki-chicken-thighs/",
    "image_url": "",
    "image_path": "",
    "category": "Chicken Dishes"
  },
  {
    "title": "Turkey and Ham Sopas",
    "ingredients": [
      "▢ 1 lb. chopped leftover turkey",
      "▢ 3 ounces chopped ham",
      "▢ 2 small carrots sliced",
      "▢ 3 celery stems chopped",
      "▢ 1 medium yellow onion chopped",
      "▢ 4 cups chicken broth",
      "▢ 2 cups fresh milk",
      "▢ 3 tablespoons butter",
      "▢ 1 1/2 cups Farfalle bow tie pasta or macaroni",
      "▢ 1/4 cup French fried onion optional",
      "▢ 3 tablespoons roasted garlic optional",
      "▢ Salt and pepper to taste"
    ],
    "instructions": [
      "Melt butter in a cooking pot. Continue to heat the butter until it gets hot enough to cook the veggies.",
      "Saute the onion, carrots, and celery for 3 minutes.",
      "Add the turkey and ham. Saute for 3 to 5 minutes.",
      "Pour-in the chicken broth. Let boil. Add the pasta. Cover and cook in low to medium heat for 20 minutes.",
      "Pour-in milk. Stir and let the liquid re-boil.",
      "Add salt and pepper to taste.",
      "Transfer to individual bowls. You can top it with French fried onions or roasted garlic.",
      "Serve hot. Share and enjoy!"
    ],
    "cooking_time": "40 minutes",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/turkey-and-ham-sopas/",
    "image_url": "",
    "image_path": "",
    "category": "Soups And Stews"
  }
]