[
  {
    "title": "Ham Katsu",
    "ingredients": [
      "▢ 500 grams CDO Holiday Ham sliced (1-inch thick)",
      "▢ 1 cup Panko breadcrumbs",
      "▢ ½ cup all-purpose flour",
      "▢ 1 egg beaten",
      "▢ 1 ½ cups cooking oil",
      "▢ 1 teaspoon granulated white sugar",
      "▢ 2 tablespoons banana ketchup",
      "▢ 1 teaspoon oyster sauce",
      "▢ 2 tablespoons Worcestershire sauce"
    ],
    "instructions": [
      "Heat cooking oil in a pan.",
      "Dredge a slice of CDO Holiday Ham in flour, then dip it in beaten egg. Make sure that all the sides are completely coated before dredging the ham into the breadcrumbs. Note: you should press the breadcrumbs gently so that it holds better.",
      "Deep-fry your ham katsu until the bottom side turns golden brown. Flip it over and do the same step. Remove from the pan and let it cool down.",
      "Meanwhile, make the sauce by combining all the tonkatsu sauce ingredients. Mix well.",
      "Arrange the ham katsu with garnish on a serving plate. Serve with homemade tonkatsu sauce. Share and enjoy!"
    ],
    "cooking_time": "N/A",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/ham-katsu/",
    "image_url": "",
    "image_path": "",
    "category": "Other Filipino Dishes"
  },
  {
    "title": "Cheesy Ham Steak With Bacon and Mushrooms",
    "ingredients": [
      "▢ 500 grams CDO Holiday Ham sliced (1-inch thick)",
      "▢ 300 grams button mushroom sliced",
      "▢ 6 strips CDO Young Pork Bacon cooked until crispy and crumbled",
      "▢ 50 grams cheddar cheese sliced",
      "▢ 1 onion minced",
      "▢ 3 cloves garlic minced",
      "▢ 2 tablespoons unsalted butter",
      "▢ 1 tablespoon cooking oil",
      "▢ Salt and ground black pepper to taste"
    ],
    "instructions": [
      "Melt butter in a pan. Sauté onion and garlic. Add mushrooms once the onion softens. Continue sautéing for 2 minutes. Season with salt and ground black pepper. Set aside.",
      "Heat cooking oil in a clean pan. Fry the ham steak for 3 minutes.",
      "Flip the ham over and top with 2 to 3 slices of cheddar cheese. Cover the pan. Continue cooking for 2 ½ minutes.",
      "Arrange the ham steak on a serving plate. Top it with crumbled bacon and serve with sauteed mushrooms.",
      "Share and enjoy!"
    ],
    "cooking_time": "N/A",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/cheesy-ham-steak-with-bacon-and-mushrooms/",
    "image_url": "",
    "image_path": "",
    "category": "Pork Dishes"
  },
  {
    "title": "Hawaiian Pizza (No Bake)",
    "ingredients": [
      "▢ 75 grams CDO Sweet Ham sliced",
      "▢ ½ cup pineapple tidbits",
      "▢ ½ cup Pizza Sauce",
      "▢ ¾ cup mozzarella cheese",
      "▢ 1 cup all-purpose flour",
      "▢ 1/2 teaspoon baking powder",
      "▢ 1/2 teaspoon sugar",
      "▢ 1/2 teaspoon salt",
      "▢ 1/3 cup beer",
      "▢ 1 tablespoon cooking oil"
    ],
    "instructions": [
      "Make the pizza dough by combining flour, baking powder, sugar, and salt. Mix well",
      "Add oil and beer. Continue mixing until all the ingredients are fully incorporated.",
      "Knead the dough until smooth. Form it into a ball. Wrap the dough loosely with plastic wrap. Let it rest for 10 minutes.",
      "Roll dough out into a 10-inch circle.",
      "Place the pan over medium-high heat for 30 seconds.",
      "Transfer the pizza dough in the pan and cover with a lid. Set the stove to medium low heat Cook it until you see large bubbles forming on top, for about 3 minutes. Poke the pizza crust with a fork to deflate the bubbles.",
      "Flip the pizza crust. Continue cooking for 2 minutes.",
      "Spread the pizza sauce over the dough. Top with cheese, CDO Sweet Ham sliced, and pineapple tidbits.",
      "Cover and cook the pizza for another 4 to 5 minutes or until the cheese has melted.",
      "Remove the pizza from the pan and lay on a wide chopping board. Slice. Serve and enjoy."
    ],
    "cooking_time": "N/A",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/hawaiian-pizza-no-bake/",
    "image_url": "",
    "image_path": "",
    "category": "Other Filipino Dishes"
  },
  {
    "title": "Crispy Katsu Sando",
    "ingredients": [
      "▢ 6 CDO Crispy burger patties",
      "▢ 3 slices tasty bread cut in half",
      "▢ 1 cup cabbage shredded",
      "▢ 1/4 cup katsu sauce",
      "▢ 3 tablespoons butter",
      "▢ 2 tablespoons cooking oil",
      "▢ 3 tablespoons mayonnaise"
    ],
    "instructions": [
      "Heat the cooking oil in a pan. Fry both sides of the CDO Crispy burger patties using medium heat until crispy. Set aside",
      "Grab 2 slices of bread. Spread butter on one side of the first slice of bread and mayonnaise on one side of the second bread slice.",
      "Lay down the bread slice with butter on a flat surface (butter side up). Top with shredded cabbage and tonkatsu sauce.",
      "Arrange 2 CDO Crispy Burgers over it and then top with more shredded cabbage and tonkatsu sauce. Finish by topping with the other bread slice (mayo side facing down).",
      "Arrange Crispy Burger Sando on a serving plate. Serve. Share and enjoy!"
    ],
    "cooking_time": "N/A",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/crispy-katsu-sando/",
    "image_url": "",
    "image_path": "",
    "category": "Other Filipino Dishes"
  },
  {
    "title": "Orange Crispy Burger",
    "ingredients": [
      "▢ 3 CDO Crispy burger patties",
      "▢ 2 tablespoons green onions chopped",
      "▢ 1/4 Cup orange juice",
      "▢ 1 tablespoon soy sauce",
      "▢ 3 tablespoons white vinegar",
      "▢ 1/2 teaspoon sesame oil",
      "▢ 1/4 teaspoon red pepper flakes",
      "▢ 3 tablespoons sugar",
      "▢ 3 cloves garlic minced",
      "▢ 1/2 teaspoon ginger minced",
      "▢ 2 tablespoons cornstarch",
      "▢ 3 tablespoons water",
      "▢ 2 tablespoons cooking oil"
    ],
    "instructions": [
      "Heat the cooking oil in a pan. Fry both sides of the CDO Crispy burger patties using medium heat until crispy. Set aside.",
      "Make the orange glaze by heating oil in a pan. Saute garlic and ginger",
      "Add sugar and let it melt.",
      "Pour sesame oil, orange juice, soy sauce, and vinegar. Let boil.",
      "Add red pepper flakes. Cook for 1 minute.",
      "Combine water and cornstarch in a bowl. Stir until blended. Pour mixture into the pan. Continuously stir until the sauce thickens.",
      "Arrange CDO Crispy Burger on a plate with a cup of rice on the side. Drizzle the orange over the patties. Garnish with chopped green onions.",
      "Serve. Share and enjoy!"
    ],
    "cooking_time": "N/A",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/orange-crispy-burger/",
    "image_url": "",
    "image_path": "",
    "category": "Other Filipino Dishes"
  },
  {
    "title": "Corned Beef Saute",
    "ingredients": [
      "▢ 300 grams CDO Home Style Corned Beef",
      "▢ 1 carrot cubed",
      "▢ 1/4 cup whole kernel corn",
      "▢ 1/4 cup green peas",
      "▢ 3 cloves garlic chopped",
      "▢ 1 onion chopped",
      "▢ 2 tablespoons butter",
      "▢ Salt and ground black pepper to taste"
    ],
    "instructions": [
      "Melt butter in a pan. Saute garlic and onion until the onion softens.",
      "Add CDO Home Style Corned Beef. Saute for 1 minute.",
      "Add carrot, corn, and green peas. Continue cooking for 3 to 5 minutes.",
      "Season with salt and ground black pepper. Serve with rice. Share and enjoy!"
    ],
    "cooking_time": "N/A",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/corned-beef-saute/",
    "image_url": "",
    "image_path": "",
    "category": "Other Filipino Dishes"
  },
  {
    "title": "Breakfast Burrito",
    "ingredients": [
      "▢ 225 g CDO Funtastyk Young Pork Tocino",
      "▢ 2 ½ cups cooked rice",
      "▢ 3 eggs",
      "▢ 1 cup cheddar cheese shredded",
      "▢ 4 flour tortillas",
      "▢ 1 ½ cups romaine lettuce shredded",
      "▢ 3 tomatoes diced",
      "▢ 2 tablespoons fresh milk",
      "▢ 2 tablespoons butter",
      "▢ 1 teaspoon white vinegar"
    ],
    "instructions": [
      "Cook the tocino by heating 3 tablespoons of cooking oil in a pan. Adjust your stove between low to medium heat setting. Fry both sides of our CDO Funtastyk Young Pork Tocino until it browns (note: no need to boil). Remove the tocino from the pan. Slice it into serving pieces. Set aside",
      "Make the scrambled eggs by combining eggs and fresh milk. Beat until the mixture smoothens. Heat a pan and melt the butter. Once the butter gets hot enough, pour the egg mixture and stir constantly while cooking. Once the texture becomes less runny, add 2 tablespoons of shredded cheddar cheese, and then stir. Transfer to a clean plate. Set aside.",
      "Prepare the rice by pouring vinegar over it. Mix well and set aside.",
      "Assemble the burrito. Start by spreading the rice over the tortilla. Top with lettuce, tomato, cheese, egg, and CDO Funtastyk Young Pork Tocino. Secure the contents by wrapping the flour tortilla. Arrange on a serving platter. Serve for breakfast. Share and enjoy!"
    ],
    "cooking_time": "N/A",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/breakfast-burrito/",
    "image_url": "",
    "image_path": "",
    "category": "Pork Dishes"
  },
  {
    "title": "Cheesy Corned Beef Balls",
    "ingredients": [
      "▢ 450 grams CDO Home Style Corned Beef",
      "▢ 1 1/2 cups bread crumbs",
      "▢ 2 eggs beaten",
      "▢ 4 ounces mozzarella cheese",
      "▢ 10 tablespoons all-purpose flour",
      "▢ 1 1/2 cups cooking oil",
      "▢ Salt and ground black pepper to taste"
    ],
    "instructions": [
      "Combine CDO corned beef, 1 egg, flour, salt, and ground black pepper in a bowl. Mix well until the mixture becomes less sticky. You can add more flour as needed.",
      "Scoop around 3 tablespoons of the mixture. Stuff the center with mozzarella cheese and then roll the mixture to form a ball-shaped figure.",
      "Arrange 3 bowls on your working station. Fill the first with 5 tablespoons of flour, the next with 1 beaten egg, and the third bowl with breadcrumbs.",
      "Dredge the corned beef balls in flour and dip in beaten egg. Roll it in breadcrumbs ensuring that the balls get completely coated.",
      "Heat cooking oil in a cooking pot. Deep-fry the corned beef balls in a low heat setting until the exterior of the balls turn golden brown.",
      "Arrange it on a serving plate. Serve. Share and enjoy!"
    ],
    "cooking_time": "N/A",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/cheesy-corned-beef-balls/",
    "image_url": "",
    "image_path": "",
    "category": "Other Filipino Dishes"
  },
  {
    "title": "Tocino Fried Rice Recipe",
    "ingredients": [
      "▢ 225 g CDO Funtastyk Young Pork Tocino",
      "▢ 5 cups leftover rice",
      "▢ 2 teaspoons soy sauce",
      "▢ ¾ cup green peas",
      "▢ ¾ cup carrot diced",
      "▢ 3 eggs",
      "▢ 3 tablespoons butter",
      "▢ 5 tablespoons cooking oil",
      "▢ Salt and ground black pepper to taste"
    ],
    "instructions": [
      "Heat 3 tablespoons of cooking oil in a pan. Adjust your stove between low to medium heat setting. Fry both sides of our CDO Funtastyk Young Pork Tocino until it browns (note: no need to boil). Remove the tocino from the pan. Slice it into serving pieces. Set aside.",
      "Crack the eggs and beat. Heat the same pan and add the remaining 2 tablespoons of cooking oil. Fry the beaten egg until done. Put it on a clean plate and cut into small pieces. Set aside.",
      "Melt butter on the same pan. Add the tocino. Cook for 30 seconds.",
      "Add the leftover rice. Toss and continue cooking for 3 minutes.",
      "Season with soy sauce, salt, and ground black pepper. Toss until all ingredients are well blended.",
      "Add carrots and green peas. Continue cooking for 2 minutes.",
      "Put the eggs back into the pan. Toss and cook for 30 seconds.",
      "Transfer the tocino fried rice on a serving plate. Serve. Share and enjoy!"
    ],
    "cooking_time": "N/A",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/tocino-fried-rice-recipe/",
    "image_url": "",
    "image_path": "",
    "category": "Pork Dishes"
  },
  {
    "title": "Luncheon Meat Caldereta",
    "ingredients": [
      "▢ 350 grams CDO Luncheon Meat cut into cubes",
      "▢ 3/4 cup tomato sauce",
      "▢ 3 tablespoons liver spread",
      "▢ 1 potato cubed",
      "▢ 1 carrot cubed",
      "▢ 2 bell peppers sliced",
      "▢ 1 cup green peas",
      "▢ 1 onion",
      "▢ 4 cloves garlic chopped",
      "▢ 2 tablespoons cheddar cheese shredded",
      "▢ 3/4 cup water",
      "▢ 3 tablespoons cooking oil",
      "▢ Salt and ground black pepper to taste"
    ],
    "instructions": [
      "Heat cooking oil in a pan. Fry all sides of the cubed CDO Luncheon Meat until it browns. Set aside.",
      "Using the remaining oil (note: add more oil if needed), saute garlic and onion until the onion softens.",
      "Add the liver spread. Cook for 30 seconds.",
      "Pour tomato sauce and water. Let boil.",
      "Add potato and carrot. Cover the pan. Cook for 10 minutes.",
      "Add green peas, bell pepper, and fried luncheon meat. Stir. Cook for 2 minutes.",
      "Season with salt and ground black pepper."
    ],
    "cooking_time": "N/A",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/luncheon-meat-caldereta/",
    "image_url": "",
    "image_path": "",
    "category": "Other Filipino Dishes"
  },
  {
    "title": "One Pan Sandwich",
    "ingredients": [
      "▢ 5 strips CDO Young Pork Bacon",
      "▢ 2 eggs",
      "▢ 2 bread slices",
      "▢ 2 tablespoons mayonnaise",
      "▢ 2 tablespoons butter",
      "▢ 3 tablespoons cooking oil"
    ],
    "instructions": [
      "Heat around 1 tablespoon of cooking oil in a pan. Cook one side of the CDO young Pork Bacon until it becomes crispy (Note: use low to medium heat setting). Turn the bacon over and do the same to the opposite side. Remove the bacon and chop into smaller pieces. Set aside.",
      "Beat the eggs until smooth. Note: you may add salt if you want.",
      "Heat 2 tablespoons of cooking oil in a pan. Pour the beaten egg. Cook until firm. Turn it over and continue cooking the other side.",
      "Meanwhile, spread mayonnaise on one side of each bread slice. Put both bread slices side-by-side on top of the egg with the mayonnaise side facing down.",
      "Spread butter over each bread slice.",
      "Using a wide spatula, flip the egg and bread so that the side of the bread with butter touches the pan.",
      "Arrange CDO Young Pork Bacon on top of the egg (do this only on one side). Continue cooking until the side of the bread that touches the pan turns golden brown in color.",
      "Secure sandwich by folding the bread wherein one bread slice is on top and the other is on the bottom.",
      "Remove the sandwich from the pan. Serve for breakfast. Share and enjoy!"
    ],
    "cooking_time": "N/A",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/one-pan-sandwich/",
    "image_url": "",
    "image_path": "",
    "category": "Pork Dishes"
  },
  {
    "title": "Bacon Stuffed Pancake",
    "ingredients": [
      "▢ 5 strips CDO Young Pork Bacon",
      "▢ 1 cup pancake mix",
      "▢ 1 egg",
      "▢ 3/4 water",
      "▢ 1 tablespoon canola oil"
    ],
    "instructions": [
      "Heat around 1 tablespoon of cooking oil in a pan. Cook one side of the CDO young Pork Bacon until it becomes crispy (Note: use low to medium heat setting). Turn the bacon over and do the same to the opposite side. Remove the bacon and chop into smaller pieces. Set aside.",
      "Combine all the pancake batter ingredients in a mixing bowl. Mix well usinng a wire whisk.",
      "Heat a clean non-stick pan and spread around 1 tablespoon of canolaoil.",
      "Scoop around 6 tablespoons of pancake batter and pour it into the pan. Top with some bacon sliced.",
      "Flip the pancake once you see bubbling on top. Continue cooking for 30 seconds to 1 minute. You will know that you are done when the pancake slides freely when you shake the pan. Transfer to a serving plate. Do the same step until the entire pancake batter is consumed.",
      "Serve with extra CDO Young Pork Bacon on the side. Enjoy with your favorite drink for breakfast."
    ],
    "cooking_time": "N/A",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/bacon-stuffed-pancake/",
    "image_url": "",
    "image_path": "",
    "category": "Pork Dishes"
  }
]