[
  {
    "title": "Stir Fried Beef with Oyster Sauce and Snap Peas",
    "ingredients": [
      "▢ 1½ lbs. beef sirloin sliced into thin pices",
      "▢ ½ lb. snap peas",
      "▢ 2 tablespoons soy sauce",
      "▢ 4 tablespoons oyster sauce",
      "▢ 2 tablespoons sherry or rice wine",
      "▢ 1 teaspoon garlic powder",
      "▢ ¼ teaspoon ground black pepper",
      "▢ ½ teaspoon salt",
      "▢ 1 medium yellow or white onion sliced",
      "▢ 1 tablespoon cornstarch",
      "▢ 3 tablespoons water",
      "▢ 3 tablespoons cooking oil"
    ],
    "instructions": [
      "Combine 2 tablespoons oyster sauce, soy sauce, sherry, garlic powder, salt, and ground black pepper in a large mixing bowl. Stir.",
      "Add the beef slices. Continue to stir until the beef gets coated. Marinate the beef for 30 minutes.",
      "Heat the cooking oil in a wok or frying pan.",
      "Once the oil gets hot, put the onion and then cook for 30 seconds.",
      "Add the marinated beef including the marinade. Stir-fry for 4 to 5 minutes.",
      "Add the snap peas and remaining oyster sauce.",
      "Combine cornstarch and water. Mix well. Pour the mixture in and then continue to cook while stirring for 3 to 4 minutes.",
      "Transfer to a serving plate and serve with rice.",
      "Share and enjoy!"
    ],
    "cooking_time": "45 minutes",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/stir-fried-beef-with-oyster-sauce-and-snap-peas/",
    "image_url": "",
    "image_path": "",
    "category": "Other Filipino Dishes"
  },
  {
    "title": "Mini Banana Cake with Walnuts for Kids",
    "ingredients": [
      "▢ 1 cup all-purpose flour",
      "▢ 2 medium ripe bananas",
      "▢ ½ teaspoon baking soda",
      "▢ a pinch of salt",
      "▢ 6 tablespoons softened butter",
      "▢ ½ cup granulated white sugar",
      "▢ 1 teaspoon vanilla extract",
      "▢ ¼ cup sour cream",
      "▢ ¼ cup chopped walnuts"
    ],
    "instructions": [
      "Preheat oven to 350F.",
      "In a mixing bowl, combine flour, baking soda, and salt. Stir using a wire whisk until well blended. Set aside.",
      "Combine softened butter, vanilla extract, and sour cream in another bowl. Start to cream the mixture; use a blended, if possible for better results. The beater blade of your stand mixer needs to be used in this process.",
      "Add the mashed bananas and walnuts while beating and then gradually add the flour mixture. Continue to beat until the texture becomes smooth.",
      "Scoop the mixture and arrange in small rectangular cups or cupcake cups. Put the rectangular cups over a baking tray. If using cupcake cups, use a muffin pan.",
      "Bake in the oven for 20 to 30 minutes or until it turns golden brown",
      "Remove from oven. Serve. You can also top with whip cream so that kids will like it more."
    ],
    "cooking_time": "42 minutes",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/mini-banana-cake-with-walnuts-for-kids/",
    "image_url": "",
    "image_path": "",
    "category": "Other Filipino Dishes"
  },
  {
    "title": "Chewy Coconut Macaroons Recipe",
    "ingredients": [
      "▢ 7 ounces shredded sweetened desiccated coconut",
      "▢ 1 egg",
      "▢ 7 ounces condensed milk",
      "▢ ½ teaspoon vanilla extract",
      "▢ 1 tablespoon butter melted",
      "▢ a pinch of salt"
    ],
    "instructions": [
      "Preheat oven to 350F.",
      "Beat the egg in a mixing bowl. Add butter, vanilla extract, and condensed milk. Whisk until well blended.",
      "Add the desiccated coconut and salt. Fold until the mixture is distributed.",
      "Arrange mini baking cups on a mini muffin pan. Scoop around 1 tablespoon of mixture and place it into each baking cup.",
      "Put the muffin pan in the oven. Bake for 10 to 13 minutes.",
      "Remove from the oven. Let it cool down.",
      "Transfer to a plate. Serve for dessert.",
      "Share and enjoy"
    ],
    "cooking_time": "23 minutes",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/chewy-coconut-macaroons-recipe/",
    "image_url": "",
    "image_path": "",
    "category": "Other Filipino Dishes"
  },
  {
    "title": "How to Make Latik from a Can of Coconut Cream",
    "ingredients": [
      "▢ 1 14 oz. can coconut cream"
    ],
    "instructions": [
      "Pour coconut cream in a pot.",
      "Start to heat the pot until the coconut cream starts to boil.",
      "Adjust the heat to medium. Continue to cook until the liquid evaporates and residue starts to form",
      "Gently scrape the coconut residue using a wooden or silicon spatula. Adjust the heat between low and medium. Continue to cook until the liquid completely evaporates. Note: at this point, only coconut oil and the residue is left.",
      "Once the residue starts to get light brown, start to stir so that it gets cooked evenly. continue to cook until the color turns golden brown.",
      "Separate the residue from the coconut oil using a kitchen sieve. The residue and \"latik\" is one and the same thing."
    ],
    "cooking_time": "50 minutes",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/how-to-make-latik-from-a-can-of-coconut-cream/",
    "image_url": "",
    "image_path": "",
    "category": "Other Filipino Dishes"
  },
  {
    "title": "Steamed Eggplant and Okra with Bagoong",
    "ingredients": [
      "▢ 6 pieces okra",
      "▢ 2 medium Chinese eggplants",
      "▢ 1/3 cup bagoong shrimp paste",
      "▢ 2 cups water"
    ],
    "instructions": [
      "Boil water in a pot or steamer.",
      "Wash the okra and eggplants in running water. Pat it dry and then slice the eggplant in half lengthwise. Divide the halved eggplant into 3 pieces (a piece of eggplant will total to 6 slices). You can also slice the okra crosswise if desired.",
      "Arrange the eggplant and okra in a steamer. Steam for 15 minutes to 18 minutes",
      "Remove from the steamer and arrange in a plate.",
      "Serve with bagoong.",
      "Share and enjoy!"
    ],
    "cooking_time": "20 minutes",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/steamed-eggplant-and-okra-with-bagoong/",
    "image_url": "",
    "image_path": "",
    "category": "Other Filipino Dishes"
  },
  {
    "title": "Mung Bean Sprouts with Shrimp",
    "ingredients": [
      "▢ ½ lb. fresh mung bean sprouts cleaned",
      "▢ ½ lb. medium shrimp shell removed",
      "▢ 1 small carrot julienne",
      "▢ 1 cup shredded cabbage",
      "▢ ½ cup chopped scallions",
      "▢ Salt and ground black pepper to taste",
      "▢ 4 cloves garlic crushed",
      "▢ 1 medium onion sliced",
      "▢ 5 tablespoons cooking oil"
    ],
    "instructions": [
      "Heat the oil in a pan.",
      "Add the shrimp. Saute for 1 minute. Sprinkle salt and ground black pepper. Continue to cook for 1 to 2 minutes. Remove from the pan and put in a clean plate. Set aside.",
      "Using the same pan, add the remaining oil.",
      "Saute garlic and onion until soft.",
      "Add the mung bean sprouts, carrot, and cabbage. Stir-fry for 3 to 5 minutes.",
      "Put the cooked shrimp back in the pan. Stir.",
      "Add the scallions. Continue to cook for 2 to 3 minutes.",
      "Transfer to a serving plate. Serve.",
      "Share and enjoy!"
    ],
    "cooking_time": "20 minutes",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/mung-bean-sprouts-with-shrimp/",
    "image_url": "",
    "image_path": "",
    "category": "Other Filipino Dishes"
  },
  {
    "title": "Lengua in White Mushroom Sauce",
    "ingredients": [
      "▢ 2 lbs. lengua ox tongue",
      "▢ 3 cups beef broth or sock",
      "▢ ¾ cups whipping cream",
      "▢ 1 10.5 oz. can condensed cream of mushroom",
      "▢ 1 cup sliced button mushrooms",
      "▢ 1 large yellow onion chopped",
      "▢ 5 cloves garlic crushed",
      "▢ 6 cups water for boiling the ox tongue",
      "▢ Salt and ground black pepper to taste",
      "▢ 3 tablespoons cooking oil"
    ],
    "instructions": [
      "Boil 6 cups of water in a pressure cooker. Add the ox tongue. Cover the cooker and pressure cook for 35 to 40 minutes or until tender.",
      "Remove from the pressure cooker. Let it cool down. Peel the outer layer off the tongue. Slice the ox tongue into thin pieces.",
      "Heat oil in a cooking pot.",
      "Saute onion and garlic.",
      "Add the sliced ox tongue. Cook for 2 minutes.",
      "Pour the condensed cream of mushroom and beef broth in the pot. Stir. Let boil. Cover and simmer for 35 minutes.",
      "Add the sliced mushrooms and whipping cream. Continue to cook for 40 minutes in low heat or until the liquid reduces to half and the sauce starts to thicken.",
      "Add salt and ground black pepper to taste.",
      "Transfer to a serving plate. Serve.",
      "Share and enjoy!"
    ],
    "cooking_time": "2 hours",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/lengua-in-white-mushroom-sauce/",
    "image_url": "",
    "image_path": "",
    "category": "Other Filipino Dishes"
  },
  {
    "title": "Seared Scallops in Herbed Butter Sauce Recipe",
    "ingredients": [
      "▢ 1 lb. jumbo scallops",
      "▢ 4 tablespoons butter",
      "▢ 3 tablespoons olive oil",
      "▢ ½ cup white wine",
      "▢ 2 teaspoons chopped flat leaf parsley",
      "▢ 1 small yellow onion minced",
      "▢ 2 teaspoons lemon juice",
      "▢ ¼ cup clam juice",
      "▢ Salt and ground black pepper to taste"
    ],
    "instructions": [
      "Melt 1-tablespoon butter in a pan. Add 2 tablespoons olive oil.",
      "Once the butter and oil gets hot, sear both sides of the scallops until it turns light brown in color. Remove the seared scallops from the pan. Set aside.",
      "Prepare the herbed sauce by melting the remaining butter in the same pan and add the remaining olive oil.",
      "Saute the onion until soft.",
      "Pour the white wine and clam juice. Let boil.",
      "Add the parsley and lemon juice. Continue to cook in medium heat until the liquid reduces to half.",
      "Add the seared scallops back into the pan. Sprinkle salt and ground black pepper. Stir. Cook for 1 minute.",
      "Transfer to a serving plate.",
      "Serve. Share and enjoy!"
    ],
    "cooking_time": "25 minutes",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/seared-scallops-in-herbed-butter-sauce-recipe/",
    "image_url": "",
    "image_path": "",
    "category": "Other Filipino Dishes"
  },
  {
    "title": "Leche Puto Recipe",
    "ingredients": [
      "▢ 6 cups water for steamining",
      "▢ ¾ cup all-purpose flour",
      "▢ 2 ½ teaspoons baking powder",
      "▢ 6 tablespoons granulated white sugar",
      "▢ ¾ cup fresh milk or evaporated milk",
      "▢ 7 egg yolks",
      "▢ 1 14 oz. can condensed milk",
      "▢ ½ teaspoon vanilla extract"
    ],
    "instructions": [
      "Pour water in a steamer of pot. Bring to a boil.",
      "Make the leche flan by beating the egg yolks. Gradually add the condensed milk while whisking and then continue to whisk until the texture becomes smooth. Add the vanilla extract. Whisk until all the ingredients are well blended.",
      "Fill half of each puto mold with the leche flan mixture. Arrange in a steamer. Steam for 25 minutes.",
      "Remove from the steamer and let cool.",
      "Meanwhile, make the puto mixture by combining all-purpose flour, sugar, and baking powder in a clean bowl. Mix well using a wire whisk. Gradually pour the milk while whisking and continue until the texture becomes smooth.",
      "Pour the puto mixture over the steamed leche flan.",
      "Arrange in a steamer and then steam for 30 to 35 minutes.",
      "Take the leche puto out of the steamer. Let cool.",
      "Remove from the mold and arrange in a plate.",
      "Serve for dessert. Share and Enjoy!"
    ],
    "cooking_time": "1 hour",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/leche-puto-recipe/",
    "image_url": "",
    "image_path": "",
    "category": "Desserts"
  },
  {
    "title": "Special Chicken Embutido Recipe (Filipino Chicken Meatloaf)",
    "ingredients": [
      "▢ 2 lbs. ground chicken",
      "▢ 1 medium red bell pepper minced",
      "▢ 1 Knorr Chicken Cube",
      "▢ 2 raw eggs",
      "▢ 1 medium green bell pepper minced",
      "▢ 1 medium white or yellow onion minced",
      "▢ 1 ¾ to 2 cups bread crumbs",
      "▢ 4 tablespoons vegetable oil",
      "▢ ½ cup raisins",
      "▢ 4 hard boiled eggs quartered",
      "▢ 5 tablespoons sweet relish",
      "▢ 5 tablespoons shredded cheddar cheese",
      "▢ ¼ teaspoon ground black pepper",
      "▢ ½ teaspoon salt",
      "▢ 6 cups water for steaming"
    ],
    "instructions": [
      "In a mixing bowl, crush the chicken using a fork.",
      "Crack the eggs. Beat until the chicken cube dilutes in the beaten egg.",
      "Add the bell peppers, onion, raisins, sweet relish, and cheese. Fold to mix the ingredients.",
      "Add the ground chicken, salt, ground black pepper, and vegetable oil. Continue to fold until all the ingredients are well blended.",
      "Wrap the mixture in aluminum foil. Scoop a cup of mixture and arrange it in a sheet of aluminum foil. Place some wedged hard-boiled eggs in the middles and then roll the foil to shape like a cylinder. Secure both sides by twirling the ends of the foil until the mixture inside is compact.",
      "Boil water in a steamer or pot.",
      "Arrange the wrapped chicken embutido in a steamer.",
      "Cover and steam for 1 hour.",
      "Let the chicken embutido cool down.",
      "Place in the refrigerator for 3 hours.",
      "Slice and arrange in a serving plate. Serve cold.",
      "Share and enjoy!"
    ],
    "cooking_time": "1 hour",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/special-chicken-embutido-recipe-filipino-chicken-meatloaf/",
    "image_url": "",
    "image_path": "",
    "category": "Chicken Dishes"
  },
  {
    "title": "Cathedral Window Gelatin Recipe",
    "ingredients": [
      "▢ 1 1/2 cup gelatin red, yellow, and green jelly cooked according to package instructions and cubed",
      "▢ 1 1/4 cups whipping cream",
      "▢ 1 1/2 cups pineapple juice",
      "▢ 1 can condensed milk 14 oz.",
      "▢ 4 packets unflavored gelatin colorless"
    ],
    "instructions": [
      "Het the pineapple juice in the microwave oven for 35 seconds.",
      "Pour in a mixing bowl. Add the colorless unflavored gelatin. Stir until the gelatin completely dilutes in the juice.",
      "Pour the whipping cream in the bowl and then add the condensed milk. Stir until well blended.",
      "Add the colored jelly cubes. Stir.",
      "Pour the mixture in a Jelly mold large enough to hold everything.",
      "Refrigerate for 4 hours.",
      "Transfer to a plate. Slice and serve.",
      "Share and enjoy!"
    ],
    "cooking_time": "4 hours",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/cathedral-window-jelly-recipe/",
    "image_url": "",
    "image_path": "",
    "category": "Other Filipino Dishes"
  },
  {
    "title": "Cheese Puto Recipe",
    "ingredients": [
      "▢ 1 cup all-purpose flour",
      "▢ 1/2 cup granulated white sugar",
      "▢ 3 teaspoons baking powder",
      "▢ 1 cup fresh milk",
      "▢ 1/4 teaspoon vanilla extract",
      "▢ 3/4 cup shredded sharp cheddar cheese",
      "▢ 5 cups water for steaming"
    ],
    "instructions": [
      "Pour the water into a steamer or cooking pot. Let boil.",
      "Sift flour, sugar, and baking powder. Combine in a bowl. Mix well.",
      "Gradually add the milk while stirring. Continue to stir until the texture of the mixture becomes smooth.",
      "Stir-in the vanilla extract and half of the cheese.",
      "Pour the mixture into small to medium sized molds. Arrange in a steamer. Cover and steam for 25 minutes. Top each puto with the remaining cheese. Steam for 5 minutes more.",
      "Take the steamed cheese puto out of the steamer. Let it cool down.",
      "Gently remove the puto from the mold with the help of a spatula.",
      "Arrange in serving plate. Serve.",
      "Share and enjoy!"
    ],
    "cooking_time": "35 minutes",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/cheese-puto-recipe/",
    "image_url": "",
    "image_path": "",
    "category": "Desserts"
  }
]