[
  {
    "title": "Ginataang Tilapia Recipe",
    "ingredients": [
      "▢ 2 pieces tilapia cleaned",
      "▢ 2 cups coconut milk",
      "▢ 4 cloves garlic crushed",
      "▢ 1 piece onion chopped",
      "▢ 1 thumb ginger  cut into strips",
      "▢ 2 pieces long green pepper",
      "▢ 2 tablespoons fish sauce",
      "▢ 2 pieces Thai chili pepper",
      "▢ 1/4 teaspoon ground black pepper",
      "▢ 2 cups fresh spinach",
      "▢ 3 tablespoons cooking oil"
    ],
    "instructions": [
      "Heat the cooking oil in a cooking pot.",
      "Sauté the onion, garlic, and ginger in the hot oil",
      "Once the onion become soft, pour the coconut milk into the pot. Let boil and cover. Cook for 5 minutes between low to medium heat.",
      "Add the chili peppers and tilapia. Cover and simmer for 12 minutes.",
      "Add long green chili peppers and season with fish sauce and ground black pepper. Stir. Cook for 3 minutes.",
      "Add the spinach. Cover and cook for 1 minute.",
      "Transfer to a serving plate. Serve hot. Share and Enjoy!"
    ],
    "cooking_time": "35 minutes",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/ginataang-tilapia/",
    "image_url": "",
    "image_path": "",
    "category": "Seafood"
  },
  {
    "title": "Sinigang na Baboy with Gabi",
    "ingredients": [
      "▢ 2 lbs. pork belly sliced into cubes",
      "▢ 2 to 3 cups kangkong leaves",
      "▢ 3 pieces long green chili pepper siling pansigang",
      "▢ 2 pieces tomato quartered",
      "▢ 1 cup sliced daikon radish labanos",
      "▢ 10 to 12 pieces snake beans cut in 2 inch length pieces",
      "▢ 1 piece onion quartered",
      "▢ 15 pieces okra",
      "▢ 2 pieces taro peeled and cut in half (gabi)",
      "▢ 8 cups water",
      "▢ 2 packs Knorr Sinigang sa Sampaloc Mix Original (20 gram pack)",
      "▢ 3 tablespoons fish sauce patis",
      "▢ ¼ teaspoon ground black pepper"
    ],
    "instructions": [
      "Pour water into a cooking pot. Let boil",
      "Add onion and tomato. Boil for 5 to 8 minutes.",
      "Put the pork in the cooking pot. Boil for 25 minutes.",
      "Add the taro. Cover and continue to boil for 30 minutes.",
      "Add Knorr Sinigang sa Sampaloc mix, fish sauce, and ground black pepper; stir.",
      "Put the daikon radish in. Cook for 3 to 5 minutes.",
      "Add the chili peppers, okra, and snake beans. Cook for 7 minutes.",
      "Add the kangkong. Cover the cooking pot and turn off the heat. Let it stay covered for 5 minutes.",
      "Transfer to as serving bowl. Serve with a small bowl with patis and spicy chili.",
      "Share and enjoy!"
    ],
    "cooking_time": "1 hour",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/sinigang-na-baboy-with-gabi/",
    "image_url": "",
    "image_path": "",
    "category": "Seafood"
  },
  {
    "title": "Crispy Pork Belly Chicharon",
    "ingredients": [
      "▢ 2 lbs. pork belly",
      "▢ 6 cups water",
      "▢ 2 cups cooking oil",
      "▢ 1 1/2 tablespoons whole peppercorn",
      "▢ 8 pieces dried bay leaves"
    ],
    "instructions": [
      "Boil water in a cooking pot. Add salt, bay leaves, whole peppercorn, and pork. Cover and continue to boil for 60 minutes.",
      "Remove from the pot and let pork cool down. Poke holes on the skin using a toothpick. Slice the pork in half for a thinner piece.",
      "Rub salt all over the pork belly. Air dry for 1 hour. Note: placing the pork in front of an electric fan is a good idea.",
      "Heat oil on a cooking pot. Deep fry pork belly until crispy and golden brown. Note: be extra careful when doing this step. Use of splatter screen is recommended.",
      "Remove crispy pork belly from the cooking pot and place over a wire rack. Let it cool down.",
      "Transfer to a serving plate. Serve with spicy vinegar.",
      "Serve! Share and enjoy!"
    ],
    "cooking_time": "2 hours",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/crispy-pork-belly-chicharon/",
    "image_url": "",
    "image_path": "",
    "category": "Pork Dishes"
  },
  {
    "title": "Pork Kaldereta sa Gata",
    "ingredients": [
      "▢ 2 lbs. Pork belly sliced into cubes",
      "▢ 4 tablespoons liver spread",
      "▢ 6 pieces tomato chopped",
      "▢ 1 piece onion chopped",
      "▢ 5 cloves garlic crushed",
      "▢ 2 cups pork broth",
      "▢ 2 cups coconut milk",
      "▢ 2 pieces potato cubed",
      "▢ 2 pieces carrot cubed",
      "▢ 1 piece green bell pepper chopped",
      "▢ 1 piece red bell pepper chopped",
      "▢ 3 pieces Thai chili pepper",
      "▢ 3 pieces dried bay leaves",
      "▢ 2 cups pork broth",
      "▢ 2 ½ tablespoons fish sauce",
      "▢ ¼ teaspoon crushed black pepper",
      "▢ 3 tablespoons cooking oil"
    ],
    "instructions": [
      "Heat oil in a pan.",
      "Sauté garlic until color turns light brown.",
      "Add chopped onion. Cook until soft.",
      "Add pork belly slices. Sauté until outer part turns light brown.",
      "Put the chopped ripe tomatoes into the pan. Cook until soft.",
      "Pour pork broth into the pan. Let boil.",
      "Add chopped Thai chili, liver spread, and dried bay leaves.",
      "Pour coconut milk. Stir and cover and cook between low to medium heat for 45 to 60 minutes or until tender. Note: add more broth or water if needed.",
      "Put-in carrots and potato and cook for 7 minutes.",
      "Add bell peppers. Cook for 7 to 8 minutes.",
      "Season with fish sauce and crushed whole peppercorn. Continue to cook until sauce thickens.",
      "Transfer to a serving plate. Share and enjoy!"
    ],
    "cooking_time": "1 hour",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/pork-kaldereta-sa-gata/",
    "image_url": "",
    "image_path": "",
    "category": "Main Dishes"
  },
  {
    "title": "Spaghetti and Meatballs",
    "ingredients": [
      "▢ 1/2 lb. Spaghetti",
      "▢ 6 cups water for boiling",
      "▢ 1/2 lb. ground pork",
      "▢ 1/2 lb. ground beef",
      "▢ 1/4 cup bread crumbs",
      "▢ 1  egg",
      "▢ 3 cloves garlic minced",
      "▢ 1/4 cup Parmesan cheese",
      "▢ 12 pieces Cheddar cheese cubed",
      "▢ 1/4 teaspoon ground black pepper",
      "▢ 1/2 teaspoon salt",
      "▢ 4 tablespoons extra virgin olive oil",
      "▢ 14 oz. Stewed tomato",
      "▢ 14 oz. tomato sauce",
      "▢ 1  Knorr Beef Cube",
      "▢ 1 piece onion chopped",
      "▢ 3 cloves garlic minced",
      "▢ 5 pieces basil leaves",
      "▢ Salt and ground black pepper to taste"
    ],
    "instructions": [
      "Prepare the meatballs by combining ground beef and pork in a mixing bowl. Add bread crumbs, half of the minced garlic, egg, Parmesan cheese, salt, and ground black pepper. Mix everything together until all ingredients are well distributed.",
      "Scoop around 3 tablespoons of meat mixture. Put a cube of cheese in the middle. Roll into a ball. Do the same procedure until all the mixture is completely consumed.",
      "Heat olive oil in a pan. Fry the meatballs until brown. Remove from the pan. Set aside.",
      "Prepare the meaty marinara sauce. Saute onion and garlic on the remaining olive oil used to fry the meatballs.",
      "Add stewed tomato and tomato sauce. Stir. Cover and cook between low to medium heat for 20 minutes.",
      "Add Knorr Pork Cube. Stir. Put the fresh basil into the pot. Cook for 5 minutes.",
      "Put the meatballs back into the cooking pot. Cover and cook for 10 minutes.",
      "Season with salt and pepper. Set aside.",
      "Cook the spaghetti according to package instructions.",
      "Arrange the cooked spaghetti on a pasta bowl or a plate. Top with sauce and meatballs. Add more Parmesan cheese on top. Serve. Share and enjoy!"
    ],
    "cooking_time": "50 minutes",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/pasta-noodles-spaghetti-and-meatballs-recipe/",
    "image_url": "",
    "image_path": "",
    "category": "Pork Dishes"
  },
  {
    "title": "Chicken Pochero",
    "ingredients": [
      "▢ 2 lbs. Chicken cut into serving pieces",
      "▢ 1 piece Knorr Chicken Cube",
      "▢ 2 pieces potato cubed",
      "▢ 2 bunches  baby bok choy",
      "▢ ½ head cabbage sliced",
      "▢ 8 ounces tomato sauce",
      "▢ 18 pieces long green beans",
      "▢ 2 pieces Chorizo de Bilbao sliced",
      "▢ 8 ounces chick pea",
      "▢ 3 pieces Saba banana sliced",
      "▢ 2 pieces tomato diced",
      "▢ 1 piece onion chopped",
      "▢ 4 cloves garlic crushed",
      "▢ 2 cups water",
      "▢ 3 tablespoons cooking oil",
      "▢ Fish sauce and crushed peppercorn to taste"
    ],
    "instructions": [
      "Heat oil in a cooking pot. Pan-fry the chicken for 2 minutes per side. Set aside.",
      "Using the remaining oil, saute onion and garlic.",
      "Add chorizo. Saute for 1 minute.",
      "Add tomato. Continue to saute until onion and tomato softens.",
      "Put the pan-fried chicken back into the pot. Stir.",
      "Pour tomato sauce and water.Let boil.",
      "Add Knorr Chicken Cube. Stir and cover the pot. Cook in medium heat for 15 minutes.",
      "Put potato, saba banana, and chick pea into the pot. Cover and cook for 12 minutes.",
      "Add long green beans and cabbage. Cover and cook for 3 minutes.",
      "Add bok choy. Cook for 2 minutes. Season with crushed peppercorn and fish sauce. Stir.",
      "Tranfer to a serving bowl. Share and enjoy!"
    ],
    "cooking_time": "50 minutes",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/chicken-pochero/",
    "image_url": "",
    "image_path": "",
    "category": "Chicken Dishes"
  },
  {
    "title": "Salisbury Steak with Mashed Potato",
    "ingredients": [
      "▢ 1 lb. ground beef",
      "▢ 1 piece Knorr Beef Cube",
      "▢ 6 tablespoons bread crumbs",
      "▢ 2 tablespoons mustard powder",
      "▢ 1 tablespoons tomato ketchup",
      "▢ 2 tablespoons Worcestershire Sauce",
      "▢ ¼ teaspoon ground black pepper",
      "▢ ½ teaspoon salt",
      "▢ 3 tablespoons butter",
      "▢ 3 tablespoons olive oil",
      "▢ 1 piece Knorr Beef Cube",
      "▢ 1 ½ tablespoons tomato ketchup",
      "▢ 1 piece onion sliced",
      "▢ 1 ½ tablespoons Worcestershire sauce",
      "▢ 2 cups water",
      "▢ 2 tablespoons cornstarch",
      "▢ Salt and ground black pepper to taste",
      "▢ 3 pieces baking potato",
      "▢ ¾ cups fresh milk",
      "▢ 2 tablespoons butter",
      "▢ 6 cups water for boiling",
      "▢ 1 ½ teaspoons salt",
      "▢ 1/8 teaspoon ground black pepper"
    ],
    "instructions": [
      "Prepare the mashed potato by boiling 6 cups of water in a cooking pot. Add 1 teaspoon salt.",
      "Put the tomatoes in boiling water and boil for 15 to 20 minutes or until very tender. Remove from the pot. Set aside.",
      "Melt butter in a sauce pan. Add milk. Stir. Cook until milk starts to boil.",
      "Mash the potato and then pour the milk and butter mixture. Add Salt and pepper. Mix well. Set aside.",
      "Make the Salisbury steak by combining the steak ingredient listed above in a bowl, except for oil and butter. Freeze the beef cube and grate using a cheese grater. Mix everything together. Scoop around 4 tablespoons of mixture and roll into a ball. Flatten and place in a clean plate.",
      "Melt butter in a pan. Add olive oil. Pan-fry each side for 4 minutes. Place in a clean plate. Set aside.",
      "Prepare the gravy by pouring the oil used to cook the burger patty into a sauce pan.",
      "Saute the onion until soft. Add ketchup, Worcestershire sauce, and water. Let boil. Add Knorr beef cube. Stir and continue to cook for 2 minutes.",
      "Combine cornstarch with 3 to 4 tablespoons water. Stir and pour into the pot. Stir until the gravy thickens.",
      "Arrange the mashed potato on a plate. Top with Salisbury Steak and Gravy. Serve!",
      "Share and enjoy!"
    ],
    "cooking_time": "50 minutes",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/salisbury-steak-with-mashed-potato-knr-bc/",
    "image_url": "",
    "image_path": "",
    "category": "Other Filipino Dishes"
  },
  {
    "title": "Homemade Pork Tocino Recipe",
    "ingredients": [
      "▢ 2 lbs. pork ham",
      "▢ 1 1/2 tablespoons sea salt",
      "▢ 1/2 teaspoon Prague powder #1",
      "▢ 3/4 cups granulated white sugar",
      "▢ 1 teaspoon sodium phosphate",
      "▢ 1/4 cup anisette liquor",
      "▢ 1/2 cup pineapple juice",
      "▢ 1/4 cup crushed garlic",
      "▢ 1 tablespoon garlic powder",
      "▢ 1/4 teaspoon Vitamin C powder",
      "▢ 1/4  teaspoon Red food coloring"
    ],
    "instructions": [
      "Slice the pork ham to about ¼ inch thickness",
      "Dissolve the sodium phosphate in 5 tablespoons of water.",
      "Except for the meat, combine all ingredients in a large bowl and mix well",
      "Apply the combined mixture to the meat by rubbing. Make sure that the mixture is evenly distributed across the meat",
      "Place the mixed ingredients in a covered container",
      "Store the covered container (with meat and mixture) in room temperature for 14 hours. It may also be refrigerated but would take at least 3.5 days to complete."
    ],
    "cooking_time": "12 hours",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/homemade-pork-tocino-recipe/",
    "image_url": "",
    "image_path": "",
    "category": "Pork Dishes"
  },
  {
    "title": "Pork Dumplings",
    "ingredients": [
      "▢ 1 lb. ground pork",
      "▢ 1 1/2 tablespoons Knorr Liquid Seasoning",
      "▢ 30 pieces Gyoza wrapper",
      "▢ 1 cup cabbage chopped",
      "▢ 1/2 cup shrimp chopped",
      "▢ 1/2 cup Chinese chives chopped",
      "▢ 2 tablespoons cooking wine",
      "▢ 1 tablespoon ginger grated",
      "▢ 1 teaspoon Sesame oil",
      "▢ 1/2 teaspoon salt",
      "▢ 1/4 teaspoon ground white pepper",
      "▢ 6 cups water for boiling"
    ],
    "instructions": [
      "Mash the cabbage. Add salt. Continue to mash until salt is well distributed. Let it stay for 10 minutes.",
      "Combine ground pork, shrimp, ginger, and chives in bowl. Mix well.",
      "Add cabbage, ground white pepper, cooking wine, Sesame oil, and Knorr liquid seasoning. Continue to mix until all ingredients are well blended.",
      "Scoop 1 ½ teaspoon of pork mixture and place it in the middle of the Gyoza wrapper. Secure the filling by symmetrically folding the wrapper and pressing the edges. You may also press using the tip of a fork.",
      "Arrange the pork dumplings on a steamer lined with cabbage leaves. Cover and steam for 10 minutes.",
      "Serve with dipping sauce. Share and enjoy!"
    ],
    "cooking_time": "20 minutes",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/pork-dumpling-knr-kls/",
    "image_url": "",
    "image_path": "",
    "category": "Pork Dishes"
  },
  {
    "title": "Longevity Noodles with Chicken and Mushroom",
    "ingredients": [
      "▢ 16 ounces fresh noodles",
      "▢ 1 piece Knorr Chicken Cube",
      "▢ 6 ounces boneless chicken breast",
      "▢ 12 pieces dried Shiitake mushroom sliced",
      "▢ ¾ cup Chinese chive chopped",
      "▢ 1 piece carrot julienne",
      "▢ ¼ cup scallions chopped",
      "▢ 5 tablespoons oyster sauce",
      "▢ 6 cups water",
      "▢ ¼ cup Shaoxing cooking wine",
      "▢ 3 tablespoons cooking oil",
      "▢ 1/8 teaspoon ground black pepper"
    ],
    "instructions": [
      "Boil water in a wok. Put the chicken. Boil for 8 minutes.",
      "Add Knorr Chicken Cube in boiling water. Stir. Continue to boil chicken for 7 to 10 minutes more. Remove the chicken and let it cool down. Slice into thin pieces. Set aside.",
      "Add fresh noodles in the boiling broth that was used to tenderize the chicken. Cook in medium heat for 8 minutes or until broth is consumed. Arrange noodle in a colander and quickly wash with cold water to prevent it from sticking with each other. Set aside.",
      "Heat oil in a wok. Stir-fry the boiled chicken breast for 1 minute once the oil gets hot.",
      "Add scallions and mushroom. Continue to stir-fry for 3 minutes.",
      "Pour cooking wine into the wok. Cook for 2 minutes while stirring.",
      "Add Chinese chives and carrots. Stir-fry for 2 minutes more.",
      "Add the oyster sauce and ½ cup water. Stir.",
      "Put the fresh noodles back into the wok. Toss.",
      "Season with ground black pepper. Toss until all ingredients are well distributed.",
      "Transfer to a serving plate. Serve."
    ],
    "cooking_time": "45 minutes",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/longevity-noodles-chicken-mushroom-knr-cc/",
    "image_url": "",
    "image_path": "",
    "category": "Chicken Dishes"
  },
  {
    "title": "Crab and Corn Pearl Soup and Chinese Spring Rolls",
    "ingredients": [
      "▢ 2 packs Knorr Real Chinese Soup Crab and Corn 40g",
      "▢ 8 pieces lobster balls",
      "▢ 8 pieces squid balls",
      "▢ 3 pieces imitation crab sticks sliced",
      "▢ 3 tablespoons scallions chopped",
      "▢ 5 cups water",
      "▢ 1/8 teaspoon ground white pepper",
      "▢ 1 lb. ground chicken",
      "▢ 1 ½ tablespoons Knorr Liquid Seasoning",
      "▢ 2 cups cabbage shredded",
      "▢ 1 piece carrot chopped",
      "▢ 3 pieces mushroom chopped",
      "▢ 3 tablespoons scallions chopped",
      "▢ 1 teaspoon Sesame oil",
      "▢ 30 pieces spring roll wrapper",
      "▢ ¼ teaspoon ground white pepper",
      "▢ 2 cups cooking oil"
    ],
    "instructions": [
      "Make the Crab and Corn Pearl Soup by boiling 5 cups water in a soup pot.",
      "Combine Knorr Crab and Corn Soup mix with 1 cup water. Stir until diluted. Set aside.",
      "Add lobster balls and squid balls into the boiling water. Cook for 3 minutes. Add crab stick. Cook for 2 minutes.",
      "Pour the crab and corn mixture. Quickly stir the soup until it thickens.",
      "Add scallions and season with ground white pepper. Transfer to a serving bowl.",
      "Prepare the Chinese Spring Rolls by first cooking the filling. Heat oil in a pan. Add the ground chicken. Cook until the chicken turns light brown.",
      "Add cabbage and carrots. Cook for 3 minutes.",
      "Add mushroom. Cook for 2 minutes.",
      "Pour Sesame oil and add the scallions. Season with Knorr Liquid seasoning and ground white pepper. Remove from heat and let it cool down.",
      "Place 1 ½ tablespoons of filling on a spring roll wrapper. Wrap by following the instructions on the video below. Perform this step until all filling are consumed.",
      "Heat cooking oil in a cooking pot. Deep fry the spring rolls until golden brown.",
      "Arrange on a serving plate. Serve with Crab and Corn Pearl Soup. Share and enjoy!"
    ],
    "cooking_time": "50 minutes",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/crab-and-corn-pearl-soup-and-chinese-spring-rolls/",
    "image_url": "",
    "image_path": "",
    "category": "Chicken Dishes"
  },
  {
    "title": "Filipino Omelet",
    "ingredients": [
      "▢ 3 pieces large eggs",
      "▢ 2 piece tomatoes diced",
      "▢ 1 piece red onion diced",
      "▢ 1/4 teaspoon ground black pepper",
      "▢ 1/4 teaspoon sea salt",
      "▢ 2 tablespoons cooking oil"
    ],
    "instructions": [
      "Crack the eggs and then place in a medium bowl. Add the salt and pepper and then beat using a wire whisk or fork. Set aside.",
      "Heat the cooking oil in a pan.",
      "Saute the onion and tomatoes for 2 minutes.",
      "Pour-in the beaten egg mixture. Spread the mixture by tilting the pan sideways. Continue to cook in medium heat for 3 to 4 minutes.",
      "Flip the omelet with the aid of a wide spatula and then cook the other side for 3 minutes. Note: If you are having a hard time flipping the omelet, try to first place the egg on a wide plate (the cooked side should be facing down). Quickly flip the plate on top of the pan so that the omelet will slide to the pan with the uncooked side facing down.",
      "Turn off the heat and then transfer the omelet to a serving plate. Enjoy with pandesal or garlic rice. Serve with banana ketchup.",
      "Share and enjoy!"
    ],
    "cooking_time": "13 minutes",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/filipino-omelet-recipe/",
    "image_url": "",
    "image_path": "",
    "category": "Other Filipino Dishes"
  }
]