[
  {
    "title": "Spicy Camaron Rebosado (Deep Fried Beer Battered Shrimp)",
    "ingredients": [
      "▢ 1 lb. medium or large shrimp deveined and shell removed",
      "▢ 1 cup all-purpose flour",
      "▢ 1 egg",
      "▢ 1 cup beer",
      "▢ ½ teaspoon baking powder",
      "▢ 1/8 teaspoon ground black pepper",
      "▢ ¼ teaspoon garlic powder",
      "▢ ¼ teaspoon cayenne pepper powder",
      "▢ ¼ teaspoon salt",
      "▢ 3 cups cooking oil"
    ],
    "instructions": [
      "Heat oil in a pot.",
      "Beat the egg in a bowl.",
      "Add ground black pepper, garlic powder, salt, and cayenne pepper.",
      "Pour the beer. Whisk until the ingredients are well blended.",
      "Add half of the flour. Continue to whisk until the texture becomes smooth. Add the remaining flour and whisk some more.",
      "Put the baking powder in the bowl. Stir until well blended.",
      "Dip the shrimp in the batter. Gently drop on the pot with oil and then deep fry for 2 minutes. Roll the shrimp over and continue to deep fry for 1 minute. Remove the fried beer battered shrimp and place in a plate topped with a paper towel. Perform this step until all the shrimp are cooked.",
      "Transfer to a serving plate. Serve with ponzu or sweet and sour sauce.",
      "Share and enjoy!"
    ],
    "cooking_time": "9 minutes",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/spicy-camaron-rebosado-deep-fried-beer-battered-shrimp/",
    "image_url": "",
    "image_path": "",
    "category": "Other Filipino Dishes"
  },
  {
    "title": "Beef Pares Mami Noodles Recipe",
    "ingredients": [
      "▢ 1/2 recipe for beef pares",
      "▢ 1 lb. round miki noodles",
      "▢ 1/2 cup chopped scallions",
      "▢ 3 tablespoons toasted garlic",
      "▢ 4 boiled eggs",
      "▢ 1 lb. beef neck bones",
      "▢ 8 cups water",
      "▢ 2 tablespoons fish sauce",
      "▢ Salt and ground black pepper to taste"
    ],
    "instructions": [
      "Pour water in a pot. Add the beef neck bones. Let boil. Simmer for 2 hours.",
      "Add salt and ground black pepper to taste.",
      "Arrange the miki noodles in a cooking basket. Submerge in boiling broth for 10 minutes. Remove, drain, and the set aside.",
      "Arrange the cooked miki noodles along with a serving of beef pares in individual bowls. Top with chopped scallions, toasted garlic, and a piece of boiled egg, sliced in half.",
      "Pour a cup or two of hot beef stock in the bowl. Season with some fish sauce and ground black pepper.",
      "Serve. Share and enjoy."
    ],
    "cooking_time": "2 hours",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/beef-pares-mami-noodles-recipe/",
    "image_url": "",
    "image_path": "",
    "category": "Soups And Stews"
  },
  {
    "title": "Fried Tilapia in Coconut Milk (Ginataang Tilapia)",
    "ingredients": [
      "▢ 1 to 2 pieces fried tilapia",
      "▢ 1 piece banana pepper",
      "▢ 3 pieces chili peppers optional",
      "▢ 2 cups coconut milk",
      "▢ 5 cloved garlic crushed",
      "▢ 1 medium red onion sliced",
      "▢ 2 thumbs ginger chopped",
      "▢ 2 to 3 tablespoons fish sauce",
      "▢ 2 cups malunggay leaves",
      "▢ 3 tablespoons cooking oil"
    ],
    "instructions": [
      "Heat oil in a cooking pot.",
      "Sauté garlic, onion, and ginger",
      "Pour the coconut milk in the pot. Let boil.",
      "Add the banana pepper and fried tilapia. Cover and cook in low heat for 15 minutes.",
      "Add chili peppers and dish sauce. Stir. Turn the fish over. Cover the pot and then continue to cook for 10 minutes.",
      "Add the malunggay leaves. Cook for 5 to 8 minutes.",
      "Transfer to a serving plate.",
      "Serve. Share and enjoy!"
    ],
    "cooking_time": "50 minutes",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/fried-tilapia-in-coconut-milk-ginataang-tilapia/",
    "image_url": "",
    "image_path": "",
    "category": "Seafood"
  },
  {
    "title": "Pork Chop Bicol Express Recipe",
    "ingredients": [
      "▢ 2 pieces pork chops",
      "▢ 2 cups coconut cream",
      "▢ 2 tablespoons shrimp paste bagoong alamang",
      "▢ 12 pieces Thai chili pepper chopped",
      "▢ 2 pieces long green pepper siling pansigang, chopped",
      "▢ 1 medium onion cubed",
      "▢ 1 cup water",
      "▢ 4 cloves garlic crushed and minced",
      "▢ 4 tablespoons cooking oil",
      "▢ Salt and ground black pepper to taste"
    ],
    "instructions": [
      "Heat oil in a pan.4 tablespoons cooking oil",
      "Once the oil gets hot, pan fry each pork chop for 1 minute per side. Remove from the pan and then set aside.2 pieces pork chops",
      "Using the remaining oil, sauté garlic and onion until the onion becomes soft.1 medium onion, 4 cloves garlic",
      "Pour the coconut cream in the pan. Let boil.2 cups coconut cream",
      "Add the chili and green pepper. Stir.12 pieces Thai chili pepper, 2 pieces long green pepper",
      "Gently add the pan-fried pork chop back in the pan. Pour the water and let the liquid boil. Cover and cook in low heat for 40 minutes or until the pork chop becomes tender.2 pieces pork chops, 1 cup water",
      "Add the shrimp paste. Stir. Cover and cook until the sauce reduces and becomes thick.2 tablespoons shrimp paste",
      "Sprinkle some salt and ground black pepper, if needed.Salt and ground black pepper to taste",
      "Transfer to a serving plate. Top with chopped chives or scallions. Serve with rice.",
      "Share and enjoy!"
    ],
    "cooking_time": "1 hour",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/pork-chop-bicol-express/",
    "image_url": "",
    "image_path": "",
    "category": "Pork Dishes"
  },
  {
    "title": "Cheesy Baked Macaroni Recipe",
    "ingredients": [
      "▢ 1 lb. macaroni",
      "▢ ¾ cup shredded cheddar cheese",
      "▢ 1 lb. ground beef",
      "▢ 1 Knorr beef cube",
      "▢ 1 small red bell pepper chopped",
      "▢ 1 small green bell pepper chopped",
      "▢ 1 small yellow onion cubed",
      "▢ 3 cloves garlic crushed and chopped",
      "▢ 1 lb. tomato sauce",
      "▢ Salt and ground black pepper to taste",
      "▢ 3 tablespoons cooking oil",
      "▢ 4 tablespoons butter",
      "▢ ½ cup all-purpose flour",
      "▢ 1 ¾ cups fresh milk",
      "▢ ½ cup quick melt cheese"
    ],
    "instructions": [
      "Cook the pasta according to package instructions. Set aside.",
      "Cook the tomato meat sauce by heating oil in a pot.",
      "Sauté the garlic, onion, and bell pepper for 3 to 5 minutes.",
      "Add the ground beef. Continue to cook until it browns.",
      "Add the Knorr Beef Cube. Stir.",
      "Pour the tomato sauce in the cooking pot. Stir and let boil.",
      "Sprinkle some salt and ground black pepper. Continue to cook for 5 minutes. Set aside.",
      "Prepare the white sauce by melting the butter in a pot.",
      "Add the all-purpose flour. Stir until the flour absorbs the butter and lumps are formed.",
      "Pour the milk in the cooking pot. Continuously stir the mixture while heating the milk until the flour dilutes completely. You can use a wire whisk while mixing to make the texture smooth (be careful with the Teflon pot though, if you are using one).",
      "Add the quick melt cheese. Continue to stir until the cheese completely melts and is well blended with the mixture. Turn the heat off.",
      "Arrange the macaroni in a mixing bowl. Pour the tomato meat sauce in and then mix well. Add a few tablespoons of the white sauce in the bowl along with some shredded cheddar cheese. Mix well.",
      "Arrange the macaroni mixture on a baking pan. Top with remaining white sauce. Make sure to spread the sauce all over to cover the top.",
      "Preheat oven to 375F. Bake for 15 to 18 minutes.",
      "Remove from the oven. Serve.",
      "Share and enjoy!"
    ],
    "cooking_time": "1 hour",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/cheesy-baked-macaroni-recipe/",
    "image_url": "",
    "image_path": "",
    "category": "Other Filipino Dishes"
  },
  {
    "title": "Classic Beef Morcon Recipe",
    "ingredients": [
      "▢ 2 lbs. eye of round or top sirloin steak thinly sliced",
      "▢ 2 pieces beef franks cut in half",
      "▢ 4 boiled eggs wedged",
      "▢ 1 medium carrot cut into sticks",
      "▢ 1 can 14 oz. diced tomato",
      "▢ 1 cup tomato sauce",
      "▢ 3/4 cup water",
      "▢ 1 Knorr Beef Cube",
      "▢ 1 dill pickle cut into sticks",
      "▢ 1 medium yellow onion diced",
      "▢ 4 cloves garlic crushed and minced",
      "▢ Salt and ground black pepper to taste",
      "▢ ½ cup all-purpose flour",
      "▢ 8 tablespoons cooking oil",
      "▢ 3 to 4 tablespoons soy sauce",
      "▢ ½ teaspoon garlic powder",
      "▢ ¼ teaspoon ground black pepper"
    ],
    "instructions": [
      "Flatten the steak by pounding with a meat tenderizer tool.",
      "Combine steak and the steak marinade ingredients. Mix well. Make sure that the steak (beef) is coated all over. Let it stay for at least 10 minutes.",
      "Slice the steak into 6 x 5 inch pieces. Put a slice of beef frank, pickle, carrot, and wedged boiled egg in one side of the steak. Roll the steak until a cylindrical shape is formed. Secure by tying a kitchen twine. This will be your beef morcon. Set aside. Perform this step until all the steak is consumed.",
      "Heat 5 tablespoons of oil in a pan. Dredge the rolled beef morcon in all-purpose flour. Pan-fry all the sides for 1 minute or until it turns light to medium brown. Set aside.",
      "On a clean pan, heat the remaining 3 tablespoons of cooking oil.",
      "Sauté garlic and onion",
      "Add the diced tomato and tomato sauce.",
      "Pour-in water and add Knorr Beef Cube. Stir. Let boil.",
      "Put the pan-fried morcon in the pan. Cover and then simmer for 50 to 60 minutes. Add water if the sauce starts to dry out.",
      "Sprinkle salt and pepper. Stir.",
      "Turn the heat off. Let the beef morcon cool down. Slice into serving pieces.",
      "Transfer to a serving plate. Top with remaining sauce.",
      "Share and enjoy!"
    ],
    "cooking_time": "1 hour",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/classic-beef-morcon-recipe/",
    "image_url": "",
    "image_path": "",
    "category": "Other Filipino Dishes"
  },
  {
    "title": "Crockpot Beef Pares Recipe",
    "ingredients": [
      "▢ 4 cups garlic fried rice",
      "▢ ¼ cup chopped scallions",
      "▢ Salt to taste optional",
      "▢ 2 lbs. top sirloin cubed",
      "▢ 3 cloves garlic crushed and minced",
      "▢ 2 teaspoons minced ginger",
      "▢ 1 medium onion chopped",
      "▢ 3 to 4 pieces star anise",
      "▢ 4 tablespoons brown sugar",
      "▢ 1/8 teaspoon ground black pepper",
      "▢ ¼ cup soy sauce",
      "▢ 1 ½ cups beef broth"
    ],
    "instructions": [
      "Combine all the crockpot ingredients in a crockpot / slow cooker. Cover and set to low heat. Slow cook for 8 hours",
      "Remove the cover. Stir. Taste and add salt (if needed).",
      "Transfer the beef pares with some sauce in a serving bowl. Top with chopped scallions. Prepare the soup by pouring 3 tablespoons of sauce in a bowl and add a cup of hot beef broth.",
      "Serve with garlic-fried rice. Share and enjoy!"
    ],
    "cooking_time": "8 hours",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/crockpot-beef-pares-recipe/",
    "image_url": "",
    "image_path": "",
    "category": "Soups and Stews"
  },
  {
    "title": "Embutido Meatloaf with Tomato and Basil Grilled Cheese Sandwich",
    "ingredients": [
      "▢ 2 slices white bread",
      "▢ 3 slices pork embutido Steamed Filipino meatloaf",
      "▢ 2 slices of quick melt cheese",
      "▢ 3 pieces chopped fresh basil",
      "▢ 6 pieces grape tomato sliced in half lengthwise",
      "▢ 3 tablespoons butter"
    ],
    "instructions": [
      "Arrange the cheese, embutido, basil, and tomato over a slice of white bread. Top with the remaining slice to form sandwich.",
      "Melt half of the butter in medium-sized pan.",
      "Gently slide the sandwich in the pan. Cook one side in medium heat for 60 to 90 seconds or until it turns golden brown. Gently press the sandwich with your spatula while doing this.",
      "Slide the spatula under the sandwich and lift it up high enough to add the remaining butter to the pan. Once the butter melts, turn the sandwich over to cook the other side until it turns golden brown.",
      "Remove the sandwich from the pan. Slice in half. Serve.",
      "Share and enjoy!"
    ],
    "cooking_time": "10 minutes",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/embutido-meatloaf-with-tomato-and-basil-grilled-cheese-sandwich/",
    "image_url": "",
    "image_path": "",
    "category": "Pork Dishes"
  },
  {
    "title": "Chicken Pastel in a Cup",
    "ingredients": [
      "▢ 1 lb. boneless chicken breast cut into cubes",
      "▢ 3 beef franks or hotdog chopped",
      "▢ 2 boiled eggs chopped",
      "▢ 1 cup button mushroom chopped",
      "▢ 1 medium carrot chopped",
      "▢ 1 medium potato cut into cubes",
      "▢ 3 tablespoons butter",
      "▢ 2 tablespoons all-purpose flour",
      "▢ 1 ½ cup chicken broth or stock",
      "▢ ½ cup shredded cheddar cheese",
      "▢ 12 slices of loaf bread dark edges removed",
      "▢ Salt and ground black pepper to taste"
    ],
    "instructions": [
      "Preheat oven to 350F",
      "Make the bread cups by flattening the bread slices. Do this by placing each slice on a clean flat surface. Use a rolling pin or a clean bottle to flatten the bread. Do this by rolling it over the bread slices. Arrange the flatten bread slices on a cupcake pan. Make sure to press it against the pan to form a cup shaped figure.",
      "Put the pan with bread slices in the oven. Bake for 5 to 6 minutes. Remove and let it cool. Set aside.",
      "Melt butter in a pan.",
      "Sauté the mushroom, chicken, and hotdogs for 5 minutes",
      "Add potato and carrot and pour half of the chicken broth. Let boil. Cover and cook in medium heat for 5 to 7 minutes. Add more broth if needed.",
      "Sprinkle the flour all over the pot a tablespoon at a time. Stir and make sure that all ingredients are well blended.",
      "Add the chopped boiled eggs and remaining chicken broth. Stir and cook until the desired thickness is achieved.",
      "Sprinkle salt and pepper to taste.",
      "Scoop the chicken pastel and put it in the bread cups. Top with grated or shredded cheese.",
      "Serve. Share and enjoy!"
    ],
    "cooking_time": "40 minutes",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/chicken-pastel-in-a-cup/",
    "image_url": "",
    "image_path": "",
    "category": "Chicken Dishes"
  },
  {
    "title": "Creamy Mais Maja Blanca",
    "ingredients": [
      "▢ 2 cups coconut milk",
      "▢ 2/3 cups fresh milk",
      "▢ 1 can 7.6 ounce table cream (all-purpose cream and heavy whipping cream can be used)",
      "▢ 1 cup sweet corn cream style",
      "▢ 6 tablespoons granulated white sugar",
      "▢ 6 tablespoons cornstarch",
      "▢ 7 ounces 1/2 can condensed milk",
      "▢ ¼ cup latik"
    ],
    "instructions": [
      "Combine fresh milk, table cream, and cornstarch in a bowl. Stir to mix. Set aside.",
      "Heat the coconut milk in a pot. Let boil.",
      "Add the sugar, condensed milk, cream style sweet corn. Stir. Add the cornstarch mixture from step 1. Continue to cook while stirring until the texture thickens to a paste-like texture.",
      "Transfer the mixture to a mold. Let it cool down. Refrigerate for 1 hour.",
      "Top with latik.",
      "Slice into serving pieces.",
      "Serve. Share and enjoy"
    ],
    "cooking_time": "20 minutes",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/creamy-mais-maja-blanca/",
    "image_url": "",
    "image_path": "",
    "category": "Desserts"
  },
  {
    "title": "Corned Beef Fried Rice with Egg",
    "ingredients": [
      "▢ 1 cup corned beef use canned corned beef",
      "▢ 3 cups leftover white rice",
      "▢ 1 raw egg beaten",
      "▢ 3 egg cooked sunny side up",
      "▢ 3 tablespoons cooking oil",
      "▢ 1 teaspoon minced garlic",
      "▢ A dash of salt"
    ],
    "instructions": [
      "Heat the oil in a wide frying pan.",
      "Add the beaten egg. Cook one side for 1 minute in medium heat. Turn the egg over and cook the other side for another minute or until the egg is completely cooked. Remove the egg and put in a plate. Set aside.",
      "Using the remaining oil (add more oil f needed), brown the minced garlic. Add the corned beef. Cook for 2 minutes.",
      "Put the rice in the pan. Stir-fry for 5 minutes.",
      "Add the egg. Manually divide the egg into small pieces using a spatula. Add a dash of salt and then continue to stir-fry for 2 minutes.",
      "Transfer to a plate. Top with a piece of sunny side up egg.",
      "Serve. Share and enjoy!"
    ],
    "cooking_time": "20 minutes",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/corned-beef-fried-rice-with-egg/",
    "image_url": "",
    "image_path": "",
    "category": "Other Filipino Dishes"
  },
  {
    "title": "Pork Mechado Recipe",
    "ingredients": [
      "▢ 1 ½ lb. pork shoulder sliced into cubes",
      "▢ 1 large potato cubed",
      "▢ 1 medium red bell pepper sliced",
      "▢ 1 medium green bell pepper sliced",
      "▢ 1 cup frozen green peas",
      "▢ 1 Knorr Pork Cube",
      "▢ 1 lime or calamansi",
      "▢ 3 tablespoons soy sauce",
      "▢ 1 can 6 oz. tomato sauce",
      "▢ 1 ½ cups water",
      "▢ 5 cloves garlic crushed and chopped",
      "▢ 1 medium onion diced",
      "▢ Salt and ground black pepper to taste",
      "▢ 3 tablespoons cooking oil"
    ],
    "instructions": [
      "Combine pork, soy sauce, and juice of 1 lime in a bowl. Mix well and let it stay for 10 minutes.",
      "Heat the oil in a cooking pot.",
      "Saute the garlic and onion until the onion gets soft.",
      "Add the marinated pork (include the remaining marinade). Cook until it pork turns light brown.",
      "Pour tomato sauce and water. Let boil.",
      "Add the Knorr Pork Cube. Stir. Cover and cook in low heat for 35 to 40 minutes.",
      "Add the potato and green peas. Cook for 10 minutes.",
      "Stir-in the bell peppers. Continue to cook for 5 minutes.",
      "Add salt and ground black pepper to taste.",
      "Transfer to a serving plate.",
      "Serve. Share and enjoy!"
    ],
    "cooking_time": "1 hour",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/pork-mechado-recipe/",
    "image_url": "",
    "image_path": "",
    "category": "Main Dishes"
  }
]