[
  {
    "title": "How to Make Authentic Carbonara",
    "ingredients": [
      "▢ 1 lb spaghetti",
      "▢ 10 ounces Panceta",
      "▢ 2 1/2 cups Pecorino cheese grated",
      "▢ 5 pieces egg",
      "▢ 6 cups water for boiling",
      "▢ 1 tablespoon salt",
      "▢ Ground black pepper"
    ],
    "instructions": [
      "Crack the eggs in a bowl. Beat until the texture becomes smooth.",
      "Add Pecorino cheese. Continue mixing until cheese and eggs are well blended. Season with ground black pepper. Set aside.",
      "Cook spaghetti according to package instructions. Set aside.",
      "Sear Panceta on a clean skillet until it browns, and enough oil gets extracted.",
      "Add cooked pasta in the skillet. Toss.",
      "Combine ¼ cup tap water and ½ cup pasta water and then pour into the sauce mixture. Mix well.",
      "Pour the sauce into the skillet. Toss while cooking in low heat until well distributed.",
      "Season with more ground black pepper.",
      "Serve. Share and enjoy!"
    ],
    "cooking_time": "N/A",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/how-to-make-authentic-carbonara/",
    "image_url": "",
    "image_path": "",
    "category": "Other Filipino Dishes"
  },
  {
    "title": "Tuscan Salmon",
    "ingredients": [
      "▢ 3 pieces salmon fillet",
      "▢ 3 cups baby spinach",
      "▢ 5 ounces sun-dried tomato",
      "▢ 5 tablespoons Parmesan cheese",
      "▢ 1 1/2 cups heavy whipping cream",
      "▢ 6 cloves garlic minced",
      "▢ 1 piece onion chopped",
      "▢ 1/2 cup water",
      "▢ 2 tablespoons butter",
      "▢ 4 tablespoons cooking oil",
      "▢ 2 tablespoons parsley chopped (optional)",
      "▢ Salt and ground black pepper to taste"
    ],
    "instructions": [
      "Rub salt and pepper all over the salmon. Let it stay for 5 minutes.",
      "Heat oil in a pan. Fry salmon until light brown. Turn it over and perform the same step on the opposite side. Remove salmon from the pan. Set aside.",
      "Melt butter on the same pan with remaining oil.",
      "Add garlic. Cook until it starts to brown.",
      "Add onion. Sauté until it softens. Put the chopped sun-dried tomato into the pan. Cook for 30 seconds. Pour water. Cover the pan. Continue cooking for 3 minutes.",
      "Pour-in heavy whipping cream. Stir. Cover and let boil.",
      "Add Parmesan cheese and spinach. Cover and cook for 1 minute.",
      "Put the fried salmon fillet back into the pan. Cover and cook for 2 minutes.",
      "Season with ground black pepper as needed. Sprinkle chopped parsley on top.",
      "Serve hot. Share and enjoy!"
    ],
    "cooking_time": "N/A",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/tuscan-salmon/",
    "image_url": "",
    "image_path": "",
    "category": "Other Filipino Dishes"
  },
  {
    "title": "How to Cook Chicken Kare-Kare sa Gata",
    "ingredients": [
      "▢ 1 1/2 lbs. chicken cut into serving pieces",
      "▢ 1 piece Knorr Chicken Cube",
      "▢ 1 cup ground peanuts",
      "▢ 2 bunches  baby bok choy",
      "▢ 1 piece eggplant sliced",
      "▢ 8 pieces snake beans",
      "▢ 1 piece onion  chopped",
      "▢ 5 cloves garlic chopped",
      "▢ 2 teaspoons paprika",
      "▢ 1 teaspoon turmeric powder",
      "▢ 1/4 cup bagoong alamang",
      "▢ 3 cups coconut milk",
      "▢ 5 tablespoons cooking oil",
      "▢ Ground black pepper to taste",
      "▢ 1 teaspoon salt"
    ],
    "instructions": [
      "Rub salt all over chicken pieces. Let it stay for 5 minutes.",
      "Heat 3 tablespoons oil in a cooking pot. Pan-fry chicken for 2 minutes per side. Remove from pan. Set aside.",
      "Add remaining oil. Saute garlic and onion until the latter turns translucent.",
      "Pour-in coconut milk. Let boil. Add paprika and turmeric powder. Stir.",
      "Add chicken. Cover the pot and let the sauce boil.",
      "Add Knorr Chicken Cube. Set heat between low to medium. Continue cooking for 25 minutes.",
      "Add peanut paste. Stir until paste is completely diluted.",
      "Put the eggplant, snake beans into the pot. Cover and cook for 5 to 8 minutes. Add bok choy. Cook for 3 minutes.",
      "Season with ground black pepper.",
      "Transfer to a serving bowl. Serve with bagoong alamang. Share and enjoy!"
    ],
    "cooking_time": "N/A",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/how-to-cook-chicken-kare-kare-sa-gata/",
    "image_url": "",
    "image_path": "",
    "category": "Chicken Dishes"
  },
  {
    "title": "No Steam Easy Flan",
    "ingredients": [
      "▢ 2 pieces eggs",
      "▢ ½ ounce unflavored gelatin powder uncolored",
      "▢ 7.6 ounces all-purpose cream",
      "▢ 6 tablespoons sugar",
      "▢ 1 1/4 cup evaporated milk",
      "▢ 1/4 cup water",
      "▢ 1 teaspoon vanilla extract",
      "▢ 2 1/2 tablespoons water",
      "▢ 8 tablespoons granulated white sugar"
    ],
    "instructions": [
      "Make the caramel by combining sugar and water in a saucepan. Apply heat. Continue cooking while stirring until the mixture thickens and the color turns medium brown. This is now the caramel.",
      "Pour the caramel into separate molds. (Note: you may use glass, metal, or ceramic baking pans as molds for the flan. Using ramekins is also a good idea.) Tilt the mold to spread caramel evenly. Set aside.",
      "Start making the flan by cracking the eggs into the bowl. Beat using a wire whisk. Gradually add sugar. Continue beating until mixture gets well blended. Set aside.",
      "Microwave ¼ cup the water for 35 seconds. Combine powdered gelatin and water. Mix well by stirring. Set aside.",
      "Pour milk into a pan. Apply heat until it goes into a simmer. (Note: do not apply too much heat. We want the milk to only be below boiling point).",
      "Scoop around 5 to 6 tablespoons of warm milk (1 tablespoon at a time) into the bowl with sugar and eggs. Continue to stir the mixture. (Note: This process is also known as tempering. Two ingredients with different temperatures are gradually combined in order to slowly rise to the same temp.)",
      "Pour the mixture from the bowl into the pan. Continue stirring until well blended.",
      "Gradually add gelatin mixture while stirring. Continue cooking in low heat for 1 minute. Turn off heat.",
      "Transfer mixture back to the bowl. Add all-purpose cream and vanilla extract. Stir until well blended. Remove bubbles by skimming.",
      "Pour the flan mixture into the molds. Cover each mold with aluminum foil or plastic wrap. Refrigerate overnight.",
      "Serve for dessert. Share and enjoy!"
    ],
    "cooking_time": "N/A",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/no-steam-easy-flan/",
    "image_url": "",
    "image_path": "",
    "category": "Desserts"
  },
  {
    "title": "Easy Lechon Paksiw",
    "ingredients": [
      "▢ 2 ½ lbs. pork lechon",
      "▢ 1 piece Knorr Pork Cube",
      "▢ 3 cups lechon sauce",
      "▢ 2 pieces onion chopped",
      "▢ 5 cloves garlic chopped",
      "▢ ½ cup white vinegar",
      "▢ ¼ cup white sugar",
      "▢ 5 pieces dried bay leaves",
      "▢ 2 teaspoons whole peppercorn",
      "▢ 2 ½ cups water",
      "▢ Salt to taste"
    ],
    "instructions": [
      "Chop the lechon into serving pieces. Place in a large cooking pot and add water. Bring to a boil.",
      "Add garlic, onion, whole peppercorn, and dried bay leaves. Cover the pot. Boil for 5 minutes.",
      "Add Knorr Pork Cube and vinegar. Cover the pot. Let boil. Adjust the heat between low to medium. Cook for 30 minutes.",
      "Pour lechon sauce into the pan. Stir. Cook for 15 minutes.",
      "Add sugar and season with salt. Cook for 3 minutes.",
      "Transfer to a serving bowl. Serve with rice."
    ],
    "cooking_time": "N/A",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/easy-lechon-paksiw/",
    "image_url": "",
    "image_path": "",
    "category": "Pork Dishes"
  },
  {
    "title": "How to make Biko with Latik",
    "ingredients": [
      "▢ 2 cups glutinous rice washed",
      "▢ 1 ½ cups water",
      "▢ 2 cups brown sugar",
      "▢ 4 cups coconut milk",
      "▢ ½ teaspoon salt",
      "▢ 2 cups coconut milk"
    ],
    "instructions": [
      "Prepare latik by boiling 2 cups coconut milk in a saucepan. Adjust heat to medium. Continue boiling while stirring until texture thickens. Lower the heat once oil becomes visible. Cook and stir constantly until the color of the residue turns golden brown (note: latik is the residue formed after boiling coconut milk). Separate the oil from the latik using a strainer or filter paper. Set aside.",
      "Start making the biko by combining glutinous rice and water in a rice cooker. Set the cooker to “cook” mode. Wait until the process is complete.",
      "Boil 4 cups coconut milk in a cooking pot for 7 minutes.",
      "Add brown sugar and salt. Stir.",
      "Add cooked rice. Stir until well blended. Continue cooking while stirring until rice absorbs the coconut milk mixture completely.",
      "Line banana leaves over a baking tray. Brush coconut oil over the leaves.",
      "Transfer biko into the tray once the consistency becomes thick and sticky (paste-like). Top with latik. Let it cool down for at least 15 minutes.",
      "Serve. Share and enjoy!"
    ],
    "cooking_time": "N/A",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/how-to-make-biko-with-latik/",
    "image_url": "",
    "image_path": "",
    "category": "Other Filipino Dishes"
  },
  {
    "title": "Ginataang Alimasag with Sitaw at Kalabasa",
    "ingredients": [
      "▢ 3 pieces crab steamed for 12 minutes",
      "▢ 40 grams Knorr Ginataang Gulay Recipe Mix",
      "▢ 15 pieces snake beans cut into 2-inch pieces",
      "▢ 12 ounces calabaza squash cubed",
      "▢ 1 piece onion chopped",
      "▢ 2 thumbs  ginger minced",
      "▢ 5 cloves garlic crushed and chopped",
      "▢ 3 tablespoons cooking oil",
      "▢ 2 1/2 cups water room temperature",
      "▢ Salt and ground black pepper to taste optional"
    ],
    "instructions": [
      "Heat oil in a pan.",
      "Saute garlic, onion, and ginger until onion turns translucent.",
      "Combine water and Knorr Ginataang Gulay Mix. Stir until well blended. Pour mixture into the pan. Let boil.",
      "Add crab and kalabasa. Cover and boil for 5 minutes.",
      "Add snake beans. Continue cooking for 8 minutes.",
      "Season with salt and pepper if desired. Note: this is an optional step."
    ],
    "cooking_time": "N/A",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/ginataang-alimasag-with-sitaw-at-kalabasa/",
    "image_url": "",
    "image_path": "",
    "category": "Vegetable Dishes"
  },
  {
    "title": "How to Make Goto Lamang Loob and Tokwa’t Baboy",
    "ingredients": [
      "▢ 1 cup jasmine rice",
      "▢ 1 cup glutinous rice",
      "▢ 4 quarts water",
      "▢ 2 pieces Knorr Beef Cube",
      "▢ 1 lb. beef heart",
      "▢ 1 lb. ox tripe",
      "▢ ½ lb. beef large intestine",
      "▢ 1 piece onion chopped",
      "▢ 3 thumbs  ginger minced",
      "▢ 1 head  garlic minced",
      "▢ 3 stalks  lemongrass",
      "▢ 4 pieces bay leaves dry",
      "▢ 3 tablespoons fish sauce",
      "▢ 1 teaspoon turmeric powder",
      "▢ 2 teaspoons onion powder",
      "▢ 4 tablespoons cooking oil",
      "▢ 1 cup green onion chopped",
      "▢ ½ cup toasted garlic",
      "▢ ¼ cup chili garlic oil",
      "▢ Salt and ground black pepper to taste",
      "▢ 1 lb. pig cheeks",
      "▢ 2 stalks  lemongrass",
      "▢ 1 quart water",
      "▢ 3 pieces bay leaves dried",
      "▢ 1 tablespoon salt",
      "▢ 14 ounces extra firm tofu",
      "▢ 1 ½ cups cooking oil",
      "▢ 1 piece red onion sliced",
      "▢ 3 pieces Thai chili chopped",
      "▢ ¼ cup green onion chopped",
      "▢ 4 cloves garlic crushed and chopped",
      "▢ ¼ cup soy sauce",
      "▢ ¾ cups white vinegar",
      "▢ ½ cup lemon lime soda",
      "▢ Salt and pepper to taste"
    ],
    "instructions": [
      "Prepare the innards by boiling 2 quarts water in a cooking pot. Add lemongrass and dried bay leaves. Continue boiling for 30 minutes. Discard water and set the innards aside.",
      "Heat oil in a large pot. Sauté garlic until it starts to brown. Add onion and ginger. Continue sautéing until the onion softens.",
      "Add Jasmine and glutinous rice. Stir and cook for 1 to 2 minutes.",
      "Pour water in the pot. Let boil. Add Knorr Beef Cubes and fish sauce. Stir.",
      "Add innards. Cover and adjust heat between low to medium. Continue cooking while stirring every few minutes until the innards are very tender and the texture of the rice turns porridge like. Note: This should take up to 90 minutes or so. Add more water if needed.",
      "Season with onion powder, turmeric powder, salt, toasted garlic, and ground black pepper. Keep warm.",
      "Prepare the sauce by combining all the sauce ingredients in a bowl. Stir until well blended. Make sure to shake the lemon lime soda first to release the fizz. Set aside.",
      "Boil water in a cooking pot. Add pork cheeks, lemongrass, bay leaves, and salt. Continue boiling in medium heat for 45 minutes. Remove pork. Let it cool down. Remove pork and set it aside.",
      "Heat ½ cup oil in a pan. Fry one side of the pork until it turns brown. Turn it over and do the same thing to the other side. Note: frying one side should take around 2 minutes. Remove pork from the pan. Set aside.",
      "Add remaining oil to the pan. Deep-fry tofu until it turns golden brown. You may turn it over as needed.",
      "Slice tofu and pork into desired serving pieces. Arrange in a serving bowl. Top with chopped red onion. Pour a good amount of sauce over it.",
      "Arrange the Goto in a serving bowl. Top it with calamansi, green onions, toasted garlic, and chili garlic oil.",
      "Serve hot with tokwat baboy. Share and enjoy!"
    ],
    "cooking_time": "N/A",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/how-to-make-goto-lamang-loob-and-tokwat-baboy/",
    "image_url": "",
    "image_path": "",
    "category": "Soups And Stews"
  },
  {
    "title": "How to Cook Humba (Bisaya Version)",
    "ingredients": [
      "▢ 4 lbs. pork belly cubed",
      "▢ 1 piece Knorr Pork Cube",
      "▢ 3 cups clear soft drink",
      "▢ 1 cup water as needed",
      "▢ 2 ounces banana blossoms",
      "▢ 2 tablespoons salted black beans",
      "▢ 3 tablespoons white vinegar",
      "▢ ½ cup soy sauce",
      "▢ 1 piece onion chopped",
      "▢ 2 tablespoons brown sugar",
      "▢ 6 cloves garlic crushed and chopped",
      "▢ ½ teaspoon crushed peppercorn"
    ],
    "instructions": [
      "Heat a wok or pan. Sear pork belly until it turns brown and enough oil gets extracted from the fat. Remove the pork from the wok. Set aside.",
      "Heat around 3 tablespoons of oil. Sauté garlic and onion until the onion softens.",
      "Add the pork back into the wok and pour-in soy sauce. Sauté for 1 minute.",
      "Add vinegar. Continue sautéing until liquid dries-up.",
      "Pour clear soft drinks into the wok. Cover and let boil.",
      "Add crushed peppercorn. Adjust heat to low. Continue boiling for 35 minutes.",
      "Add banana blossoms and salted black beans. Cover the wok and continue cooking until the pork gets tender. Note: you can add water if needed.",
      "Add brown sugar. Stir. Cook for 1 minute.",
      "Transfer to a serving plate. Serve with warm rice.",
      "Share and enjoy!"
    ],
    "cooking_time": "N/A",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/how-to-cook-humba-bisaya-version/",
    "image_url": "",
    "image_path": "",
    "category": "Pork Dishes"
  },
  {
    "title": "Pulutan Style Beef Caldereta",
    "ingredients": [
      "▢ 4 lbs beef neck bone chopped",
      "▢ 1 piece Knorr Beef Cube",
      "▢ 1 1/2 tablespoons soy sauce",
      "▢ 2 cups water",
      "▢ 1 piece green bell pepper sliced",
      "▢ 1 piece red bell pepper sliced",
      "▢ 1 piece potato cubed",
      "▢ 1 piece carrots sliced",
      "▢ 8 ounces tomato sauce",
      "▢ 3 tablespoons peanut butter",
      "▢ 1 tablespoon liver spread",
      "▢ 5 pieces Thai chili pepper chopped",
      "▢ 1 piece onion chopped",
      "▢ 5 cloves garlic crushed",
      "▢ Salt and ground black pepper to taste",
      "▢ 3 tablespoons cooking oil"
    ],
    "instructions": [
      "Heat oil in a cooking pot. Saute onion and garlic until onion softens",
      "Add beef. Saute until the outer part turns light brown.",
      "Add soy sauce. Pour tomato sauce and water. Let boil.",
      "Add Knorr Beef Cube. Cover the pressure cooker. Cook for 30 minutes.",
      "Pan-fry carrot and potato until it browns. Set aside.",
      "Add chili pepper,  liver spread and peanut butter. Stir.",
      "Add bell peppers, fried potato and carrot. Cover the pot. Continue cooking for 5 to 7 minutes.",
      "Season with salt and ground black pepper. Serve."
    ],
    "cooking_time": "N/A",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/pulutan-style-beef-caldereta/",
    "image_url": "",
    "image_path": "",
    "category": "Other Filipino Dishes"
  },
  {
    "title": "Spicy Sotanghon Chicken Soup",
    "ingredients": [
      "▢ 1 1/2 lb. chicken cut into serving pieces",
      "▢ 1 piece Knorr Chicken Cube",
      "▢ 2 stalks  lemongrass chopped",
      "▢ 1 piece red onion sliced",
      "▢ 8 pieces Thai chili pepper",
      "▢ 2 cloves garlic",
      "▢ 2 thumbs  ginger",
      "▢ 1 tablespoon patis",
      "▢ 1/2 cup green onions sliced",
      "▢ 2 ounces sotanghon",
      "▢ 4 cups water",
      "▢ 1/4 teaspoon ground white pepper",
      "▢ 3 tablespoons cooking oil"
    ],
    "instructions": [
      "Combine garlic, onion, ginger, lemongrass, and chili. Crush the ingredients using a mortar and pestle tool or a food processor. Set aside.",
      "Heat oil in a cooking pot. Saute the crushed ingredients for 1 minute.",
      "Add chicken. Saute until outer part turns light brown.",
      "Pour-in  water. Let boil.",
      "Add Knorr Chicken Cube. Cover the pot. Continue cooking using low to medium heat for 30 minutes.",
      "Add sotanghon. Cook for 3 minutes.",
      "Add green onions and season with patis and ground white pepper.",
      "Transfer to a serving bowl. Serve.",
      "Share and enjoy!"
    ],
    "cooking_time": "N/A",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/spicy-sotanghon-chicken-soup/",
    "image_url": "",
    "image_path": "",
    "category": "Noodles"
  },
  {
    "title": "Beef Stir Fry Recipe",
    "ingredients": [
      "▢ 1 lb. beef tenderloin thinly sliced",
      "▢ 3 tablespoons oyster sauce",
      "▢ 1 teaspoon soy sauce",
      "▢ 1 ½ tablespoons cornstarch",
      "▢ 1/2 teaspoon ground black pepper",
      "▢ 1- piece green bell pepper sliced into thick strips",
      "▢ 1- piece red bell pepper sliced into thick strips",
      "▢ 1/2 cup cooking oil"
    ],
    "instructions": [
      "Combine beef, oyster sauce, soy sauce, and ground black pepper. Mix well. Let it stand for 5 minutes.",
      "Add cornstarch into the bowl. Mix until all ingredients are well distributed. Set aside.",
      "Heat oil in a pan. Fry bell peppers for 1 minute. Stir once in a while. Remove bell peppers from the pan. Set aside.",
      "Using the remaining oil, stir fry marinated beef until it starts to brown.",
      "Add fried bell peppers and toss until all ingredients are distributed.",
      "Transfer beef stir fry to a serving plate.",
      "Serve with rice.  Share and Enjoy!"
    ],
    "cooking_time": "N/A",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/stir-fried-beef/",
    "image_url": "",
    "image_path": "",
    "category": "Other Filipino Dishes"
  }
]