[
  {
    "title": "Pork Giniling Hardinera Recipe",
    "ingredients": [
      "▢ 1 entire serving pork giniling see recipe here",
      "▢ 1/2 cup green peas",
      "▢ 1/2 cup bread crumbs",
      "▢ 3 boiled eggs",
      "▢ 2 raw eggs",
      "▢ 1/2 cup chopped pineapple",
      "▢ 1/2 cup shredded cheddar cheese",
      "▢ 1/4 cup sweet pickle relish",
      "▢ 1/4 cup raisins",
      "▢ 1/4 cup roasted red bell pepper"
    ],
    "instructions": [
      "Slice the boiled eggs in half, lengthwise. Set aside.",
      "Combine all the ingredients in a mixing bowl. Crack the raw eggs and add to the bowl. Mix well.",
      "Arrange the mixture including the sliced boiled eggs in oval containers. These are locally known as llanera. Cover the llanera with aluminum foil.",
      "Boil 8 cups water in a steamer. Using the steamer, steam the llaneras with pork giniling hardinera for 30 minutes.",
      "Remove from the steamer.Let it cool for 1 to 2 hours.",
      "Serve after cooling down or refrigerate for 3 hours and serve chilled.",
      "Share and enjoy!"
    ],
    "cooking_time": "1 hour",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/pork-giniling-hardinera-recipe/",
    "image_url": "",
    "image_path": "",
    "category": "Pork Dishes"
  },
  {
    "title": "How to Cook Tender Juicy Rib Eye Steak Using a Frying Pan",
    "ingredients": [
      "▢ 2 slices of ribeye steak 4 to 8 oz. per slice",
      "▢ 4 cloves garlic",
      "▢ 6 pieces dried bay leaves",
      "▢ 1/2 cup butter",
      "▢ 1/4 cup canola oil",
      "▢ salt and ground black pepper"
    ],
    "instructions": [
      "Sprinkle salt and pepper on both sides of the steaks. Rub and make sure that all the area are completely covered. Let it stay for 10 minutes",
      "Heat the cooking oil in a pan.",
      "Gently fry one side of the steak for 1 minute.",
      "Turn the steak over to fry the other side. Add garlic and bay leaves and fry for 1 minute. Scoop some butter and oil over the steak while frying.",
      "Flip the steak to continue to cook the other side. For rare steaks do this step until each side is cooked for a total of 3 minutes. If you do not like some pink in your steak, cook it a little bit longer.",
      "Remove the steaks from the pan. Lay it fat over a wooden chopping board. Let it rest for 10 minutes.",
      "Slice the juicy rib eye steaks. Enjoy!"
    ],
    "cooking_time": "16 minutes",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/how-to-cook-tender-juicy-rib-eye-steak-using-a-frying-pan/",
    "image_url": "",
    "image_path": "",
    "category": "Other Filipino Dishes"
  },
  {
    "title": "Pancit Molo Recipe",
    "ingredients": [
      "▢ 1 1/2 lbs. ground pork",
      "▢ 15 pieces medium shrimp shell removed and deveined",
      "▢ 30 to 35 pieces wrapper wonton",
      "▢ 1 medium yellow onion minced",
      "▢ 1/2 teaspoon garlic powder",
      "▢ 1/2 teaspoon sesame oil",
      "▢ 1 egg",
      "▢ 1 teaspoon salt",
      "▢ 1/8 teaspoon ground black pepper",
      "▢ 1/2 rotisserie chicken",
      "▢ 48 oz. chicken broth",
      "▢ 3 cups water",
      "▢ 1/2 cup chopped scallions",
      "▢ 1/4 cup toasted garlic",
      "▢ 2 to 3 tablespoons fish sauce"
    ],
    "instructions": [
      "Start to prepare the wonton by chopping the shrimp into small pieces and put it in a mixing bowl.",
      "Add ground pork, onion, sesame oil, egg, salt, garlic powder, and pepper. Mix well.",
      "Lay a piece of wonton wrapper flat on a plate. Scoop 1 1/2 teaspoon of the mixture and place on the middle of the wrapper. Fold the wonton wrapper to form a triangle. Press the sides to keep the meat mixture intact. Gold both sides of the triangle wrapper inward. Set aside. Do this step until the pork mixture is completely consumed.",
      "Make the soup by combining water and chicken broth in a soup pot. Let boil.",
      "Add the rotisserie chicken (with bones). Cover and boil in low heat for 20 minutes. Turn the heat off temporarily.",
      "Remove the chicken and let it cool down. Separate the meat from the bones. Shred the meat.",
      "Turn the heat back on and wait until the liquid reboils. Add the shredded chicken meat.",
      "Put the wontons in the soup pot. Cover and cook for 5 to 10 minutes in low to medium heat.",
      "Add the fish sauce and half of the chopped scallions. Stir.",
      "Transfer to a serving plate. Top with toasted garlic and additional scallions.",
      "Serve. Share and enjoy!"
    ],
    "cooking_time": "1 hour",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/pancit-molo-recipe/",
    "image_url": "",
    "image_path": "",
    "category": "Noodles"
  },
  {
    "title": "Ginisang Okra with Fish Flakes Recipe",
    "ingredients": [
      "▢ 12 to 15 pieces okra sliced",
      "▢ 4 pieces galunggong fish fried",
      "▢ 1 medium yellow onion chopped",
      "▢ 2 medium ripe tomato cubed",
      "▢ 5 cloves garlic crushed and chopped",
      "▢ 2 tablespoons fish sauce patis",
      "▢ 1/8 teaspoon ground black pepper",
      "▢ 2 1/2 tablespoons cooking oil"
    ],
    "instructions": [
      "Separate the fish from the bones using your fingers. Shred the fish and set aside.",
      "Heat the cooking in a large wok of frying pan.",
      "Once the oil gets really hot, saute the garlic and onion.",
      "Add the tomato and shredded fish. Cook for 2 minutes.",
      "Stir-in the sliced okra. Cook in high heat for 5 to 10 minutes.",
      "Add fish sauce and ground black pepper. Stir and cook for a 2 minutes.",
      "Transfer to a serving plate. Serve with rice."
    ],
    "cooking_time": "25 minutes",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/ginisang-okra-with-fish-flakes-recipe/",
    "image_url": "",
    "image_path": "",
    "category": "Vegetable Dishes"
  },
  {
    "title": "Grilled Filipino Sweet Sausage",
    "ingredients": [
      "▢ 2 lbs. Pampanga longganisa Filipino sweet sausage",
      "▢ 3 cups water",
      "▢ 1 cup spicy vinegar"
    ],
    "instructions": [
      "Pour water in a medium cooking pot. Let boil.",
      "Add the longganisa (Filipino sweet sausages). Cover and boil for 20 minutes or until the water evaporates.",
      "Heat-up the grill. Grill the sausages for 15 minutes while turning it every 3 minutes until all the sides are cooked completely.",
      "Remove from the grill. Serve for breakfast with fried eggs and spicy vinegar.",
      "Share and enjoy!"
    ],
    "cooking_time": "40 minutes",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/grilled-filipino-sweet-sausage/",
    "image_url": "",
    "image_path": "",
    "category": "Other Filipino Dishes"
  },
  {
    "title": "How to Cook Lumpia (Easy Recipe)",
    "ingredients": [
      "▢ 1 pound ground pork",
      "▢ 1 small carrot minced",
      "▢ 1 medium sweet onion yellow, minced",
      "▢ 1 teaspoon garlic powder",
      "▢ 1/8 teaspoon ground black pepper",
      "▢ 1 teaspoon salt",
      "▢ 1 piece egg",
      "▢ 20 to 25 pieces medium lumpia wrapper",
      "▢ 1 ½ cups cooking oil"
    ],
    "instructions": [
      "Combine ground pork, salt, pepper, garlic powder, minced onion, cracked egg, and minced carrot in a bowl. Mix well using your hands. Make sure to wash before doing this step, or wear gloves that are latex free and BPA free.",
      "Lay a piece of lumpia wrapper flat on a plate. Adjust the orientation of the wrapper by rotating the plate so that one side points upward while the rest of the sides are pointing down, left, and right — just like a diamond. Scoop 1 ½ to 2 tablespoons of meat mixture and place it at one the left side of the wrapper. Shape the meat unto a cylinder. Fold the pointed side of the wrapper towards the pork mixture and then roll inwards by 1 to 2 inches. Fold the top and bottom ends inwardand then continue to roll the wrapper until the mixture is completely wrapped. Seal by rubbing water using your fingers on the right end of the wrapper and press it gently against the rolled lumpia. Perform this step with the remaining ingredients.",
      "Heat the oil in a small pot.",
      "Deep fry the lumpia in batches of 4 to 6 pieces in medium heat for 10 minutes or until the wrapper turns light to golden brown.",
      "Remove the fried lumpia from the pot. Let the oil drip.",
      "Serve with banana ketchup or sweet and sour sauce.",
      "Share and enjoy!"
    ],
    "cooking_time": "27 minutes",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/how-to-cook-lumpia/",
    "image_url": "",
    "image_path": "",
    "category": "Vegetable Dishes"
  },
  {
    "title": "The Simplest Paksiw na Galunggong Recipe",
    "ingredients": [
      "▢ 1 pound galunggong cleaned",
      "▢ 2 thumbs ginger sliced",
      "▢ 1 long green pepper optional",
      "▢ 1/2 cup white vinegar",
      "▢ 1 cup water",
      "▢ 4 cloves garlic crushed and chopped",
      "▢ Salt to taste"
    ],
    "instructions": [
      "Rub salt all over the fish including the inner cavity. Let it stay for 10 minutes.",
      "Arrange the fish in a cooking pot along with the ginger, garlic, and long green pepper. Pour water and vinegar. Let boil.",
      "Cover and simmer for 30 to 45 minutes. Add more water if needed.",
      "Add salt to taste. Stir.",
      "Serve with warm rice. Enjoy!"
    ],
    "cooking_time": "55 minutes",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/easy-simplest-paksiw-na-galunggong-recipe/",
    "image_url": "",
    "image_path": "",
    "category": "Pork Dishes"
  },
  {
    "title": "Excursion Chicken and Pork Adobo",
    "ingredients": [
      "▢ 3 lbs. pork belly sliced into large cubes",
      "▢ 2 lbs. chicken cut into serving pieces",
      "▢ 1/4 cup coconut vinegar",
      "▢ 8 to 10 tablespoons soy sauce",
      "▢ 1 head garlic crushed",
      "▢ 1 teaspoon whole peppercorn",
      "▢ 4 cups water",
      "▢ 1 piece beef cube or beef bouillon",
      "▢ 6 pieces dried bay leaves",
      "▢ 3 tablespoons cooking oil",
      "▢ Salt to taste"
    ],
    "instructions": [
      "Combine soy sauce, garlic, whole peppercorn, and bay leaves in a large bowl. Mix well.",
      "Add the pork and chicken slices. Toss until the ingredients are well blended.",
      "Cover and place inside the fridge to marinate for at least 3 hours. You can also marinate overnight.",
      "Heat oil in a large and wide pan.",
      "Once the oil gets hot, add the marinated pork and chicken including the remaining marinade. Cook for 10 to 12 minutes or until the meat browns.",
      "Pour water and let boil.",
      "Add the beef cube. Stir. Cover and cook in low heat for 60 minutes or until the meat gets very tender.",
      "Pour-in the vinegar. Let boil. Cook until the the liquid almost evaporates.",
      "Add salt and pepper if needed.",
      "Serve. Share and enjoy!",
      "Add salt and more pepper if needed."
    ],
    "cooking_time": "1 hour",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/excursion-chicken-and-pork-adobo/",
    "image_url": "",
    "image_path": "",
    "category": "Chicken Dishes"
  },
  {
    "title": "Pork Baby Back Ribs Nilaga Recipe",
    "ingredients": [
      "▢ 4 lbs baby back rib sliced",
      "▢ 3 piece  potato peeled and sliced",
      "▢ 1/2 piece  cabbage sliced",
      "▢ 3 bunches  baby bok choy",
      "▢ 8 to 10 cups water",
      "▢ 1 piece  yellow onion chopped",
      "▢ 1/2 teaspoon garlic powder",
      "▢ 1/4 teaspoon ground black pepper",
      "▢ 3 tablespoons fish sauce patis",
      "▢ 2 stalks  celery chopped"
    ],
    "instructions": [
      "Pour the water in a soup pot. Let boil.",
      "Add the chopped onion, celery, ground black pepper, and garlic powder. Cover and boil in medium heat for 5 minutes.",
      "Add the pork baby back ribs. Cover and simmer for 60 to 90 minutes. (note: you can cook faster by boiling for 45 minutes, but simmering will make the meat more tender and will bring out the flavor). Add more water as needed.",
      "Put the potato and cabbage in the soup pot. Stir. Cover and boil for 5 minutes.",
      "Add the baby bok choy and stir-in the fish sauce. Cook for 1 minute.",
      "Transfer to a serving plate. Serve.",
      "Share and enjoy"
    ],
    "cooking_time": "1 hour",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/pork-baby-back-ribs-nilaga-recipe/",
    "image_url": "",
    "image_path": "",
    "category": "Soups And Stews"
  },
  {
    "title": "How to Grill Liempo in the Oven",
    "ingredients": [
      "▢ 3 lbs. pork belly sliced for grilling",
      "▢ 1/2 cup papaya atchara",
      "▢ 1/2 cup soy sauce",
      "▢ Juice from 1 lemon or 4 pieces calamansi",
      "▢ 1 tablespoon minced garlic",
      "▢ 1/2 cup banana ketchup",
      "▢ 1/4 teaspoon ground black pepper"
    ],
    "instructions": [
      "Combine all the marinade ingredients in a bowl. Mix well.",
      "Put the sliced liempo in the bowl where the. marinade is. Makes sure that the pork belly is coated with the mixture. Cover and refrigerate for at least 3 hours, but overnight is preferred.",
      "Place a grill rack over a baking tray topped with aluminum foil. Arrange the marinated liempo on the rack.",
      "Preheat oven to 370F. Bake the liempo for 20 minutes. Turn the meat over and grill the other side for 15 to 20 minutes. Baste the meat with the remaining marinade every 10 minutes.",
      "Set the heat to 430F. Roast for 6 to 10 minutes. No need to turn over.",
      "Transfer to a serving plate. Serve with papaya atchara and grilled liempo sauce.",
      "Share and enjoy!"
    ],
    "cooking_time": "3 hours",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/how-to-grill-liempo-in-the-oven/",
    "image_url": "",
    "image_path": "",
    "category": "Pork Dishes"
  },
  {
    "title": "How to Cook Pancit Canton ala Corazon",
    "ingredients": [
      "▢ 8 ounces 227 grams package Pancit Canton Noodles",
      "▢ 3 links Chinese sausage Sliced into thin pieces",
      "▢ 1/4 lb. pork sliced thinly",
      "▢ 1/4 lb chicken boiled and shredded",
      "▢ 1/2 cup chopped chicken liver",
      "▢ 2 cups snow peas",
      "▢ 1 medium carrot julienne",
      "▢ 1 cup sliced bell peppers",
      "▢ 1 1/2 cups chopped cabbage",
      "▢ 2 tablespoons soy sauce",
      "▢ 2 tablespoons oyster sauce",
      "▢ 2 cups water this can be the water used to boil the chicken",
      "▢ 1 piece chicken bouillon chicken cube",
      "▢ 3 cloves minced garlic",
      "▢ 1 small minced red onion",
      "▢ 3 tablespoons cooking oil",
      "▢ Salt and black pepper powder to taste"
    ],
    "instructions": [
      "Heat oil in a wok or wide pan.",
      "Saute onion and garlic.",
      "Add the pork. Stir fry for 1 minute.",
      "Stir-in the chicken liver. Cook for another minute.",
      "Gently add the shredded chicken and sliced sausage. Stir fry for 2 to 3 minutes.",
      "Add soy sauce and oyster sauce. Pour-in water and bring to a boil.",
      "Add the chicken cube. Stir until all ingredients are well blended.",
      "Put-in the pancit canton. Increase the heat to high. Let the noodles absorb the liquid. Toss the noodles so that the liquid can be absorbed equally.",
      "Set the heat to medium. Add the snow peas, cabbage, bell peppers and carrots. Gently toss the noodles every 20 seconds for 3 to 5 minutes.",
      "Add salt and pepper as needed. Toss.",
      "Serve!"
    ],
    "cooking_time": "45 minutes",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/how-to-cook-pancit-canton-ala-corazon/",
    "image_url": "",
    "image_path": "",
    "category": "Noodles"
  },
  {
    "title": "How to Cook Ginataang Langka with Tinapa Flakes",
    "ingredients": [
      "▢ 3 pounds unripe jackfruit equivalent to to 3 pounds, chopped and seeds removed",
      "▢ 4 cups coconut milk",
      "▢ 8 pieces hot chili pepper",
      "▢ 4 ounces tinapa flakes",
      "▢ 1 1/2 cups malunggay leaves",
      "▢ 5 cloves garlic crushed and chopped",
      "▢ 1 large yellow onion minced",
      "▢ 2 tablespoons shrimp paste bagoong",
      "▢ 2 teaspoons vinegar",
      "▢ 3 tablespoons canola oil",
      "▢ 1/8 teaspoon ground black pepper",
      "▢ salt to taste"
    ],
    "instructions": [
      "Heat oil in a pan. Saute garlic and onion until the onion gets soft.",
      "Add the chopped unripe jackfruit. Cook for 3 to 5 minutes.",
      "Put-in the tinapa flakes (smoked fish flakes). Stir and cook for 1 minute.",
      "Add the ground black pepper and chili peppers.",
      "Pour-in the coconut milk. Let boil. Add the shrimp paste and vinegar. Stir. Cover and cook in medium heat for 15 minutes while stirring occasionally.",
      "Add the malunggay leaves. Stir and continue to cook for 5 to10 minutes.",
      "Sprinkle some salt only if needed. Stir.",
      "Transfer to a serving bowl.",
      "Serve with a cup of warm steamed white rice."
    ],
    "cooking_time": "50 minutes",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/how-to-cook-ginataang-langka-with-tinapa-flakes/",
    "image_url": "",
    "image_path": "",
    "category": "Seafood"
  }
]