[
  {
    "title": "Crispy Dinakdakan Recipe",
    "ingredients": [
      "▢ 3/4 lb pork belly",
      "▢ 3/4 lb pig ears",
      "▢ 6 ounces pork liver sliced",
      "▢ 2 pieces onions sliced",
      "▢ ½ cup green onions chopped",
      "▢ 6 pieces Thai chili pepper chopped",
      "▢ 2 teaspoons whole peppercorn",
      "▢ 6 pieces dried bay leaves",
      "▢ 4 cloves garlic crushed",
      "▢ Salt to taste",
      "▢ 3 cups cooking oil",
      "▢ 6 cups water",
      "▢ ¾ cup Lady's Choice Mayonnaise",
      "▢ ¼ cup Soy sauce",
      "▢ 5 pieces Calamansi",
      "▢ ½ teaspoon salt",
      "▢ ¼ teaspoon ground black pepper"
    ],
    "instructions": [
      "Tenderize the pork belly and pig ears. Do this by boiling water in a cooking pot. Add whole peppercorn, dried bay leaves, and garlic. Pig ears and pork belly into the pot. Cover and boil between low to medium heat for 45 to 60 minutes. Drain the liquid, set aside.",
      "Prepare the liver by rubbing with salt. Heat 2 tablespoons oil in a pan. Cook the liver by pan-frying until brown. Set aside.",
      "Heat 3 cups cooking oil in a deep fryer or deep cooking pot. Rub salt all over the boiled pig ears and belly.",
      "Deep-fry the ears  for 10 minutes. Remove from the fryer and let it rest for 5 minutes. Fry again for another 10 minutes. Set aside.",
      "Deep-fry pork belly for 8 minutes. Remove from the fryer and let it rest for 5 minutes. Deep-fry again for 5 minutes or until crispy. Set aside.",
      "Prepare the dressing by combining all dressing ingredients in a bowl. Stir until smooth.",
      "Chop the ears and belly into bite-size pieces. Place in a large bowl and then add the fried liver. Toss. Add onion, green onion, and chili pepper. Mix until well blended.",
      "Pour half of the dressing into the bowl. Toss.",
      "Transfer to a serving plate. Serve. Share and enjoy!"
    ],
    "cooking_time": "N/A",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/crispy-dinakdakan-recipe/",
    "image_url": "",
    "image_path": "",
    "category": "Pork Dishes"
  },
  {
    "title": "Mayo Brownies",
    "ingredients": [
      "▢ 1 cup all-purpose flour",
      "▢ 10 tablespoons Lady's Choice Mayonnaise",
      "▢ 3 tablespoons dark cocoa powder",
      "▢ 1/2 cup walnuts chopped",
      "▢ 3/4 cup granulated white sugar",
      "▢ 1/2 teaspoon salt",
      "▢ 1 teaspoon baking soda",
      "▢ 1/2 cup chocolate chips",
      "▢ 2 pieces eggs",
      "▢ 1 teaspoon vanilla extract"
    ],
    "instructions": [
      "Preheat oven to 350F.",
      "Prepare the dry ingredients by sifting flour and cocoa powder in a mixing bowl. Add baking powder and sugar. Mix well using a wire whisk. Set aside.",
      "On a separate bowl, crack eggs. Beat the eggs.",
      "Add Lady's Choice Mayonnaise. Mix well until all the ingredients in the bowl are well blended. Add vanilla extract and gradually add-in sugar. Continue to mix until texture becomes smooth.",
      "Melt the chocolate chips using a double boiler (watch video below for details).Stir-in the melted chocolate with the mayonnaise mixture. Mix well.",
      "Gradually add the dry ingredients with the mayonnaise mixture. Fold until smooth. Add chopped walnuts.",
      "Pour the brownie mixture into an 8x8 baking pan. Bake for 20 to 25 minutes.",
      "Remove from the oven. Let the brownies cool down.",
      "Serve. Share and enjoy!"
    ],
    "cooking_time": "N/A",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/mayo-brownies/",
    "image_url": "",
    "image_path": "",
    "category": "Other Filipino Dishes"
  },
  {
    "title": "Crispy Dinuguan",
    "ingredients": [
      "▢ 1 1/2 lbs. liempo",
      "▢ 1 piece Knorr Pork Cube",
      "▢ 10 ounces pork blood",
      "▢ 3/4 cup white vinegar",
      "▢ 1 stalk lemongrass crushed",
      "▢ 1 piece onion chopped",
      "▢ 2 thumbs ginger crushed",
      "▢ 4 cloves garlic minced",
      "▢ 2 teaspoons whole peppercorn",
      "▢ 5 pieces dried bay leaves",
      "▢ 1 1/2 tablespoons salt",
      "▢ 1 1/2 tablespoons sugar",
      "▢ 3 pieces long pepper",
      "▢ 6 cups water",
      "▢ 3 cups cooking oil"
    ],
    "instructions": [
      "Prepare the pork by boiling until tender. Start by boiling water in a cooking pot. Add bay leaves, whole peppercorn, salt, and pork belly (liempo).Boil for 45 to 60 to 60 minutes or until pork gets tender.",
      "Remove boiled pork from the pot. Place it in a clean plate. Let it cool down for 5 minutes. Save the pork stock for later.",
      "Rub 2 teaspoons salt all over the boiled pork. Let it stay for 10 minutes.",
      "Heat oil in a deep-fryer or cooking pot. Deep-fry the boiled pork for 8 minutes. Remove from the fryer and let it rest for 5 minutes.Put the pork back into the fryer and continue to fry for 3 minutes more, or until crispy. Slice the crispy pork into bite-size pieces. Set aside.",
      "Make the dinuguan sauce by heating 3 tablespoons of cooking oil in  a cooking pot. Saute onion, ginger, and garlic.",
      "Once onion softens, pour the pork stock. Note: this is the water used to boil the liempo earlier.",
      "Add lemongrass. Cover and boil in medium heat for 8 minutes. Remove lemongrass and ginger from the pot.",
      "Pour-in pork blood. Stir thoroughly while waiting for it to boil.",
      "Add Knorr Pork Cube. Stir.",
      "Add vinegar. Let the mixture boil. Stir and add sugar. Continue to cook uncovered until the mixture reduces to half.",
      "Add peppers and cook for 2 minutes. Transfer to a serving plate. Serve. Share and enjoy!"
    ],
    "cooking_time": "N/A",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/crispy-dinuguan/",
    "image_url": "",
    "image_path": "",
    "category": "Pork Dishes"
  },
  {
    "title": "Easy Chicken Adobo Recipe",
    "ingredients": [
      "▢ 2 lbs chicken sliced into serving pieces",
      "▢ 1 piece Knorr Chicken Cube",
      "▢ 1 head  garlic crushed",
      "▢ 6 tablespoons white vinegar",
      "▢ 6 tablespoons soy sauce",
      "▢ 1 1/2 teaspoons whole peppercorn",
      "▢ 5 pieces dried bay leaves",
      "▢ 1/2 cup water",
      "▢ 1 teaspoon sugar",
      "▢ 4 tablespoons cooking oil"
    ],
    "instructions": [
      "Combine chicken, 1/4 of the total amount of garlic, whole peppercorn, dried bay leaves, soy sauce, vinegar, and water in a cooking pot. Cover and let boil. Stir and make sure that all ingredients are well blended.",
      "Add Knorr Chicken Cube and sugar. Stir. Cover the pot and cook for 10 minutes.",
      "Turn the chicken over and cook the opposite side for another 10 minutes. Set aside.",
      "Heat oil in a clean pan. Saute remaining garlic until it turns light brown.",
      "Pan fry the chicken for 1 minute per side. Pour the adobo sauce into the pan. Boil until it reduces to half.",
      "Transfer to a serving plate. Serve with warm rice."
    ],
    "cooking_time": "N/A",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/easy-chicken-adobo-recipe/",
    "image_url": "",
    "image_path": "",
    "category": "Chicken Dishes"
  },
  {
    "title": "Creamy Chicken Pastel",
    "ingredients": [
      "▢ 2 lbs chicken breast cut into cubes",
      "▢ 1 piece Knorr Chicken Cube",
      "▢ 1 piece Chorizo de Bilbao sliced",
      "▢ 4 pieces hotdogs sliced",
      "▢ 1 piece potato cubed",
      "▢ 1 piece carrot sliced",
      "▢ 1 piece red bell pepper sliced",
      "▢ 1 piece green bell pepper  sliced",
      "▢ 3/4 cup button mushroom sliced",
      "▢ 15 ounces all-purpose cream",
      "▢ 1/4 cup soy sauce",
      "▢ 1 piece lime",
      "▢ 1 piece onion chopped",
      "▢ 4 cloves garlic minced",
      "▢ 3/4 cup water",
      "▢ Salt and ground black pepper to taste"
    ],
    "instructions": [
      "Combine chicken, soy sauce, and lime in a large bowl. Mix well. Marinate chicken for at least 30 minutes.",
      "Heat oil in a cooking pot. Saute onion and garlic.",
      "Once the onion softens, add the chorizo. Saute for 1 minute.",
      "Put chicken into the pot. Saute until the color turns light brown.",
      "Add water. Let boil.",
      "Add Knorr Chicken Cube. Stir. Cover and continue to cook for 20 minutes.",
      "Put the sliced hotdogs into the pot. Cook in medium heat until the liquid reduces to half.",
      "Add potato and carrot. Pour-in all-purpose cream. Cover and cook for 8 minutes.",
      "Stir-in the mushroom and bell peppers. Stir. Cook for 3 minutes.",
      "Season with ground black pepper and salt.",
      "Transfer to a serving plate. Serve with warm rice. Share and enjoy!"
    ],
    "cooking_time": "N/A",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/creamy-chicken-pastel/",
    "image_url": "",
    "image_path": "",
    "category": "Chicken Dishes"
  },
  {
    "title": "Meaty Spaghetti",
    "ingredients": [
      "▢ 1 lb spaghetti",
      "▢ 8 cups water",
      "▢ 2 teaspoons salt",
      "▢ 1 piece Knorr Pork Cube",
      "▢ 8 ounces ground pork",
      "▢ 4 pieces hotdog sliced",
      "▢ 6 tablespoons liver spread",
      "▢ 1 yellow onion minced",
      "▢ 4 cloves garlic minced",
      "▢ 30 ounces tomato sauce",
      "▢ 1 cup water",
      "▢ 4 tablespoons white sugar",
      "▢ 3 tablespoons cooking oil",
      "▢ Salt and ground black pepper to taste"
    ],
    "instructions": [
      "Make the sauce by heating oil in a cooking pot. Saute onion and garlic until onion softens.",
      "Add ground pork. Cook until light brown.",
      "Pour tomato sauce into the pot and then add water. Stir. Let boil.",
      "Add Knorr pork cube. Stir and cover the pot. Cook for 30 minutes between low to medium heat.",
      "Add liver spread. Stir and let it blend with the sauce.",
      "Put-in hotdogs. Cook for 5 minutes.",
      "Season with sugar, ground black pepper, and salt.",
      "Prepare the spaghetti by following the package instructions.",
      "Arrange the cooked spaghetti in a serving plate. Top with meaty spaghetti sauce and shredded cheese.",
      "Serve. Share and enjoy!"
    ],
    "cooking_time": "N/A",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/meaty-spaghetti/",
    "image_url": "",
    "image_path": "",
    "category": "Pork Dishes"
  },
  {
    "title": "Longanisa Fried Rice and Ginisang Corned Beef with Kalabasa",
    "ingredients": [
      "▢ 3 pieces longanisa",
      "▢ 2 pieces egg",
      "▢ 4 1/2 cups leftover rice",
      "▢ 1 teaspoon salt",
      "▢ 1/4 cup butter",
      "▢ 1/2 cup carrot diced",
      "▢ 1/2 cup green peas",
      "▢ ground black pepper to taste",
      "▢ 12 ounces corned beef",
      "▢ 2 pieces onion sliced",
      "▢ 5 cloves garlic crushed",
      "▢ 3 tablespoons cooking oil",
      "▢ 1/4 piece butternut squash cubed",
      "▢ 1/2 cup water",
      "▢ Salt and ground black pepper to taste"
    ],
    "instructions": [
      "Prepare the longanisa fried rice by combining salt and leftover rice. Gently mix until well blended. Set aside.",
      "Crack eggs in a bowl. Beat until smooth. Heat oil in a pan. Pour the beaten egg mixture. Cook until done. Set aside.",
      "Remove the casing from the longanisa. Heat oil in a pan. Add the longanisa meat. Cook while separating the mixture into smaller pieces.",
      "Add salted rice. Stir-fry for 3 to 5 minutes.",
      "Slice the eggs into smaller pieces. Add into the pan. Stir-fry for 1 minute.",
      "Add carrots and green peas. Cook for 3 to 5 minutes. Season with ground black pepper. Tranfer to a serving plate.",
      "Cook the corned beef by heating oil in a clean pan. Saute garlic and onion until onion softens.",
      "Add corned beef. Saute for 3 minutes.",
      "Add kalabasa. Stir. Pour water. Cover and cook for 5 minutes.",
      "Transfer to a serving plate. Serve with longanisa fried rice.",
      "Share and enjoy!"
    ],
    "cooking_time": "N/A",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/longanisa-fried-rice-and-ginisang-corned-beef-with-kalabasa/",
    "image_url": "",
    "image_path": "",
    "category": "Vegetable Dishes"
  },
  {
    "title": "Kalabasa and Corned Beef Nuggets",
    "ingredients": [
      "▢ 12 ounces corned beef",
      "▢ 2 cups kalabasa",
      "▢ 1 piece egg",
      "▢ 1 teaspoon garlic powder",
      "▢ 1/2 teaspoon ground black pepper",
      "▢ 1 teaspoon salt",
      "▢ 1 cup breadcrumbs for the mixture",
      "▢ 1/2 cup breadcrumbs for coating",
      "▢ 2 1/2 cups cooking oil"
    ],
    "instructions": [
      "Grate the kalabasa or butternut squash using a cheese grater. You can also use a food processor.",
      "Combine grated kalabasa nd corned beef in a bowl. Mix the ingredients together.",
      "Add garlic powder, pepper, salt, egg, and breadcrumbs. Continue to mix until all ingredients are well blended. Note: If the texture of the mixture is still sticky, you can add more breadcrumbs.",
      "Heat oil in a cooking pot.",
      "Scoop around 2 tablespoons of mixture and mold it into nuggets. Dredge in breadcrumbs.",
      "Fry one side until golden brown. Turn over and continue to fry the opposite side until the same color is achieved. Remove from the cooking pot and let excess oil drip.",
      "Tranfer to a serving plate. Serve with your favorite dipping sauce."
    ],
    "cooking_time": "N/A",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/kalabasa-and-corned-beef-nuggets/",
    "image_url": "",
    "image_path": "",
    "category": "Vegetable Dishes"
  },
  {
    "title": "Ukoy Dulong Recipe",
    "ingredients": [
      "▢ 4 oz. dulong silver fish",
      "▢ 2 cups mung bean sprouts",
      "▢ 1 1/2 cups cooking oil",
      "▢ 1/2 cup cornstarch",
      "▢ 1/2 cup flour",
      "▢ 1/2 teaspoon baking powder",
      "▢ 1/2 teaspoon salt",
      "▢ 1/2 teaspoon ground black pepper",
      "▢ 1/4 teaspoon garlic powder",
      "▢ 1/4 teaspoon onion powder",
      "▢ 1 egg",
      "▢ 1 cup water"
    ],
    "instructions": [
      "In a large mixing bowl, combine all batter ingredients in a bowl starting with the dry ingredients and ending by adding water and egg. Mix well.",
      "Add the dulong and mung bean sprouts. Gently stir until all ingredients are well blended.",
      "Heat oil in a pan.",
      "Arrange 1/2 cup of mixture in a saucer. Note: make sure the there is enough batter in the mixture.",
      "Once the oil gets hot, Slide the mixture into the pan. Cook one side in medium het until it turns golden brown and crisp. Turn over using a spatula. Cook the other side the same way.",
      "Remove the dulong okay from the pan. Stack in a plate with paper towels.",
      "Serve with spicy vinegar such as pinakurat or sinamak.",
      "Share and enjoy!"
    ],
    "cooking_time": "20 minutes",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/ukoy-dulong-recipe/",
    "image_url": "",
    "image_path": "",
    "category": "Seafood"
  },
  {
    "title": "Buko Pandan",
    "ingredients": [
      "▢ 20 ounces young coconut strips",
      "▢ 250 ml Nestlé All Purpose Cream",
      "▢ 150 ml Nestlé Carnation Condensada",
      "▢ ½ cup cooked sago pearls optional",
      "▢ 2 cups water",
      "▢ 3 ounces powdered gelatin",
      "▢ ½ lb. pandan leaves",
      "▢ ¼ cup sugar",
      "▢ ½ teaspoon buko pandan flavoring"
    ],
    "instructions": [
      "Boil water in a saucepan, then add pandan leaves.½ lb. pandan leaves, 2 cups water",
      "Cover and continue boiling for 15 minutes.",
      "Remove the leaves, then add sugar, powdered gelatin, and buko pandan flavoring. Stir until the powder is completely dissolved in water.3 ounces powdered gelatin, ¼ cup sugar, ½ teaspoon buko pandan flavoring",
      "Turn off the heat and transfer the mixture to a mold. Allow the temperature to cool.",
      "The texture of the mixture should be firm once cooled. You may also place this inside the refrigerator for faster results (Note: allow the temperature to go down before putting it in the refrigerator).",
      "Combine young coconut strips, Nestlé Carnation Condensada, Nestlé All Purpose Cream, and cooked sago pearls.250 ml Nestlé All Purpose Cream, 150 ml Nestlé Carnation Condensada, ½ cup cooked sago pearls, 20 ounces young coconut strips",
      "Allow the texture to thicken by chilling in the refrigerator or freezer for a few hours.",
      "Slice the firm gelatin into ½ inch cubes and combine it with the creamy mixture.",
      "Transfer to individual serving platters or cups. You can also top it with a scoop of vanilla ice cream. Serve, share, and enjoy!"
    ],
    "cooking_time": "N/A",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/buko-pandan-dessert-recipe/",
    "image_url": "",
    "image_path": "",
    "category": "Other Filipino Dishes"
  },
  {
    "title": "Pork Adobo with Tokwa and Tausi and Garlic Fried Rice Adobo",
    "ingredients": [
      "▢ 1 1/2 lbs. pork cubed",
      "▢ 2 pieces tofu cubed and fried",
      "▢ 1 teaspoon brown sugar",
      "▢ 10 cloves garlic crushed",
      "▢ 3 tablespoons salted black beans",
      "▢ 4 pieces dried bay leaves",
      "▢ 1 teaspoon whole peppercorn",
      "▢ 5 tablespoons soy sauce",
      "▢ 4 tablespoons vinegar",
      "▢ 1 1/2 cups water",
      "▢ 5 tablespoons cooking oil",
      "▢ 3 cups leftover rice",
      "▢ 1 teaspoon salt",
      "▢ 3 tablespoons garlic oil",
      "▢ 1 1/2 tablespoons toasted garlic",
      "▢ 3 tablespoons adobo sauce"
    ],
    "instructions": [
      "Prepare the toasted garlic by heating oil in a pan. Add crushed garlic while oil is heating up. Cook in low heat until garlic turns golden brown. Set aside. Note: the oil used to cook the garlic turns to garlic oil.",
      "Heat half of the garlic oil in a pan. Saute pork until light brown.",
      "Pour soy sauce and vinegar. Let boil.",
      "Add  salted black beans and water. Cover and cook for 40 minutes or until pork gets tender.",
      "Add fried tofu and sugar. Stir and cook for 3 minutes. Transfer to a serving plate.",
      "Prepare the fried rice by combining salt and rice. Mix gently.",
      "Heat the remaining toasted garlic and oil in a pan. Add rice. Pour-in adobo sauce. Stir-fry for 3 to 5 minutes.",
      "Serve with pork adobo. Enjoy!"
    ],
    "cooking_time": "N/A",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/pork-adobo-with-tokwa-and-tausi-and-garlic-fried-rice-adobo/",
    "image_url": "",
    "image_path": "",
    "category": "Chicken Dishes"
  },
  {
    "title": "Bangus Sisig Recipe",
    "ingredients": [
      "▢ 1 piece bangus fried or baked, and then flaked",
      "▢ 1 piece onion chopped",
      "▢ 1/2 cup scallions chopped",
      "▢ 1 tablespoon chili pepper labuyo or Thai chili",
      "▢ 1/2 teaspoon ground black pepper",
      "▢ 1 tablespoon soy sauce",
      "▢ 2 teaspoons ginger minced",
      "▢ 1 cup crushed chicharon pork rind",
      "▢ 1/2 tablespoon mayonnaise",
      "▢ 1/4 cup unsalted butter",
      "▢ 1 teaspoon garlic powder",
      "▢ 1/2 teaspoon salt"
    ],
    "instructions": [
      "Melt-in butter in a large pan",
      "Add the onion and cook for 3 minutes",
      "Put-in the ginger. Stir and cook for 2 minutes in low to medium heat.",
      "Add the bangus and then stir.",
      "Put-in the garlic powder, salt,ground black pepper, and soy sauce. Stir and cook for 5 minutes.",
      "Add the chicharon, scallions, and chili. Stir and cook for 3 minutes more.",
      "Put-in the mayonnaise. Stir.",
      "Transfer to a serving plate. Serve.",
      "Share and enjoy!"
    ],
    "cooking_time": "35 minutes",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/bangus-sisig-recipe/",
    "image_url": "",
    "image_path": "",
    "category": "Pork Dishes"
  }
]