[
  {
    "title": "Inihaw na Panga ng Tuna (Grilled Tuna Jaw)",
    "ingredients": [
      "▢ 3 lbs. Tuna jaw Panga ng Tuna, rinsed",
      "▢ 1 cup soy sauce",
      "▢ 5 cloves garlic crushed and minced",
      "▢ 9 pieces red chili",
      "▢ ¼ cup brown sugar",
      "▢ 2 pieces lime or 4 pieces calamansi",
      "▢ ¼ teaspoon ground black pepper",
      "▢ ½ cup soy sauce",
      "▢ 2 tablespoons white sugar"
    ],
    "instructions": [
      "Combine soy sauce, lime, ground black pepper, and chili in a medium bowl. Stir.",
      "Add garlic and sugar. Stir thoroughly until the sugar dissolves.",
      "Place the tuna in a re-sealable plastic bag. Pour the soy sauce marinade along with the tuna. Let the air out of the bag and then seal it. Place inside the refrigerator and let it marinate overnight.",
      "Prepare the basting sauce (use the basting sauce ingredients above) by combining soy sauce and white sugar in a bowl. Stir well. Set aside.",
      "Heat the grill. Start to grill the Tuna by arranging it over the cooking grate. Brush a generous amount of basting sauce on the top part of the fish. Grill for 3 to 5 minutes.",
      "Turn the tuna over to cook the opposite side. Baste the top and sides. Continue to grill for another 5 minutes.",
      "Gently flip the fish jaw to grill the other side one more time. Cook it for 5 to 7 minutes.",
      "Once done, flip it back for the last time to cook the opposite side. Cook it for 5 minutes. Transfer to serving plate. Serve with a dipping sauce composed of soy sauce, lime, and chili.",
      "Serve. Share and enjoy!"
    ],
    "cooking_time": "3 hours",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/inihaw-na-panga-ng-tuna-grilled-tuna-jaw/",
    "image_url": "",
    "image_path": "",
    "category": "Pork Dishes"
  },
  {
    "title": "Crawfish in Coconut Milk with Spinach",
    "ingredients": [
      "▢ 3 lbs. crawfish steamed",
      "▢ 4 cups 2 cans coconut milk",
      "▢ 5 pieces long green chili",
      "▢ 3 cups fresh spinach",
      "▢ 3 tablespoons shrimp paste",
      "▢ 1 medium onion minced",
      "▢ 3 cloves garlic crushed and chopped",
      "▢ 1/8 teaspoon powdered black pepper or white pepper",
      "▢ 3 tablespoons cooking oil"
    ],
    "instructions": [
      "Heat oil in a cooking pot",
      "Sauté onion and garlic until the onion turns translucent",
      "Add the shrimp paste. Stir and cook for 30 seconds.",
      "Pour the coconut milk in the pot. Let boil. Cover and cook in medium heat until it reduces to half.",
      "Add the chili and crawfish. Stir and cook for 5 minutes while stirring every minute.",
      "Slide-in the spinach and add the pepper powder. Cook for 2 minutes.",
      "Transfer to a serving bowl. Serve with warm white rice.",
      "Share and enjoy!"
    ],
    "cooking_time": "55 minutes",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/crawfish-in-coconut-milk-with-spinach/",
    "image_url": "",
    "image_path": "",
    "category": "Seafood"
  },
  {
    "title": "How to Steam Broccoli",
    "ingredients": [
      "▢ 2 cups Fresh or frozen broccoli",
      "▢ 1 1/2 cups Water",
      "▢ Salt pepper, butter or salad dressing to taste"
    ],
    "instructions": [
      "Add 1-2 inches of water in a medium pot. Place over high heat and bring to the boil.",
      "Arrange the broccoli chunks on a steamer basket and suspend it over the boiling water. Close the pot lid and allow steaming for not more than 5 minutes. You can extend or shorten steaming time depending on the tenderness you prefer.",
      "When broccoli florets turn a bright green color, remove the steamer basket from heat and set aside to cool. You can season broccoli by sprinkling a little salt and pepper, adding butter or drizzling salad dressing."
    ],
    "cooking_time": "10 minutes",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/how-to-steam-broccoli/",
    "image_url": "",
    "image_path": "",
    "category": "Other Filipino Dishes"
  },
  {
    "title": "Sinigang na Bangus Belly sa Miso",
    "ingredients": [
      "▢ 2 lbs. boneless bangus belly",
      "▢ 6 tablespoons Miso paste",
      "▢ 2 medium plum tomato wedged",
      "▢ 1 medium yellow onion sliced",
      "▢ 10 pieces okra",
      "▢ 1 small Daikon radish labanos, sliced",
      "▢ 4 pieces long green pepper siling pansigang",
      "▢ 5 to 6 cups water",
      "▢ 1 bunch mustard greens",
      "▢ 2 tablespoons fish sauce patis",
      "▢ 1 40g pack sinigang mix"
    ],
    "instructions": [
      "Pour water in a cooking pot. Bring to a boil.",
      "Add tomato and onion. Cover and boil for 5 minutes.",
      "Stir-in Miso paste and cover the pot. Cook for another 3 to 5 minutes",
      "Carefully add the bangus belly. Cook for 5 to 7 minutes in low to medium heat.",
      "Add the Daikon, okra, and green peppers. Cover and Cook for 5 to 8 minutes.",
      "Pour the contents of the sinigang mix package in the cooking pot. Stir. Add fish sauce.",
      "Add the mustard greens. Cover the cooking pot and continue to cook for 4 minutes.",
      "Transfer to a serving bowl. Serve.",
      "Share and enjoy!"
    ],
    "cooking_time": "35 minutes",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/sinigang-na-bangus-belly-sa-miso/",
    "image_url": "",
    "image_path": "",
    "category": "Seafood"
  },
  {
    "title": "Apan – Apan Recipe (Adobong Kangkong with Fried Pork)",
    "ingredients": [
      "▢ Leaves from 1 large bunch of kangkong water spinach",
      "▢ ¼ lb. Tulapho crispy fried pork",
      "▢ 6 cloves garlic crushed",
      "▢ 1 medium onion diced",
      "▢ 3 tablespoons bagoong alamang or guinamos",
      "▢ 5 tablespoons coconut vinegar",
      "▢ 2 tablespoons soy sauce",
      "▢ Salt and pepper to taste",
      "▢ 3 tablespoons cooking oil"
    ],
    "instructions": [
      "Heat the oil in a large wok or pan.",
      "Add the garlic and cook until brown.",
      "Stir-in the onion; continue to cook until soft.",
      "Add the crispy fried pork. Saute for a minutes.",
      "Stir-in the bagoong",
      "Pour-in vinegar and let boil. Stir.",
      "Add the soy sauce. Stir.",
      "Add the kangkong leaves. Toss.",
      "Sprinkle salt and pepper. Toss and make sure that all ingredients are well blended. Cook for 2 to 3 minutes.",
      "Transfer to a serving bowl. Serve.",
      "Share and enjoy!"
    ],
    "cooking_time": "23 minutes",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/apan-apan-recipe-adobong-kangkong-with-fried-pork/",
    "image_url": "",
    "image_path": "",
    "category": "Chicken Dishes"
  },
  {
    "title": "Fresh Basil and Sun Dried Tomato Spaghetti Pasta",
    "ingredients": [
      "▢ 1 lb. Spaghetti",
      "▢ 10 pieces fresh basil leaves chopped",
      "▢ ½ cup sun-dried tomato chopped",
      "▢ 8 to 12 pieces grape tomato sliced in half lengthwise",
      "▢ 3 cloves garlic minced",
      "▢ 6 tablespoons grated Parmesan cheese",
      "▢ 5 tablespoons olive oil"
    ],
    "instructions": [
      "Cook the Spaghetti according to package instructions. Set aside.",
      "Heat olive oil in a wide pan.",
      "Once the oil starts to get hot, add garlic. Cook until garlic turns light brown.",
      "Stir-in the grape tomato and cook for 20 to 30 seconds.",
      "Add the sun-dried tomato and basil. Cook for 10 to 15 seconds.",
      "Quickly add the cooked spaghetti. Toss until all ingredients are well blended.",
      "Sprinkle the Parmesan cheese on top. Toss one more time. Turn the heat off and transfer to a serving plate.",
      "Serve. Share and enjoy your simple yet delicious pasta."
    ],
    "cooking_time": "30 minutes",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/fresh-basil-and-sun-dried-tomato-spaghetti-pasta/",
    "image_url": "",
    "image_path": "",
    "category": "Other Filipino Dishes"
  },
  {
    "title": "Tulapho Recipe (Crispy Fried Pork)",
    "ingredients": [
      "▢ 1 lb. pork belly sliced",
      "▢ 4 pieces dried bay leaves",
      "▢ 1 ½ tablespoons rock salt or coarse sea salt",
      "▢ ¼ teaspoon ground black pepper",
      "▢ 4 cups water"
    ],
    "instructions": [
      "Pour water in a cooking pot. Bring to a boil.",
      "Add salt, pepper, and bay leaves.",
      "Slide-in the pork and let the water re-boil. Cover and boil in medium heat until the pork gets tender. You can add more water if needed.",
      "Once the pork is tender, remove the cover. Adjust the heat to medium and then cook while stirring until the water completely evaporates.",
      "Continue to fry the pork in its own oil while constantly flipping it over until it turns golden brown.",
      "Remove the pork from the cooking pot or pan and transfer to plate with paper towel.",
      "You can serve it as it is or use it as an ingredient in other Filipino dishes. Enjoy!"
    ],
    "cooking_time": "45 minutes",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/tulapho-recipe-crispy-fried-pork/",
    "image_url": "",
    "image_path": "",
    "category": "Pork Dishes"
  },
  {
    "title": "Kinilaw na Tanigue Recipe (Fish Ceviche)",
    "ingredients": [
      "▢ 2 lbs. Tanigue Wahoo fish, fillet and cut into cubes",
      "▢ 2 thumbs fresh ginger minced",
      "▢ 8 pieces hot chili Thai chili or siling labuyo, chopped",
      "▢ 15 to 20 pieces calamansi",
      "▢ 1 medium red onion chopped into small pieces",
      "▢ ¼ teaspoon ground black pepper",
      "▢ ½ teaspoon sugar",
      "▢ Salt to taste"
    ],
    "instructions": [
      "Squeeze the juice out of the calamansi over a large bowl. Use a sieve to filter the seeds. Discard the seeds.",
      "In the bowl with calamansi juice, add sugar, ½ teaspoon salt, and ground black pepper. Stir until the sugar and salt are diluted.",
      "Add the ginger, chili, and onion. Stir for a few seconds until all ingredients are well blended.",
      "Arranged the raw fish cubes in a large bowl. Pour the calamansi mixture. Toss until the fish cubes are coated. Let is stay for 10 minutes.",
      "Toss one more time and taste. Add more salt if needed. You can also add more calamansi juice if needed. Toss to blend all the ingredients. Securely cover the bowl and place it inside the refrigerator. Let it chill for at least 3 hours.",
      "Serve. Share and enjoy!"
    ],
    "cooking_time": "3 hours",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/kinilaw-na-tanigue-recipe-fish-ceviche/",
    "image_url": "",
    "image_path": "",
    "category": "Seafood"
  },
  {
    "title": "Deep Fried Breaded Pork Chops",
    "ingredients": [
      "▢ 3 pieces pork chops",
      "▢ 2 eggs",
      "▢ 1 cup all-purpose flour",
      "▢ 1 tablespoon cornstarch",
      "▢ 1 ½ teaspoon salt",
      "▢ ¼ teaspoon ground black pepper",
      "▢ 2 to 4 cups cooking"
    ],
    "instructions": [
      "Rub salt and pepper all over the pork chops. Let it rest for 10 minutes.",
      "Pour cooking in a wide cooking pot and then apply heat.",
      "Meanwhile combine flour and cornstarch in a wide plate. Mix well.",
      "Crack the eggs in a bowl. Beat until the texture becomes smooth.",
      "Dredge a piece of pork chop in the flour mixture. Dip it on the bowl with egg making sure that every inch is covered with beaten egg. Dredge it back in the flour mixture. Once the oil is hot, slowly put the piece of pork chop in the cooking pot. Cook in medium heat for 12 to 15 minutes. Remove from the cooking pot. Let the oil drip-off and then arrange in a plate. Perform this step until all the pork chops are consumed.",
      "Serve with gravy or ketchup. Share and enjoy!"
    ],
    "cooking_time": "25 minutes",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/deep-fried-breaded-pork-chops/",
    "image_url": "",
    "image_path": "",
    "category": "Pork Dishes"
  },
  {
    "title": "Dinengdeng with Fried Fish Recipe",
    "ingredients": [
      "▢ 2 to 3 pieces medium sized fish cleaned",
      "▢ 10 pieces okra",
      "▢ 1 ½ cup squash flower",
      "▢ 3 pieces  bitter gourd ampalaya, cored and sliced",
      "▢ 10 pieces snake beans sitaw, cut into short pieces",
      "▢ 2 medium ripe plum tomato wedged",
      "▢ 2 knobs  ginger sliced",
      "▢ 1  onion wedged",
      "▢ 2 cups hot pepper leaves dahon ng sili",
      "▢ 3 cups water",
      "▢ 3 tablespoons bagoong monamon",
      "▢ 1 tablespoon salt",
      "▢ ½ cup cooking oil to fry fish"
    ],
    "instructions": [
      "Rub salt all over the fish. Heat oil in a pan. Once the oil gets hot, fry the fish until the side turns golden brown. Turn the fish over and continue to fry the other side until the same color is achieved. Remove the fried fish from the cooking pot. Place in a plate and set aside.",
      "Pour water in a clean cooking pot. Let boil.",
      "Add onion, ginger, and tomato. Cover and boil in medium heat for 5 minutes.",
      "Stir-in the bagoong. Add okra, bitter gourd, and snake beans. Cover and cook for 7 to 12 minutes.",
      "Add the hot pepper leaves and squash flower. Cook for 3 minutes.",
      "Put the fried fish top. Cover. Cook for 1 minute. Transfer to a serving bowl.",
      "Serve. Share and enjoy!"
    ],
    "cooking_time": "40 minutes",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/dinengdeng-with-fried-fish-recipe/",
    "image_url": "",
    "image_path": "",
    "category": "Seafood"
  },
  {
    "title": "Ginisang Munggo with Tinapa and Fried Red Snapper",
    "ingredients": [
      "▢ 1 cup Mung beans",
      "▢ 4 pieces Red snapper fillets",
      "▢ 1/4 cup smoked fish flakes tinapang isda",
      "▢ 1 medium onion chopped",
      "▢ 4 cloves garlic crushed",
      "▢ 1 medium plum tomato cubed",
      "▢ 3 tablespoons fish sauce",
      "▢ 1/4 teaspoon ground black pepper",
      "▢ 13 tablespoons cooking oil",
      "▢ 1 1/2 to 2 cups water for cooking",
      "▢ 4 cups water for soaking",
      "▢ 2 tablespoons coarse sea salt"
    ],
    "instructions": [
      "Pour 4 cups water in a bowl. Add the Mung beans and soak overnight. Discard the water. Set aside.",
      "Rub salt all over the Red snapper. Heat a frying pan and pour-in 10 tablespoons of cooking oil. Once the oil gets hot, fry both sides of the fish until it turns crispy. Set aside.",
      "Heat the remaining oil in a pan. Saute onion, garlic, and tomato.",
      "Add the smoked fish flakes. Cook for a minute.",
      "Add the soaked Mung beans. Stir fry for 1 to 2 minutes.",
      "Pour-in 1 1/2 to 2 cups water. Let boil. Cook low to medium heat until the Mung beans gets very tender to the point that you can mush it easily. You may add more water if needed.",
      "Add fish sauce, ground black pepper and Malunggay leaves. Continue to cook for 2 to 3 minutes.",
      "Transfer to a serving bowl. Place the crisp fried red snapper on the side.",
      "Serve with rice. Share and enjoy!"
    ],
    "cooking_time": "3 hours",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/ginisang-munggo-with-tinapa-and-fried-red-snapper/",
    "image_url": "",
    "image_path": "",
    "category": "Seafood"
  },
  {
    "title": "Seaweed Salad Recipe (Ensaladang Lato)",
    "ingredients": [
      "▢ ¼ lb. lato or sea grapes, rinsed",
      "▢ 1 large plum tomato cored and diced",
      "▢ 1 medium red onion minced",
      "▢ ¼ cup white vinegar",
      "▢ 1/8 teaspoon ground black pepper",
      "▢ ¼ teaspoon salt",
      "▢ ¼ teaspoon granulated white sugar"
    ],
    "instructions": [
      "In a bowl, combine vinegar, salt, pepper, sugar, tomato, and onion. Stir to mix.",
      "Add the lato or sea grapes. Toss. Let it stay for at last 10 minutes.",
      "Transfer to a serving bowl. Serve.",
      "Share and enjoy!"
    ],
    "cooking_time": "16 minutes",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/seaweed-salad-recipe-ensaladang-lato/",
    "image_url": "",
    "image_path": "",
    "category": "Other Filipino Dishes"
  }
]