[
  {
    "title": "Classic Beef with Broccoli Recipe",
    "ingredients": [
      "▢ 1 pound beef sirloin sliced thinly",
      "▢ 4 cups broccoli florets",
      "▢ ½ teaspoon salt",
      "▢ 2 tablespoons water",
      "▢ 2 teaspoons sesame seeds",
      "▢ 3 tablespoons cooking oil",
      "▢ 1 teaspoon garlic minced",
      "▢ 1 teaspoon ginger minced",
      "▢ 2 ½ tablespoons brown sugar",
      "▢ 2 tablespoons Shaoxing cooking wine",
      "▢ 5 tablespoons soy sauce",
      "▢ 3 teaspoons cornstarch",
      "▢ 1 tablespoon oyster sauce",
      "▢ 1 teaspoon sesame oil",
      "▢ 1/4 teaspoon ground black pepper"
    ],
    "instructions": [
      "Sprinkle salt all over the beef, mix well, and set it aside. Combine all the sauce ingredients in a bowl, mixing thoroughly, then set the mixture aside.1 teaspoon garlic, 1 teaspoon ginger, 2 ½ tablespoons brown sugar, 2 tablespoons Shaoxing cooking wine, 5 tablespoons soy sauce, 3 teaspoons cornstarch, 1 tablespoon oyster sauce, 1 teaspoon sesame oil, 1/4 teaspoon ground black pepper, 1 pound beef sirloin",
      "Heat 1 tablespoon of cooking oil in a pan, stir-fry the broccoli for 20 seconds, add 2 tablespoons of water, cover the pan, and steam the broccoli until the water completely evaporates.4 cups broccoli florets",
      "Transfer the cooked broccoli to a serving bowl and set it aside.",
      "Heat the remaining cooking oil in the pan, stir-fry the beef until it turns light brown.",
      "Now, grab your sauce mixture and stir it once more to ensure all ingredients are well blended, then pour it into the pan.",
      "Gently stir and reduce the heat to a simmer, continuing to cook while stirring until the sauce thickens.",
      "Add the broccoli and stir to coat it with the sauce, then top with toasted sesame seeds.",
      "Transfer everything to a serving plate and serve with fried rice.",
      "Share and enjoy!"
    ],
    "cooking_time": "35 minutes",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/classic-beef-with-broccoli-recipe/",
    "image_url": "",
    "image_path": "",
    "category": "Other Filipino Dishes"
  },
  {
    "title": "How to Make Cornbread for Beginners",
    "ingredients": [
      "▢ 1 cup cornmeal",
      "▢ 1 cup flour",
      "▢ 1 tablespoon baking powder",
      "▢ ½ teaspoon of salt",
      "▢ ¼ cup sugar white",
      "▢ ¼ cup honey",
      "▢ 1 cup half and half",
      "▢ ¼ cup butter melted",
      "▢ 2 whole eggs beaten"
    ],
    "instructions": [
      "In one bowl, combine the dry ingredients: corn meal, flour, baking powder and salt. In another separate bowl, combine the wet ingredients: sugar, honey, half and half, butter and eggs.",
      "Pour the wet mixture into the dry, flour mixture. Mix only until the flour is moist, not more than 15 seconds. The resulting batter should be moist and lumpy.",
      "Pour the batter into a greased baking pan. Bake at 400 F for half an hour or until you can insert a chopstick or toothpick in the cornbread and it comes out clean. Serve."
    ],
    "cooking_time": "45 minutes",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/how-to-make-cornbread/",
    "image_url": "",
    "image_path": "",
    "category": "Other Filipino Dishes"
  },
  {
    "title": "Inihaw na Isaw ng Baboy (BBQ Pork Intestine)",
    "ingredients": [
      "▢ 3 lbs. pig's large intestine",
      "▢ 3 tablespoons coarse sea salt",
      "▢ 1 teaspoon cumin",
      "▢ 1/2 teaspoon garlic powder",
      "▢ 1/4 teaspoon cayenne pepper powder",
      "▢ 1/2 cup vinegar",
      "▢ 1/4 teaspoon ground black pepper",
      "▢ 4 thumbs ginger",
      "▢ 1 quart water",
      "▢ 8 pieces dried bay leaves",
      "▢ 1 tablespoon whole peppercorn"
    ],
    "instructions": [
      "Clean the intestines well. Make sure to wash it with running water especially the inside part. Set aside.",
      "Pour water and vinegar in a large cooking pot. Add ginger, whole peppercorn, bay leaves, and 2 tablespoons salt. Bring to a boil.",
      "Add the intestines. Boil for 1 hour. You can repeat the process to ensure that the intestines smell less pungent. However, make sure to discard the initial water used, and add a new set of ingredients for boiling.",
      "Remove the intestine from the cooking pot. Let the excess water drip. Slice crosswise into smaller pieces.",
      "Arrange the intestines in a bowl. Add 1 tablespoon salt, cumin, garlic powder, ground black pepper, and cayenne pepper powder. Mix well. Cover the bowl and refrigerate overnight.",
      "Skewer the intestine slices using a bamboo skewer.",
      "Heat-up your grill. Grill each side for 3 minutes. Repeat the process until the isaw or intestines are fully cooked. Baste continuously with a mixture of sugar, banana ketchup, soy sauce, vinegar, and oil.",
      "Serve with spicy vinegar. Enjoy!"
    ],
    "cooking_time": "1 hour",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/inihaw-na-isaw-ng-baboy/",
    "image_url": "",
    "image_path": "",
    "category": "Pork Dishes"
  },
  {
    "title": "Oven Roasted Pork Belly",
    "ingredients": [
      "▢ 1 slab 2 pounds pork belly",
      "▢ 3 tablespoons Shaoxing cooking wine",
      "▢ 1 tablespoon coarse sea salt or coarse rock salt",
      "▢ 1/2 teaspoon 5 spice powder",
      "▢ 1/2 teaspoon black pepper powder",
      "▢ 1 cup coarse sea salt to spread over the skin during baking"
    ],
    "instructions": [
      "Clean the slab of pork belly and lay flat on a large plate with skin part facing down.",
      "Pour the Shaoxing cooking wine over and spread.",
      "Sprinkle salt all over the pork belly. Rub on the meat and ensure that it is well distributed.",
      "Rub the five spice powder all over the meat part of the pork belly.",
      "Lastly, rub the black pepper powder the same way as the previous ingredient.",
      "Turn the belly over. The skin should be facing up. Cover and seal using a cling wrap. Refrigerate for 6 to 8 hours.",
      "Remove from the fridge. Remove the wrap and arrange in a baking tray with aluminum foil. Fold the sides of the foil until it almost sticks to the belly.",
      "Using a sharp tool such as a metal skewer or a knife, poke holes on the skin. Make sure that the holes that you create only extends up to the fat part. Do not make it deeper.",
      "Pour 1 cup salt over the skin. Spread.",
      "Heat the oven to 390F. Roast the pork belly for 50 to 60 minutes.",
      "Remove the roast pork from the oven. Scrape the salt off the skin. Place the pork belly on a grill rack and arrange it over the same baking pan.",
      "Set your oven to broil. Broil for 15 to 20 minutes or until the skin gets really crispy.",
      "Remove from the oven. Slice and serve with rice.",
      "Share and enjoy!"
    ],
    "cooking_time": "2 hours",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/roasted-pork-belly/",
    "image_url": "",
    "image_path": "",
    "category": "Pork Dishes"
  },
  {
    "title": "Sinabawang Isda at Gulay",
    "ingredients": [
      "▢ 2 3 oz. mahi mahi fillets",
      "▢ 3 to 4 cups fresh kamote tops",
      "▢ 1 knob ginger sliced into thin pieces",
      "▢ 2 medium tomatoes sliced",
      "▢ 1 medium red onion sliced",
      "▢ 2 cups water",
      "▢ 1 teaspoon sea salt"
    ],
    "instructions": [
      "Pour water in a cooking pan.Let boil.",
      "Add the tomatoes, ginger, and onion. Cover and boil for 5 to 8 minutes.",
      "Add the fresh mahi-mahi. Cover and cook for 8 to 10 minutes in medium heat.",
      "Stir-in the salt and add the kamote tops. Cover and cook for 1 to 2 minutes.",
      "Transfer to a serving bowl. Serve with warm white rice.",
      "Share and enjoy!"
    ],
    "cooking_time": "22 minutes",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/sinabawang-isda-at-gulay/",
    "image_url": "",
    "image_path": "",
    "category": "Vegetable Dishes"
  },
  {
    "title": "Ginataang Yellow Fin Tuna",
    "ingredients": [
      "▢ 3 fillets yellow fin tuna pan fried for 1 minute per side",
      "▢ 1 cup ampalaya leaves",
      "▢ 2 1/2 cups coconut cream",
      "▢ 2 thumbs ginger julienne",
      "▢ 1 medium red onion diced",
      "▢ 5 cloves garlic crushed and chopped",
      "▢ 4 tablespoons cooking oil",
      "▢ 2 tablespoons fish sauce",
      "▢ 1/8 teaspoon ground black pepper",
      "▢ 1/2 teaspoon chili flakes"
    ],
    "instructions": [
      "Heat oil in a pan.",
      "Saute garlic and onion.",
      "Add ginger and continue to cook until the onion gets soft.",
      "Pour-in coconut cream. Stir and let boil.",
      "Add the ground black pepper and fish sauce. Stir and cook for 1 minute.",
      "Put the fried yellow fin tuna fillet in the pan. Scoop some coconut cream on top while cooking. Cover and cook in low to medium heat for 12 minutes.",
      "Add the ampalaya leaves. Stir cover and cook for 3 minutes.",
      "Add red pepper flakes or fresh siling labuyo.",
      "Transfer to a serving plate. Serve.",
      "Share and enjoy!"
    ],
    "cooking_time": "30 minutes",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/ginataang-yellow-fin-tuna/",
    "image_url": "",
    "image_path": "",
    "category": "Seafood"
  },
  {
    "title": "Adobong Baboy with Boiled Eggs",
    "ingredients": [
      "▢ 1 lb. pork shoulder cut into cubes",
      "▢ 2 pieces medium boiled eggs",
      "▢ 3 pieces dried bay leaves",
      "▢ 1 teaspoon whole peppercorn",
      "▢ 1/2 cup light soy sauce",
      "▢ 2 tablespoons white vinegar",
      "▢ 4 cloves garlic crushed",
      "▢ 3 tablespoons cooking oil",
      "▢ 3/4 cup beef broth",
      "▢ 3/4 cup water",
      "▢ 1 teaspoon granulated white sugar",
      "▢ Salt to taste optional"
    ],
    "instructions": [
      "Combine pork and soy sauce in a bowl. Mix well. Marinate for 1 hour.",
      "Heat oil in a pan. Add the garlic. Cook until gold brown. Remove the garlic and set aside.",
      "Add the marinated pork along with the remaining marinade. Cook until it turns brown (around 3 to 4 minutes).",
      "Pour-in water and beef broth. Let boil.",
      "Add the peppercorn, bay leaves, and garlic. Cover and cook in ow to medium heat for 30 to 40 minutes or until the pork becomes tender. You can add more water if the liquid starts to dry out.",
      "Add the vinegar. Let the liquid boil again. Stir.",
      "Add sugar and boiled eggs. Cook for 3 to 5 minutes. You can add salt, if necessary.",
      "Transfer to a serving bowl. Serve.",
      "Share and enjoy!"
    ],
    "cooking_time": "50 minutes",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/adobong-baboy-with-boiled-egg/",
    "image_url": "",
    "image_path": "",
    "category": "Chicken Dishes"
  },
  {
    "title": "Fruit Cocktail Float",
    "ingredients": [
      "▢ 16 oz. 473 ml cold heavy whipping cream",
      "▢ 7.6 oz. 225 ml table cream or all purpose cream",
      "▢ 2 15.25 oz. cans of fruit cocktail",
      "▢ 9 tablespoons condensed milk",
      "▢ 1 teaspoon vanilla extract",
      "▢ 12 pieces Graham crackers",
      "▢ 8 to 10 pieces Maraschino cherries",
      "▢ 3 tablespoons crushed Graham"
    ],
    "instructions": [
      "Drain the fruit cocktail by pouring each can in a strainer. Set aside.",
      "Prepare the whipping cream mixture by pouring the heavy whipping cream in a mixing bowl. Whisk in medium speed using an electric mixer. Set to high speed after 2 minutes and continue to whisk until soft peaks form (around 5 more minutes).",
      "Stir-in the table cream, condensed milk, and vanilla extract. Continue to whisk for 1 to 2 minutes.",
      "Arrange a layer of Graham crackers at the bottom of a wide 8x8 baking pan.",
      "Pour-in half of the whipping cream mixture. Spread.",
      "Create another layer by adding half of the fruit cocktail. Spread.",
      "Make another layer of Graham crackers. Top with the remaining heavy cream mixture.",
      "Arrange the remaining fruit cocktail on top and add some cherries.",
      "Sprinkle the crushed Graham on top.",
      "Refrigerate for 3 to 5 hours. Serve.",
      "Share and enjoy!"
    ],
    "cooking_time": "21 minutes",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/fruit-cocktail-float/",
    "image_url": "",
    "image_path": "",
    "category": "Other Filipino Dishes"
  },
  {
    "title": "Slow Cook Pork Afritada",
    "ingredients": [
      "▢ 2 lbs. pork shoulder sliced into cubes",
      "▢ 1 medium red bell pepper cut into squares",
      "▢ 1 can 14.5 oz. diced tomato",
      "▢ 3 tablespoons tomato paste",
      "▢ 1 medium yellow onion minced",
      "▢ 1 teaspoon minced garlic",
      "▢ 3 pieces dried bay leaves",
      "▢ 1 beef cube",
      "▢ 1/2 cup water",
      "▢ 1 large baking potato cubed",
      "▢ 3 tablespoons cooking oil.",
      "▢ salt and pepper to taste"
    ],
    "instructions": [
      "Heat oil in a pan.",
      "Once the oil gets hot, sear the pork for 2 to 4 minutes until brown.",
      "Arrange the seared pork in a slow cooker and add all the ingredients except for the salt and pepper in a slow cooker. Cover and slow cook in high mode for 4 hours (if you have time, set it to low and slow cook for 8 hours).",
      "Remove the cover. Gently stir the mixture and add salt and ground black pepper as necessary.",
      "Serve with warm rice. Share and enjoy!"
    ],
    "cooking_time": "4 hours",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/slow-cook-pork-afritada/",
    "image_url": "",
    "image_path": "",
    "category": "Chicken Dishes"
  },
  {
    "title": "Pinoy Beefsteak",
    "ingredients": [
      "▢ 2 lbs. beef skirt steak",
      "▢ 6 tablespoons soy sauce",
      "▢ 1 lemon",
      "▢ 1 teaspoon garlic powder",
      "▢ 2 medium yellow onions sliced crosswise",
      "▢ 1 cup water",
      "▢ 1 piece beef bouillon",
      "▢ 1 teaspoon granulated white sugar",
      "▢ 3 tablespoons cooking oil",
      "▢ salt and pepper to taste"
    ],
    "instructions": [
      "Slice the beef into serving pieces.",
      "Arrange the beef in a bowl. Pour the soy sauce and squeeze the lemon juice. Mix the ingredients and marinate for 1 hour.",
      "Heat the oil in a pan.",
      "Pan fry the marinated beef in medium heat for 1 to 1 1/2 minutes per side.",
      "On the same pan,pour-in the remaining marinade (soy sauce and lemon mixture used to marinate the beef). Add water and garlic powder. Let boil.",
      "Add the beef bouillon (also known as beef cube) and then stir. Cover the pan and cook in low to medium heat for 30 to 45 minutes. Cook longer if needed, but make sure to add more water to ensure that the mixture do not get dry.",
      "Add sugar, onion, salt, and ground black pepper. Stir and cook for 5 to 7 minutes. Note: make sure that there is still some sauce left before serving. If the there is not enough, add a bit of water or beef broth and cook for 5 more minutes before serving.",
      "Transfer to a serving plate. Serve.",
      "Share and enjoy!"
    ],
    "cooking_time": "1 hour",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/beefsteak/",
    "image_url": "",
    "image_path": "",
    "category": "Other Filipino Dishes"
  },
  {
    "title": "Ginataang Mais at Monggo",
    "ingredients": [
      "▢ 6 cups coconut milk",
      "▢ 3/4 cups sweet rice malagkit",
      "▢ 1 cup toasted mung beans cracked",
      "▢ 1 cup sweet corn",
      "▢ 1 cup granulated white sugar",
      "▢ 1 teaspoon vanilla extract",
      "▢ 1/4 teaspoon salt optional"
    ],
    "instructions": [
      "Pour the coconut milk in a cooking pot. Let boil.",
      "Stir-in the sweet rice (also known as glutinous rice). Cook for 5 minutes in medium heat while stirring every minute.",
      "Add the toasted mung beans. Stir and cook for 6 to 8 minutes.",
      "Stir the corn in the pot. Continue to cook while constantly stirring for 8 to 10 minutes.",
      "Add the sugar stir.",
      "Pour-in the vanilla extract. Stir and cook until the mung beans are soft. Add salt, if preferred.",
      "Transfer to a serving bowl. Serve hot.",
      "Share and enjoy!"
    ],
    "cooking_time": "40 minutes",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/ginataang-mais-at-monggo-recipe/",
    "image_url": "",
    "image_path": "",
    "category": "Other Filipino Dishes"
  },
  {
    "title": "Nilagang Litid ng Baka",
    "ingredients": [
      "▢ 2 lbs. beef shoulder bones with tendons",
      "▢ 1/2 small cabbage core removed and quartered",
      "▢ 1/2 tablespoon whole peppercorn",
      "▢ 2 large potato peeled and quartered",
      "▢ 1 medium onion wedged",
      "▢ 2 tablespoons fish sauce",
      "▢ 6 to 8 cups water",
      "▢ 2 cups beef broth optional"
    ],
    "instructions": [
      "Pour water and beef broth in a soup pot. Let boil",
      "Add the whole peppercorn and onion. Boil for 5 minutes.",
      "Put the beef shoulder bones in the pot. Cover and then let the liquid return to a boil. Adjust the heat between low to medium. Cook for 60 to 120 minutes.",
      "Once the tendons are tender (this has a tendency to slip-off the bones), add the potato and cabbage. Cook for 5 minutes.",
      "Add the fish sauce. Adjust the taste by adding more if needed. Cook for 5 more minutes.",
      "Transfer to a serving bowl. Serve with a saucer of spicy fish sauce with lemon and a cup of rice on the side.",
      "Share and enjoy!"
    ],
    "cooking_time": "1 hour",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/nilagang-litid-ng-baka/",
    "image_url": "",
    "image_path": "",
    "category": "Soups And Stews"
  }
]