[
  {
    "title": "Inasal",
    "ingredients": [
      "▢ 5 pieces chicken leg quarter",
      "▢ 4 tablespoons Knorr Liquid Seasoning",
      "▢ 5 thumbs ginger crushed",
      "▢ 6 cloves garlic crushed",
      "▢ ½ cup white vinegar",
      "▢ 2 cups lemon or lime soda",
      "▢ 2 stalks lemongrass",
      "▢ ½ cup annatto seeds",
      "▢ 4 tablespoons cooking oil",
      "▢ ¼ teaspoon turmeric powder",
      "▢ ½ cup margarine",
      "▢ ½ piece lime"
    ],
    "instructions": [
      "Chop the lemongrass and crush. Combine all marinade ingredients in a large bowl. Stir and let it stay for 10 minutes.",
      "Arrange chicken in large resealable bags. Use more bags if needed. Pour marinade into each bag equally. Push the air out of the bag and seal. Marinate overnight inside the refrigerator.",
      "Prepare the basting sauce by making annatto oil. Combine annatto seeds and 4 tablespoons cooking oil in a saucepan. Heat and continue to cook until the oil sizzles. Turn the heat off and stir until the oil turns red. Filter the oil from the seed.",
      "Combine annato oil with margarine, turmeric powder, and lime. You may also add some salt preferred.",
      "Heat-up the grill. Start grilling the chicken pieces for 2 minutes, and then turnover to grill the opposite side. Brush basting sauce everytime the chicken is flipped. Do this using medium heat to prevent the skin from burning. If the heat is uncontrollable, remove skin before grilling to prevent it from burning. Note: The chicken is cooked when the internal temperature is at least 165F.",
      "Arrange your chicken inasal on a plate and serve with your favorite dipping sauce. Share and enjoy!"
    ],
    "cooking_time": "3 hours",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/inasal/",
    "image_url": "",
    "image_path": "",
    "category": "Chicken Dishes"
  },
  {
    "title": "Beef Pares Recipe",
    "ingredients": [
      "▢ 2 ½ lbs. beef cubed",
      "▢ 1 piece Knorr Beef Cube",
      "▢ 2 pieces star anise",
      "▢ ¼ cup brown sugar",
      "▢ ½ cup scallions chopped",
      "▢ 2 thumbs ginger minced",
      "▢ 6 tablespoons soy sauce",
      "▢ 1 piece onion chopped",
      "▢ 5 cloves garlic crushed",
      "▢ 2 ½ cups water",
      "▢ 3 tablespoons cooking oil",
      "▢ Salt and ground black pepper to taste"
    ],
    "instructions": [
      "Heat oil in a cooking pot or pressure cooker. Saute onion, garlic, and ginger.",
      "Add the beef once onion softens. Cook until light brown.",
      "Pour soy sauce and water. Stir.",
      "Add Knorr Beef Cube and star anise. Cover the pressure cooker and pressure cook for 15 minutes.",
      "Add brown sugar and season with salt and ground black pepper. Cook for 8 to 10 minutes more or until the sauce reduces a bit.",
      "Top with chopped scallions and serve with sinangag and beef stock. Share and enjoy."
    ],
    "cooking_time": "55 minutes",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/filipino-food-how-to-cook-beef-pares-recipe/",
    "image_url": "",
    "image_path": "",
    "category": "Rice Dishes"
  },
  {
    "title": "Taho Recipe",
    "ingredients": [
      "▢ 22 ounces soft silken tofu",
      "▢ 3/4 cup sago pearls Note 1",
      "▢ 4 1/2 cups water",
      "▢ 3/4 cup brown sugar",
      "▢ 3/4 cup water",
      "▢ 1 teaspoon vanilla extract"
    ],
    "instructions": [
      "Pour 5 cups of water in a cooking pot and bring to a boil.",
      "Add the sago pearls. Boil for 3 to 6 minutes. Reduce the heat to low setting, continue boiling for 5 to 10 minutes.",
      "Drain the hot water by filtering the sago using a kitchen strainer. Put the sago pearls in a bowl with warm water and let it stay until needed.",
      "Make the arnibal by boiling 3/4 cup water in a saucepan. Add the brown sugar. Stir. Add the vanilla extract. Turn the heat off. Set aside.",
      "Transfer the extra soft tofu in a bowl. Microwave it for 2 1/2 minutes.",
      "Arrange the soft tofu in individual cups. Top with sago pearls and pour arnibal (syrup) on top.",
      "Serve warm. Share and Enjoy"
    ],
    "cooking_time": "50 minutes",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/filipino-street-food-homemade-taho-recipe/",
    "image_url": "",
    "image_path": "",
    "category": "Street Food"
  },
  {
    "title": "Pancit Canton Recipe",
    "ingredients": [
      "▢ 250 grams flour stick noodles",
      "▢ 4 ounces pork thinly sliced",
      "▢ 1 piece Chinese sausage sliced",
      "▢ 1 piece onion sliced",
      "▢ 1 teaspoon garlic minced",
      "▢ 8 to 10 pieces shrimp shell removed",
      "▢ 10 to 12 pieces snap peas",
      "▢ 3/4 cup carrot julienne",
      "▢ 1 piece cabbage small, chopped",
      "▢ 1 1/2 cups chicken broth",
      "▢ 1 tablespoon oyster sauce opional",
      "▢ 3 tablespoons soy sauce",
      "▢ 3/4 cup water",
      "▢ 1/2 cup flat leaf parsley chopped",
      "▢ 3 tablespoons cooking oil",
      "▢ Salt and pepper to taste"
    ],
    "instructions": [
      "Place 2 cups of ice and 3 cups water in a large bowl. Set aside.",
      "Boil 6 cups of water in a cooking pot.",
      "Once the water starts to boil, blanch the snap peas, carrots, and cabbage for 35 to 50 seconds. Quickly remove the vegetables and immerse in bowl with ice cold water. Drain the water after 2 minutes and set aside.",
      "Heat a large wok or cooking pot and pour-in the cooking oil.",
      "Saute the onion and garlic.",
      "Add the pork and sausage slices and continue to cook for 2 minutes.",
      "Add-in soy sauce and oyster sauce. Stir.",
      "Pour-in chicken broth and water. Add salt and pepper. Let boil. continue to cook for 5 to 10 minutes.",
      "Put-in the shrimp and parsley. Cook for 3 minutes. Add more water if needed.",
      "Put-in the flour noodles. Gently toss until the noodles absorb the liquid.",
      "Add-in the blanched vegetables. Toss and cook for 1 to 2 minutes.",
      "Transfer to a serving plate. Serve.",
      "Share and enjoy!"
    ],
    "cooking_time": "45 minutes",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/pancit-canton-recipe/",
    "image_url": "",
    "image_path": "",
    "category": "Noodles"
  },
  {
    "title": "Chicken Pancit Recipe",
    "ingredients": [
      "▢ 1 1/2 lbs. chicken with bones and skin on",
      "▢ 1/2 lb. bihon noodles rice sticks",
      "▢ 1/2 lb. sotanghon noodles green bean thread",
      "▢ 1/2 piece cabbage chopped",
      "▢ 2 piece carrots julienne",
      "▢ 1 tablespoon garlic minced",
      "▢ 1/2 cup flat leaf parsley chopped",
      "▢ 1 piece onion sliced",
      "▢ 3 stalk celery or celery heart, chopped",
      "▢ 6 cups water",
      "▢ 1/2 cup soy sauce",
      "▢ 1/2 teaspoon ground black pepper",
      "▢ 2 tablespoons cooking oil"
    ],
    "instructions": [
      "Pour 6 cups of water in a cooking pot. Let boil. Put-in the chicken and boil for 30 minutes.",
      "Remove the boiled chicken from the cooking pot. Let it cool down. Shred the meat and discard the bones. Set aside. Note: do not throw the water yet, we will use it later as chicken stock.",
      "Meanwhile, soak the sotanghon and bihon noodles in water for 10 minutes. Set aside. Note: do this by using a large mixing bowl and fill it with tap water.",
      "Heat a large pan. Pour-in 2 tablespoons cooking oil.",
      "Let the oil get hot then stir-fry the cabbage and carrots for 3 to 5 minutes. Remove from the pan and set aside.",
      "On the same pan, heat the remaining cooking oil. Once the oil becomes smoking hot, saute the onion, celery, and garlic.",
      "Add the ground black pepper and shredded chicken. Cook for 3 to 5 minutes.",
      "Pour-in soy sauce and 1 cup of chicken stock (this is the water that was used to boil the chicken). Stir and let boil. Cook for 2 minutes more.",
      "Add the soaked noodles. Toss the noodles until all the ingredients are well blended. If the noodles is somewhat dry, add a cup of chicken stock and continue to toss until the liquid is absorbed.",
      "Put-in the stir-fried cabbage and carrots. Toss.",
      "Transfer to a serving plate. Serve with lemon or calamansi.",
      "Share and enjoy!"
    ],
    "cooking_time": "55 minutes",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/chicken-pancit-medley/",
    "image_url": "",
    "image_path": "",
    "category": "Noodles"
  },
  {
    "title": "Pork Adobo in Pineapple Juice with Boiled Egg",
    "ingredients": [
      "▢ 3 lbs. pork belly sliced into cubes",
      "▢ 1 piece Knorr Pork Cube",
      "▢ 1 cup pineapple juice",
      "▢ 6 pieces eggs",
      "▢ 1 head garlic crushed",
      "▢ ½ cup soy sauce",
      "▢ 1 ½ teaspoons whole peppercorn",
      "▢ 6 pieces bay leaves dried",
      "▢ 3 tablespoons vinegar",
      "▢ 1 ½ tablespoons dark brown sugar",
      "▢ 2 cups water"
    ],
    "instructions": [
      "Combine pork, pineapple juice, and soy sauce in a bowl. Mix well. Cover the bowl and marinate the pork for at least 1 hour.",
      "Start to boil the eggs by placing in a cooking pot with water. Turn on the heat and bring to a rapid boil. Turn the heat off when the water starts to boil rapidly. Let the egg stay submerged in hot water for 10 minutes. Discard the hot water and pour-in cold water right away to stop the eggs from cooking through residual heat. Add ice cubes and let it stay for 10 minutes. Peel and set aside.",
      "Cook the pork adobo by heating oil in a cooking pot. Add crushed garlic. Cook until light brown.",
      "Separate the marinade from the pork belly. Set it aside. Put pork in the pan. Cook until light to medium brown.",
      "Pour marinade into the pan. Add water. Let the mixture boil.",
      "Add Knorr Pork Cube, whole peppercorn, and dried bay leaves. Cover and cook between low to medium heat for 1 hour or until the pork is tender.",
      "Pour vinegar and add brown sugar into the pan. Stir. Turn the heat off. You can add the peeled eggs or serve it separately with the pork adobo.",
      "Share and enjoy!"
    ],
    "cooking_time": "2 hours",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/pork-adobo-in-pineapple-juice-with-boiled-egg-knr-pc/",
    "image_url": "",
    "image_path": "",
    "category": "Chicken Dishes"
  },
  {
    "title": "Creamy Chicken Sopas",
    "ingredients": [
      "▢ 12 oz. chicken breast see notes",
      "▢ ½ piece cabbage see notes",
      "▢ 3 stalks celery see notes",
      "▢ 1 piece onion see notes",
      "▢ 3 pieces hotdog see notes",
      "▢ ¾ cups carrots see notes",
      "▢ 12 oz. evaporated milk",
      "▢ 1 ½  cups elbow macaroni",
      "▢ 2 teaspoons minced garlic",
      "▢ 1 piece Knorr Chicken Cube see notes",
      "▢ 6 to 8 cups water",
      "▢ 3 tablespoons cooking oil",
      "▢ Salt and ground black pepper to taste"
    ],
    "instructions": [
      "Boil 3 cups water in a medium pot. Add the chicken breasts.6 to 8 cups water, 12 oz. chicken breast",
      "Cover and cook in medium heat for 15 to 18 minutes. You may add more water if needed.",
      "Separate the chicken from the water. Let the chicken cool down and then shred. Set both shredded chicken and water aside.",
      "Heat oil in a large soup pot. Sauté the garlic until it turns medium brown. Add onion, celery, and carrot. Continue to sauté for 2 to 3 minutes.3 stalks celery, 1 piece onion, 2 teaspoons minced garlic, 3 tablespoons cooking oil, ¾ cups carrots",
      "Add the shredded chicken. Stir and cook for 1 minute.",
      "Add the hot dog. Quickly stir and then pour the water used to boil the chicken. Also pour the remaining water. Let boil.3 pieces hotdog",
      "Add the Knorr Chicken Cube. Stir. Cover and cook for 3 to 5 minutes.1 piece Knorr Chicken Cube",
      "Put the elbow macaroni in the pot. Cook for 10 minutes.1 ½  cups elbow macaroni",
      "Add the cabbage. Stir and cook for 3 to 5 minutes. Note: you can add more water if needed.½ piece cabbage",
      "Pour the evaporated milk. Stir, let boil, cover and cook for another 3 minutes.12 oz. evaporated milk",
      "Add salt and ground black pepper to taste.Salt and ground black pepper to taste",
      "Transfer to a serving bowl. Serve.",
      "Share and enjoy!"
    ],
    "cooking_time": "1 hour",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/creamy-chicken-sopas/",
    "image_url": "",
    "image_path": "",
    "category": "Soups And Stews"
  },
  {
    "title": "Beef Kaldereta Recipe",
    "ingredients": [
      "▢ 2 lbs beef cubed",
      "▢ 3 pieces garlic cloves crushed and chopped",
      "▢ 1 piece onion finely chopped",
      "▢ 2 cups beef broth",
      "▢ 1 piece  red bell pepper sliced",
      "▢ 1 piece  green bell pepper sliced",
      "▢ 1 cup tomato sauce",
      "▢ ½ cup liver spread processed using blender",
      "▢ 1 teaspoon chili flakes",
      "▢ 3 pieces dried bay leaves",
      "▢ 2 cups potatoes sliced",
      "▢ 2 cups carrots sliced",
      "▢ 1/4 cup cooking oil",
      "▢ ⅔ cup green olives",
      "▢  salt and pepper to taste"
    ],
    "instructions": [
      "Heat the cooking oil in the cooking pot or pressure cooker.1/4 cup cooking oil",
      "Sauté the onion and garlic.1 piece onion, 3 pieces garlic cloves",
      "Add the beef. Cook for 5 minutes or until the color turns light brown.2 lbs beef",
      "Add the dried bay leaves and chili flakes or crushed pepper. Stir.3 pieces dried bay leaves, 1 teaspoon chili flakes",
      "Add the liver spread. Stir.½ cup liver spread",
      "Pour-in the tomato sauce and beef broth.1 cup tomato sauce, 2 cups beef broth",
      "Cook the beef until it becomes tender (about 30 mins if using a pressure cooker, or 1 to 2 hours if using an ordinary pot).",
      "Add potato and carrots. Cook for 8 to 10 minutes.2 cups potatoes, 2 cups carrots",
      "Put the green olives and bell peppers in the cooking pot. Stir and continue to cook for 5 minutes more.1 piece  red bell pepper, ⅔ cup green olives, 1 piece  green bell pepper",
      "Add salt and pepper to tastesalt and pepper to taste",
      "Serve Hot. Enjoy!"
    ],
    "cooking_time": "1 hour",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/beef-kaldereta/",
    "image_url": "",
    "image_path": "",
    "category": "Main Dishes"
  },
  {
    "title": "Ginisang Monggo with Dilis",
    "ingredients": [
      "▢ 1 ¼ cups mung beans soaked in water overnight",
      "▢ 4 oz. dried anchovies dilis",
      "▢ 1 piece tomato diced",
      "▢ 1 piece onion diced",
      "▢ 4 cloves garlic  crushed",
      "▢ 1 bunch spinach",
      "▢ ¼ teaspoon ground black pepper",
      "▢ 1 ½ tablespoons patis fish sauce",
      "▢ 3 cups water"
    ],
    "instructions": [
      "Heat oil on a pot.",
      "Saute garlic, onion and tomato.",
      "Once the onion gets soft, add the dried dilis. Stir and cook for a minute.",
      "Add the soaked mung beans. Saute for1 to 2 mimutes.",
      "Pour-in water. Let boil. Cook in low heat until the mung beans gets soft and mushy. Note: you can add more water if needed.",
      "Sprinkle some ground black pepper and then add fish sauce. Stir.",
      "Add the spinach. Cook for 3 minutes.",
      "Transfer to a serving bowl. Serve.",
      "Share and enjoy!"
    ],
    "cooking_time": "45 minutes",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/ginisang-monggo-with-dilis/",
    "image_url": "",
    "image_path": "",
    "category": "Vegetable Dishes"
  },
  {
    "title": "Crispy Pata Recipe",
    "ingredients": [
      "▢ 1 piece whole pig leg cleaned",
      "▢ 6 pieces dried bay leaves",
      "▢ 2 tablespoons whole peppercorn",
      "▢ 4 pieces star anise optional",
      "▢ 6 teaspoons salt",
      "▢ 2 teaspoons ground black pepper",
      "▢ 2 teaspoons garlic powder",
      "▢ 12 cups water",
      "▢ 6 cups cooking oil"
    ],
    "instructions": [
      "Pour water in a cooking pot then let boil.",
      "Put-in dried bay leaves, whole peppercorn, star anise, and 4 teaspoons of salt.",
      "Add the whole pig’s legs in the cooking pot then simmer until the leg becomes tender (about 45 to 60 minutes).",
      "Remove the tender leg from the cooking pot and set aside until the temperature goes down.",
      "Rub the leg with garlic powder, ground black pepper, and remaining salt. Let stand for 15 minutes to absorb the rub.",
      "Heat a clean large cooking pot (preferably with cover) and pour-in cooking oil.",
      "When the oil becomes hot, deep fry the rubbed pork leg. Continue cooking in medium heat until one side becomes crispy, and then cautiously flip the leg to crisp the other side. Note: Be extra careful in doing this procedure.",
      "Turn-off the heat; remove the crispy pork leg; and transfer it to a wide serving plate.",
      "Serve with atcharang papaya and soy sauce – vinegar dipping sauce.",
      "Share and enjoy!"
    ],
    "cooking_time": "1 hour",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/crispy-pata-pulutan-recipe/",
    "image_url": "",
    "image_path": "",
    "category": "Pork Dishes"
  },
  {
    "title": "Sipo Eggs Recipe",
    "ingredients": [
      "▢ 1 lb. shrimp head and shell removed and deveiened",
      "▢ 20 pieces quail eggs boiled and peeled",
      "▢ 1 piece onion minced",
      "▢ 1 teaspoon minced garlic",
      "▢ 1/4 cup butter",
      "▢ 1 tablespoon cooking oil",
      "▢ 1 1/2 cups green peas",
      "▢ 1 piece carrot cubed",
      "▢ 3/4 cup water",
      "▢ 4 ounces ham minced (optional)",
      "▢ 1 can cream of mushroom 10 oz.",
      "▢ 3/4 cup singkamas cubed",
      "▢ 1/2 cup heavy whipping cream",
      "▢ Salt and pepper to taste"
    ],
    "instructions": [
      "Melt the butter in a cooking pan.",
      "Add the cooking oil.",
      "Once the mixture becomes hot, saute the shrimp for a minute per side.",
      "Remove the shrimp and set aside.",
      "Meanwhile, saute the onion and garlic.",
      "Put-in the carrot and green peas. Add the ham (this is an optional ingredient).Cook for 3 minutes.",
      "Pour-in the water (I used water with shrimp juice in the video).Let it boil. Cook for 1 minute.",
      "Add the quail eggs and shrimp.Stir.",
      "Pour-in the cream of mushroom and table cream. Stir once more until the ingredients are well distributed.",
      "Add water chestnuts, salt and pepper.",
      "Transfer to a serving bowl.",
      "Serve. Share and enjoy!"
    ],
    "cooking_time": "37 minutes",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/sipo-eggs-recipe/",
    "image_url": "",
    "image_path": "",
    "category": "Other Filipino Dishes"
  },
  {
    "title": "Squid Ball Chop Suey",
    "ingredients": [
      "▢ 1 piece cabbage medium, chopped",
      "▢ 12 to 15 pieces squid balls",
      "▢ 2 cups snow peas",
      "▢ 2 tablespoons oyster sauce",
      "▢ 1 piece carrot sliced crosswise",
      "▢ 2 pieces red bell pepper sliced",
      "▢ 2 cups cauliflower",
      "▢ 1/4 lb chicken liver",
      "▢ 10 pieces quail eggs boiled",
      "▢ 1 cup chicken broth",
      "▢ 1 teaspoon garlic minced",
      "▢ 1 piece yellow onion sliced",
      "▢ salt and ground black pepper to taste",
      "▢ 2 tablespoons cooking oil"
    ],
    "instructions": [
      "Heat the oil in a pan.",
      "Once the oil is hot, saute the garlic and onion.",
      "Add the chicken liver. Cook for 3 to 5 minutes.",
      "Add the oyster sauce and chicken broth. Stir and let boil.",
      "Put-in the squid balls. Cover and simmer for 10 to 12 minutes.",
      "Increase the heat to medium. Sprinkle some ground black pepper. Stir.",
      "Add the carrots and cauliflower. Cook for 3 minutes.",
      "Add the snow peas and bell peppers. Toss.",
      "Put-in the cabbage. Cover and steam the vegetables for 3 to 5 minutes.",
      "Remove the cover. Gently stir the ingredients and add the quail eggs.",
      "Add salt to taste.",
      "Transfer to a serving plate. Serve.",
      "Share and enjoy!"
    ],
    "cooking_time": "45 minutes",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/squid-ball-chop-suey-recipe/",
    "image_url": "",
    "image_path": "",
    "category": "Chicken Dishes"
  }
]