[
  {
    "title": "Crema de Fruta Recipe",
    "ingredients": [
      "▢ 1 1/2 cup flour",
      "▢ 1 teaspoon baking powder",
      "▢ 8 pieces egg yolks",
      "▢ 1 3/4 cups sugar",
      "▢ 1 big can fruit cocktail about 30 ++ ounces",
      "▢ 2 tablespoons unflavored gelatin",
      "▢ 4 cups milk",
      "▢ 1/3 cup butter",
      "▢ 1 1/2 tsp vanilla extract",
      "▢ 2 1/4 cups water"
    ],
    "instructions": [
      "Make the Sponge Cake by sifting the baking powder and 1 cup flour using a flour sifter. Set aside",
      "Put 4 egg yolks in a mixing bowl and then beat until texture becomes thick.",
      "Add-in 1/2 cup sugar gradually while beating the egg",
      "Slowly add the sifted flour and baking powder mixture. Mix the ingredients thoroughly.",
      "Combine 1 cup milk, butter, and vanilla extract in a sauce pan then cook until butter melts",
      "Pour the cooked mixture (milk, butter, vanilla extract) into the mixing bowl and mix with the existing concoction until evenly distributed",
      "Preheat the oven at 350 degrees Fahrenheit",
      "Pour the combined mixtures in a baking pan then bake for 23 minutes or until sponge cake is ready. Set aside.",
      "Make the simple syrup by heating a saucepan and placing 1/4 cup sugar.",
      "Add 1/4 cup of water immediately and cook until the sugar completely dissolves then let cool for a few minutes",
      "Pour the simple syrup on top of the sponge cake and thens spread. (I spread the syrup using a brush)",
      "Make the custard by combining 1/2 cup flour, 1 cup sugar, and 3 cups milk in a saucepan then cook while stirring until the mixture thickens",
      "Put half of the cooked mixture on the bowl where the 4 egg yolks are placed and then mix well",
      "Put everything back in the saucepan with the rest of the ingredients. Mix until texture is thick enough (this is now the custard)",
      "Apply the layer of custard evenly on top of the Sponge cake",
      "Drain the liquid concentrate from the fruit cocktail and set aside.",
      "Arrange all the fruits on top of the custard layer. Make sure to place them evenly",
      "Dilute the gelatin in 2 cups of water",
      "Heat the saucepan then pour the diluted gelatin and fruit cocktail concentrate and bring to a boil",
      "Immediately after boiling, turn off the heat and let cool down until temperature is a little above normal room temperature",
      "Pour the gelatin mixture on top of the fruit cocktail layer",
      "Refrigerate (preferably overnight)",
      "Serve chilled for dessert. Share and Enjoy!"
    ],
    "cooking_time": "55 minutes",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/pinoy-noche-buena-dessert-recipe-baking-crema-de-fruta/",
    "image_url": "",
    "image_path": "",
    "category": "Other Filipino Dishes"
  },
  {
    "title": "Braised Vegetable Recipe",
    "ingredients": [
      "▢ 1/2 lb. snow peas",
      "▢ 2 cups bamboo shoots thinly sliced",
      "▢ 1/2 lb. young corn",
      "▢ 1 teaspoon garlic",
      "▢ 1/2 teaspoon ground black pepper",
      "▢ 2 1/2 cups white mushrooms sliced",
      "▢ 1 cup carrots thinly sliced",
      "▢ 1 cup onions sliced",
      "▢ 2 tablespoon soy sauce",
      "▢ 3 tablespoon oyster sauce",
      "▢ 2 tablespoon cooking oil",
      "▢ 1/2 teaspoon brown sugar optional",
      "▢ Salt to taste"
    ],
    "instructions": [
      "Blanch the snow peas then set aside",
      "In a pan, sauté the garlic and onions",
      "Add the ground black pepper then cook until the onions are soft",
      "Put in the soy sauce and oyster sauce then mix slightly",
      "Add the carrots then cook for 2 minutes",
      "Put-in the young corn and bamboo shoots then simmer for 3 minutes",
      "Add the mushrooms then simmer for 5 to 7 minutes",
      "Add salt and brown sugar to taste",
      "Put-in the blanched snow peas",
      "Serve hot. Share and Enjoy!"
    ],
    "cooking_time": "35 minutes",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/braised-vegetables/",
    "image_url": "",
    "image_path": "",
    "category": "Other Filipino Dishes"
  },
  {
    "title": "Ginataang Alimasag Recipe",
    "ingredients": [
      "▢ 3 lbs blue crabs Alimasag",
      "▢ 2 tbsp shrimp paste",
      "▢ 1 tbsp fish sauce",
      "▢ 1 tsp garlic minced",
      "▢ 1 piece onion minced",
      "▢ 1 thumb ginger cut into thin strips",
      "▢ 3 tbsp cooking oil",
      "▢ 4 cups coconut milk",
      "▢ ½ tsp ground black pepper",
      "▢ 1 bunch fresh spinach",
      "▢ 6 pieces Thai chili"
    ],
    "instructions": [
      "In a large pot, sauté the garlic, onion, and ginger",
      "Add the ground black pepper and coconut milk then bring to a boil",
      "Put-in the shrimp paste and fish sauce and cook until the coconut milk’s texture is thick and natural oil comes out of it (approximately 20 ++ minutes)",
      "Add the Thai chili and simmer for 5 minutes",
      "Put the crabs in the pot and mix until evenly covered with coconut milk. Simmer for 5 to 20 minutes. (Note: If crabs were steamed prior to cooking, 5 to 8 minutes is enough)",
      "Add the spinach and simmer for 5 minutes",
      "Serve hot. Share and Enjoy!"
    ],
    "cooking_time": "50 minutes",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/ginataang-alimasag/",
    "image_url": "",
    "image_path": "",
    "category": "Seafood"
  },
  {
    "title": "Chicharon Bituka Recipe",
    "ingredients": [
      "▢ 2 lbs. well cleaned intestine from pig or cow",
      "▢ 6 dried bay leaves",
      "▢ 3 tbsp salt",
      "▢ 1 tbsp whole pepper corn",
      "▢ 4 tbsp vinegar",
      "▢ 16 ounces water",
      "▢ 3 cups cooking oil"
    ],
    "instructions": [
      "Pour the water in a large pot and bring to a boil",
      "Add 2 tbsp salt and vinegar then let boil for another 2 minutes",
      "Place the intestine in the pot and wait until the liquid re-boils",
      "Put-in the dried bay leaves and whole pepper corn then simmer for 40 minutes or until intestine is tender.",
      "Remove the intestine from the pot then drain excess water",
      "Cut the intestine according to desired length.",
      "Sprinkle the remaining salt over the intestine. Make sure that it is evenly distributed over all the intestines.",
      "In a separate pot/pan, pour the oil and heat until the temperature is good for frying",
      "Deep fry the intestines. Make sure that the texture is crunchy before removing from the pot/pan",
      "Serve with vinegar and chili pepper dip. Share and Enjoy!"
    ],
    "cooking_time": "1 hour",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/chicharon-bituka/",
    "image_url": "",
    "image_path": "",
    "category": "Other Filipino Dishes"
  },
  {
    "title": "Coconut Macaroon Recipe",
    "ingredients": [
      "▢ 14 ounces sweet shredded coconut or desiccated coconut",
      "▢ 1/2 cup butter",
      "▢ 1/2 cup brown sugar",
      "▢ 3 pieces raw eggs",
      "▢ 14 ounces condensed milk"
    ],
    "instructions": [
      "Place the butter in a big bowl and cream using a fork",
      "Add-in the brown sugar and mix well",
      "Add the eggs and condensed milk then stir/beat until all ingredients are blended",
      "Put-in the Sweetened Shredded Coconut and distribute evenly with the other ingredient in the mixture",
      "In a mold (with paper cups if possible), place 1 tablespoon of the mixture on each of the cups",
      "Pre-heat oven at 370 degrees Fahrenheit for 10 minutes",
      "Bake the Coconut Macaroon mixture for 20 to 30 minutes or until color turns golden brown.",
      "Serve during dessert or snack time. Share and Enjoy!"
    ],
    "cooking_time": "45 minutes",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/coconut-macaroons/",
    "image_url": "",
    "image_path": "",
    "category": "Other Filipino Dishes"
  },
  {
    "title": "Recipe for Chicken Macaroni Salad",
    "ingredients": [
      "▢ 16 ounces elbow macaroni cooked",
      "▢ 1 lb boneless chicken breast boiled and cubed",
      "▢ 1 ½ cup pineapple chunks",
      "▢ 1 cup Spanish onion",
      "▢ 1 cup raisins",
      "▢ 3 hard boiled eggs chopped",
      "▢ 2 cups mayonnaise can be 1 cup mayo and 1 cup miracle whip",
      "▢ 1 ½ cup Cheddar cheese cubed",
      "▢ 2 teaspoon salt",
      "▢ 1 teaspoon pepper"
    ],
    "instructions": [
      "Cook the macaroni as directed in the package",
      "Place the macaroni in a large container",
      "Add the mayonnaise (and /or miracle whip) and mix well",
      "Put-in the minced onions and mix well",
      "Place the cheddar cheese in and mix again",
      "Now, add the chicken and distribute evenly",
      "Put-in the pineapple chunks, boiled eggs, and raisins and mix well",
      "Add salt and pepper to taste",
      "Chill inside the refrigerator for about an hour",
      "Serve chilled. Share and enjoy!"
    ],
    "cooking_time": "55 minutes",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/macaroni-salad/",
    "image_url": "",
    "image_path": "",
    "category": "Chicken Dishes"
  },
  {
    "title": "Orange Chicken Recipe",
    "ingredients": [
      "▢ 2 lbs boneless chicken breast cubed",
      "▢ 1 cup brown sugar",
      "▢ 2 cups all purpose flour",
      "▢ 1 raw egg beaten",
      "▢ 1/4 teaspoon salt",
      "▢ 1/4 teaspoon pepper",
      "▢ Cooking oil",
      "▢ 1 1/2 cup water",
      "▢ 4 tablespoons orange juice",
      "▢ 2 tbsp cornstarch",
      "▢ 1/4 cup vinegar",
      "▢ 2 tablespoons soy sauce",
      "▢ 1 teaspoon garlic minced",
      "▢ 1/2 cup green onions finely chopped"
    ],
    "instructions": [
      "In a container, put-in the flour, salt, and ground black pepper then mix well",
      "Dip the chicken on the beaten egg mixture and place inside the container (where the flour, salt, and pepper are)",
      "Close the container and shake until the chicken is evenly coated with the flour mixture",
      "Deep fry the chicken for about 7 minutes or until the color turns golden brown. Set aside",
      "In a pan, put-in the water, soy sauce, vinegar, and orange juice then bring to a boil",
      "Add the garlic and simmer for 5 minutes",
      "Add the sugar and and simmer for 3 to 5 minutes",
      "Put-in the green onions and cornstarch (diluted in 2 tbsp of water) then mix well",
      "Add the deep-fried chicken on pan and cook until sauce nearly evaporates",
      "Serve hot. Share and Enjoy!"
    ],
    "cooking_time": "40 minutes",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/orange-chicken/",
    "image_url": "",
    "image_path": "",
    "category": "Chicken Dishes"
  },
  {
    "title": "Ginisang Pechay (Sautéed Bok Choy)",
    "ingredients": [
      "▢ 1 lb. baby bok choy or pechay chopped",
      "▢ ½ lb. pork chopped and thinly sliced",
      "▢ 1 medium-sized tomato diced",
      "▢ 1 medium-sized onion chopped",
      "▢ 2 tbsp. fish sauce",
      "▢ 1 tsp garlic",
      "▢ 1 cup water"
    ],
    "instructions": [
      "Heat the pan and put-in the cooking oil",
      "Sauté the garlic, onion, and tomato",
      "Add the pork and cook for 5 minutes",
      "Put-in the fish sauce and ground black pepper",
      "Add the water and simmer for 10 to 15 minutes",
      "When the pork is tender enough, put-in the pechay or bok choy. Cook for a few seconds, turn off the heat, and wait for 5 minutes before serving.",
      "Serve hot. Share and Enjoy this delightful Vegetable dish!"
    ],
    "cooking_time": "30 minutes",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/ginisang-pechay-sauteed-bok-choy/",
    "image_url": "",
    "image_path": "",
    "category": "Vegetable Dishes"
  },
  {
    "title": "Beef Nilaga Recipe",
    "ingredients": [
      "▢ 2 lbs beef brisket cubed",
      "▢ 1 big potato cubed",
      "▢ 1 bok choy or pechay",
      "▢ 1 large onion chopped",
      "▢ 2 medium sized carrots chopped crosswise (w/ length of about 2 inches)",
      "▢ 1 tbsp whole pepper corn",
      "▢ 3 tbsp fish sauce patis"
    ],
    "instructions": [
      "Saute the onion until texture becomes soft",
      "Add-in the beef brisket and cook for about 5 minutes",
      "Add the fish sauce and whole pepper corn then mix well",
      "Pour-in the water and bring to a boil. Simmer for 1 to 2 hours (or 30 minutes if using pressure cooker)",
      "Put-in the vegetables starting with the potato and the carrots. Simmer for 5 to 7 minutes",
      "Add the bok choy (Pechay). Cover the pot and turn off the heat. Let it stay for 5 minutes.",
      "Serve hot. Share and Enjoy!"
    ],
    "cooking_time": "2 hours",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/beef-nilaga/",
    "image_url": "",
    "image_path": "",
    "category": "Soups And Stews"
  },
  {
    "title": "Homemade Beef Tapa",
    "ingredients": [
      "▢ 1 1/2 lb beef sirloin thinly sliced",
      "▢ 5 tablespoons soy sauce",
      "▢ 3 tbsp minced garlic or 1 tablespoon garlic powder",
      "▢ 2 tbsp sugar",
      "▢ 1/4 teaspoon salt",
      "▢ 1/4 teaspoon ground black pepper"
    ],
    "instructions": [
      "In a container, combine soy sauce, garlic, salt, pepper, and sugar and mix well. Set aside",
      "Place the beef in the clear plastic bag",
      "Pour-in the the mixed seasonings in the clear plastic bag with meat and mix well",
      "Place inside the refrigerator and marinate for a minimum of 12 hours",
      "In a pan, place 1 cup water and bring to a boil",
      "Add 3 tbsp of cooking oil",
      "Put-in the marinated beef tapa and cook until the water evaporates."
    ],
    "cooking_time": "12 hours",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/how-to-make-home-made-beef-tapa/",
    "image_url": "",
    "image_path": "",
    "category": "Main Dishes"
  },
  {
    "title": "Nilasing na Hipon Recipe (Drunken Shrimp)",
    "ingredients": [
      "▢ 1 lb. shrimp",
      "▢ 2 cups white wine",
      "▢ 3 cups flour",
      "▢ 1 tsp salt",
      "▢ 1 tsp ground black pepper",
      "▢ 3 cups cooking oil"
    ],
    "instructions": [
      "Marinade the shrimps in wine (or liquor) for 30 to 40 minutes",
      "Place the flour, salt, and pepper in a clear plastic bag and mix well by shaking",
      "Put the shrimps in the plastic bag and shake until all the shrimps are coated with flour",
      "In a deep pot or pan, put-in the cooking oil and deep fry the shrimps until the shrimps floats",
      "Remove from the pot and place in a plate with napkin or paper towel to absorb the excess oil",
      "Serve hot with vinegar. Share and enjoy!"
    ],
    "cooking_time": "40 minutes",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/nilasing-na-hipon/",
    "image_url": "",
    "image_path": "",
    "category": "Other Filipino Dishes"
  },
  {
    "title": "Inihaw na Pusit Recipe (Grilled Squid)",
    "ingredients": [
      "▢ 3 squid cleaned",
      "▢ 1 cup soy sauce",
      "▢ 1  tomato diced",
      "▢ 1 yellow  onion diced",
      "▢ 3 pieces  Thai chili",
      "▢ 1/2 lemon",
      "▢ Salt and ground black pepper to taste"
    ],
    "instructions": [
      "In a large container, combine onion and tomato1  tomato, 1 yellow  onion",
      "Add some salt and pepper and mix well.Salt and ground black pepper to taste",
      "Stuff the squid with the onion and tomato mixture. Add more if necessary.3 squid",
      "Grill the squid for 6 to 8 minutes per side.",
      "Transfer to a serving plate.",
      "Make the dipping sauce by combining soy sauce, chili pepper, and lemon. Stir.1 cup soy sauce, 3 pieces  Thai chili, 1/2 lemon",
      "Serve with the dipping sauce. Share and Enjoy!"
    ],
    "cooking_time": "33 minutes",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/inihaw-na-pusit-grilled-squid/",
    "image_url": "",
    "image_path": "",
    "category": "Pork Dishes"
  }
]