[
  {
    "title": "Slow Cooked Beef Lauya Soup Recipe",
    "ingredients": [
      "▢ 3 lbs. beef chuck sliced",
      "▢ 1 medium yellow onion sliced",
      "▢ 1 teaspoon whole peppercorn",
      "▢ 1 cup chopped scallions (green onions)",
      "▢ 1 teaspoon garlic powder",
      "▢ 8 cups water",
      "▢ 2 thumbs ginger sliced",
      "▢ 1 piece beef cube",
      "▢ 2 ½ tablespoons fish sauce"
    ],
    "instructions": [
      "Combine the beef chuck, peppercorns, ginger, water, garlic powder, and onion in a slow cooker.",
      "Cover the slow cooker and start to slow cook in high for 8 to 10 hours.",
      "Put-in the scallions and fish sauce. Stir and continue to slow cook for 30 minutes.",
      "Transfer to a serving bowl. Serve with a small bowl of fish sauce and lemon along with some chili flakes.",
      "Share and enjoy!"
    ],
    "cooking_time": "10 hours",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/slow-cooked-beef-lauya-soup-recipe/",
    "image_url": "",
    "image_path": "",
    "category": "Seafood"
  },
  {
    "title": "Beef and Tripe Pochero Recipe",
    "ingredients": [
      "▢ 1 lb. beef chuck cubed",
      "▢ 1 lb. ox tripe sliced into squares and cleaned",
      "▢ 6 to 8 pieces small potato",
      "▢ 1 bunch baby bok choy",
      "▢ 1 15 oz. can chickpeas, water removed",
      "▢ 1 4 oz. can tomato sauce",
      "▢ 3 cups beef broth",
      "▢ 4 pieces saba banana sliced",
      "▢ 3 pieces Chinese sausage sliced",
      "▢ 1 medium yellow onion minced",
      "▢ 1- teaspoon garlic minced",
      "▢ 1½ tablespoons fish sauce",
      "▢ ¼ teaspoon ground black pepper",
      "▢ 3 tablespoons cooking oil"
    ],
    "instructions": [
      "Heat a cooking pot then pour-in the oil.",
      "Once the oil gets hot, sauté the onion and garlic",
      "Add the ox tripe and cook for 2 minutes.",
      "Put-in the beef and sliced sausage. Continue to cook for 2 to 3 minutes or until the color of the beef turns light brown.",
      "Pour-in the beef broth and tomato sauce. Let boil.",
      "Cover and simmer for 90 minutes or until the tripe and beef are tender. Add water if needed.",
      "Once the meat gets tender, make sure that there is enough liquid left. If the sauce is a bit thick, add more beef broth or water. Put the chickpeas, banana, and potato in the cooking pot and continue to cook for 10 to 12 minutes.",
      "Add the ground black pepper and fish sauce. Stir and cook for 2 minutes.",
      "Put the bok choy in the cooking pot. Stir and cook for 3 minutes.",
      "Transfer to a serving bowl.",
      "Serve. Share and enjoy!"
    ],
    "cooking_time": "1 hour",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/beef-and-tripe-pochero-recipe/",
    "image_url": "",
    "image_path": "",
    "category": "Seafood"
  },
  {
    "title": "How to Make a Hamburger",
    "ingredients": [
      "▢ 1 – 1 ¼ lbs. quality ground beef",
      "▢ Salt and black pepper for seasoning",
      "▢ Fresh hamburger buns",
      "▢ Cheese slices optional"
    ],
    "instructions": [
      "If your ground beef is already defrosted, season the meat generously with salt and black pepper. Seasoning with kosher salt is recommended.",
      "Use your hands to separate the beef into ¾ - 1 inch thick patties. You can make them bigger but they will take longer to cook.",
      "Add a few droplets of water into a non-stick pan and add patties. Be careful not to overcrowd the patties. If they can’t fit all at once, cook in batches. Cook each side until brown. Use a meat thermometer to check the internal temperature. According to food safety organizations, patties should at least read 160F on the thermometer to be safe to eat.",
      "When patties are cooked to your liking, you can slap on a slice of cheese on each one. Let cheese melt for a minutes while the patties are still in the pan.",
      "Use a spatula to remove the beef patties from heat and serve on toasted buns with lettuce and tomato and onion slices. Enjoy."
    ],
    "cooking_time": "22 minutes",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/how-to-make-a-hamburger/",
    "image_url": "",
    "image_path": "",
    "category": "Other Filipino Dishes"
  },
  {
    "title": "Slow Cooked Beef Nilaga Soup Recipe",
    "ingredients": [
      "▢ 3 lbs. beef chuck cubed",
      "▢ 6 cups water",
      "▢ 4 pieces saba bananas sliced",
      "▢ 2 medium potatoes cubed",
      "▢ 1 1/2 teaspoons whole peppercorn",
      "▢ 1 medium yellow onion minced",
      "▢ 2 tablespoons fish sauce",
      "▢ 2 cups Napa cabbage chopped",
      "▢ 1 bunch baby bok choy",
      "▢ 1 cup sliced long green beans"
    ],
    "instructions": [
      "Combine water, beef, bananas, potato, onion, fish sauce, and whole peppercorn in a slow cooker. Set the slow cooker or crock pot to high and slow cook for 8 to 10 hours.",
      "Gently stir the mixture. Add cabbage, green beans, and bok choy. Continue to cook for 12 to 15 minutes. Add more fish sauce if necessary.",
      "Transfer to a serving bowl. Serve hot.",
      "Share and enjoy!"
    ],
    "cooking_time": "8 hours",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/slow-cooked-beef-nilaga-soup-recipe/",
    "image_url": "",
    "image_path": "",
    "category": "Soups And Stews"
  },
  {
    "title": "Slow Cook Pork Hock Stew",
    "ingredients": [
      "▢ 3 lbs. pork hock pata, sliced",
      "▢ 1 8 oz. can tomato sauce",
      "▢ 2 large potatoes cubed",
      "▢ 1 large green bell pepper sliced",
      "▢ 2 medium carrots. sliced",
      "▢ 1 piece beef cube",
      "▢ 1 cup water",
      "▢ 1 teaspoon granulated white sugar.",
      "▢ 1/4 teaspoon ground black pepper",
      "▢ 1 1/2 teaspoons garlic powder",
      "▢ 1 medium yellow onion minced",
      "▢ 3 pieces dried bay leaves",
      "▢ salt to taste"
    ],
    "instructions": [
      "Combine all the ingredients in a slow cooker. Start with the pork hocks, tomato sauce, bell pepper, tomato, carrots, and the rest of the ingredients.",
      "Cook in a slow cooker or crock pot for at least 8 hours. Add salt to taste.",
      "Remove from the slow cooker. Transfer to a serving bowl.",
      "Serve with warm white rice.",
      "Share and enjoy!"
    ],
    "cooking_time": "8 hours",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/slow-cook-pork-hock-stew/",
    "image_url": "",
    "image_path": "",
    "category": "Pork Dishes"
  },
  {
    "title": "Mahi-Mahi Paksiw Recipe",
    "ingredients": [
      "▢ 1 lb. Mahi-mahi fillet",
      "▢ 1 teaspoons salt",
      "▢ 1 teaspoon whole peppercorn",
      "▢ 2 pieces long green chili",
      "▢ 4 cloves garlic crushed",
      "▢ 1/2 to 3/4 cup coconut vinegar",
      "▢ ¾ to 1 cup water",
      "▢ ½ teaspoon sugar"
    ],
    "instructions": [
      "Rub salt all over the mahi-mahi fillet.",
      "Heat-up the grill then grill each side for 3 minutes.",
      "Meanwhile, combine water, vinegar, whole peppercorn, garlic, and sugar in a cooking pot. Let boil. Adjust the heat to low.",
      "Put-in the grilled mahi-mahi and long green chili then continue to cook (covered) for 12 to15 minutes. Add more water if needed.",
      "Transfer to a serving plate.",
      "Serve. Share and enjoy!"
    ],
    "cooking_time": "40 minutes",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/mahi-mahi-paksiw-recipe/",
    "image_url": "",
    "image_path": "",
    "category": "Pork Dishes"
  },
  {
    "title": "Crispy Spam Steak Recipe",
    "ingredients": [
      "▢ 1 12 oz. can Spam light",
      "▢ 2 pieces eggs",
      "▢ ½ cup cornstarch",
      "▢ 2 tablespoons all-purpose flour",
      "▢ ¼ teaspoon garlic powder",
      "▢ 1/2 cup cooking oil"
    ],
    "instructions": [
      "Remove the Spam luncheon meat from the can and slice into serving pieces.",
      "Meanwhile, heat the cooking oil in a deep frying pan.",
      "Combine the garlic powder and egg. Beat until both ingredients are well incorporated. Set aside.",
      "Combine flour and cornstarch. Mix well and set aside.",
      "Dip each sliced Spam in the beaten egg then dredge in flour. Do this step twice to make the coat thicker.",
      "Fry the Spam coated with flour and cornstarch 3 to 4 slices at a time. The number of slices to cook at a given time will depend on the size of your pan: the wider the pan, the more slices you can cook at the same time. Cook one side in medium heat until the color turns medium brown and the texture becomes crispy. Turn the Spam slice over to cook the other side.",
      "Remove the Crispy fried Spam steaks from then pan. Place in a plate lined with paper towel.",
      "Serve with ketchup. Share and enjoy!"
    ],
    "cooking_time": "30 minutes",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/crispy-spam-steak-recipe/",
    "image_url": "",
    "image_path": "",
    "category": "Other Filipino Dishes"
  },
  {
    "title": "Misua and Meatball Soup",
    "ingredients": [
      "▢ 1 lb. ground pork",
      "▢ 1 egg",
      "▢ 3/4 cup bread crumbs",
      "▢ 1 large patola loofah, peeled and sliced",
      "▢ 2 ounces misua noodles",
      "▢ 1 4 ounces can tomato sauce",
      "▢ 1 bunch spring onions chopped",
      "▢ 6 cloves garlic crushed",
      "▢ 1 medium yellow onion minced",
      "▢ 1 teaspoon salt",
      "▢ 2 tablespoons fish sauce",
      "▢ 1/4 teaspoon ground black pepper",
      "▢ 6 cups water",
      "▢ 1 piece beef cube",
      "▢ 6 tablespoons cooking oil"
    ],
    "instructions": [
      "Make the meatballs by combining the ground pork, bread crumbs, egg, salt, and pepper in a bowl. Mix well.",
      "Scoop about a tablespoon of the mixture and roll it into a ball shaped figure. Do this step until all the ground pork mixture is consumed.",
      "Heat 4 tablespoons of cooking oil in a pan. Pan fry the meatballs in low to medium heat until the color of the outer part turns medium brown. Remove the fried meatballs and set aside.",
      "Meanwhile, start to prepare the soup by pouring the remaining 2 tablespoons of cooking oil in a clean cooking pot.",
      "Saute the onion and garlic. Once the onion becomes soft, put-in the cooked meatballs.",
      "Pour-in the water. Let boil.",
      "Add the beef broth and tomato sauce. Let boil and simmer for 10 minutes.",
      "Pour-in the fish sauce then add the loofah and spring onions. Stir and cook for 3 minutes.",
      "Put-in the misua noodles. Cook for 2 minutes (add more water if needed).",
      "Tranfer to a serving bowl. Serve.",
      "Share and enjoy!"
    ],
    "cooking_time": "45 minutes",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/misua-and-meatball-soup/",
    "image_url": "",
    "image_path": "",
    "category": "Pork Dishes"
  },
  {
    "title": "Salisbury Steak with Beef and Mushroom Gravy",
    "ingredients": [
      "▢ 2 lbs. ground beef",
      "▢ 3/4 cups breadcrumbs",
      "▢ 3 tablespoons mustard powder",
      "▢ 1 teaspoon beef powder",
      "▢ 2 1/2 teaspoon onion powder",
      "▢ 1/2 teaspoon garlic powder",
      "▢ 1/8 teaspoon ground black pepper",
      "▢ 1/2 teaspoon salt",
      "▢ 6 tablespoons salted butter",
      "▢ 3/4 cup chopped mushroom",
      "▢ 1/4 cup all-purpose flour",
      "▢ 1 to 1 1/2 cup water",
      "▢ 3 tablespoons cooking oil"
    ],
    "instructions": [
      "Prepare the patty by combining the ground beef, breadcrumbs, mustard powder, 1 teaspoon beef powder, onion powder, garlic powder, 1/8 teaspoon ground black pepper, and 1/2 teaspoon salt in a bowl. Mix all the ingredients together. Form the meat mixture into patties.",
      "Heat the cooking oil in a pan.",
      "Once the oil becomes hot, pan-fry the burger patties in medium heat for 3 to 5 minutes per side depending on the thickness. Set aside.",
      "Prepare the gravy by melting the butter in a clean saucepan.",
      "Once the butter becomes hot, put-in the sliced mushrooms. Cook for 1 minute.",
      "Add the flour. Stir until the flour absorbs the butter and a lump is formed.",
      "Pour-in the water and 1 1/2 teaspoons beef powder. Stir well to distribute the distribute the ingredients well. Continue to cook until the gravy reaches the desired thickness. Add more water if the gravy is too thick. Add salt and pepper to taste.",
      "Arrange the cooked patties in a serving plate. Pour the beef and mushroom gravy on top.",
      "Serve. Share and enjoy!"
    ],
    "cooking_time": "45 minutes",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/salisbury-steak-with-beef-and-mushroom-gravy/",
    "image_url": "",
    "image_path": "",
    "category": "Other Filipino Dishes"
  },
  {
    "title": "Pork Adobo Flakes",
    "ingredients": [
      "▢ 1 1/2 lb. Pork Adobo sauce removed",
      "▢ 1 teaspoon minced garlic",
      "▢ 2 tablespoons cooking oil",
      "▢ a dash of ground black pepper",
      "▢ 1 tablespoon soy sauce or Worcestershire sauce",
      "▢ 4 cups garlic fried rice"
    ],
    "instructions": [
      "Shred the pork adobo meat. You can do this with your hands. Simply pull the threads of the pork slices until all the pork are consumed. Set aside.",
      "Meanwhile, heat the oil in a pan.",
      "Once the oil starts to gets hot, put-in the minced garlic. Make sure that the oil is not too hot yet so that the garlic won't burn easily. Continue to cook the garlic until the color turns light brown. Remove the garlic and set aside.",
      "Using the remaining cooking oil, start to cook the adobo threads or by putting it in the pan. Cook for 1 minute while tossing once in a while.",
      "Add the soy sauce or worcestershire sauce and ground black pepper. Stir fry for 3 minutes.",
      "Transfer the cooked pork adobo flakes in a a serving bowl and top with fried garlic.",
      "Serve with garlic fried rice. Share and enjoy!"
    ],
    "cooking_time": "15 minutes",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/pork-adobo-flakes/",
    "image_url": "",
    "image_path": "",
    "category": "Chicken Dishes"
  },
  {
    "title": "Pork Tapa with Fried Banana and Salted Egg",
    "ingredients": [
      "▢ 2 lbs. pork shoulder sliced",
      "▢ 4 pieces saba banana sliced in half lengthwise",
      "▢ 4 pieces salted eggs",
      "▢ 3/4 cup white vinegar",
      "▢ 1/2 teaspoon salt",
      "▢ 1 teaspoon granulated white sugar",
      "▢ 1/4 teaspoon ground black pepper",
      "▢ 4 cloves garlic crushed and minced",
      "▢ 1/4 cup corn starch",
      "▢ 1/2 cup cooking oil",
      "▢ 4 cups cooked white rice"
    ],
    "instructions": [
      "Combine vinegar, sugar, salt, and pepper in a large bowl. Stir the mixture to blend completely.",
      "Put-in the sliced pork. Make sure that the pork slices gets coated with the vinegar mixture. Marinate for at least 3 hours (the longer the you marinate, the tastier it gets).",
      "Remove the pork slices from the marinade. Arrange in a wide plate and let it stay in open air for 1 to 2 hours. You can also soak this under the sun for the same time if desired, but make sure to cover the meat to avoid contamination. I use either cling wrap or a strainer to cover the plate.",
      "Heat half of the cooking oil in a pan.",
      "Meanwhile, roll the sliced bananas in cornstarch. Make sure that the bananas are coated all over. The cornstarch will give a nice crisp texture to the outer part of the banana when fried.",
      "Once the oil gets hot, fry the bananas in medium heat for 1 to 2 minutes per side. Remove the fried banana from the pan and place in a plate lined with paper towels.",
      "Add more oil if needed then continue by frying the pork slices until it turns medium brown.",
      "Remove the fried pork slices from the pan. Arrange a single serving portion in a plate along with a cup of white rice and salted egg. Put-in the fried banana.",
      "Serve with a spicy vinegar dip.",
      "Share and enjoy!"
    ],
    "cooking_time": "1 hour",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/pork-tapa-with-fried-banana-and-salted-egg/",
    "image_url": "",
    "image_path": "",
    "category": "Main Dishes"
  },
  {
    "title": "Sirloin Tip Roast Recipe",
    "ingredients": [
      "▢ 3 lbs. sirloin tip roast",
      "▢ 1 tablespoon dried rosemary",
      "▢ 1 tablespoon dried thyme",
      "▢ 1 tablespoon dried oregano",
      "▢ 1 teaspoon garlic powder",
      "▢ 1 teaspoon sea salt",
      "▢ ¼ teaspoon ground black pepper",
      "▢ 1 teaspoon paprika",
      "▢ 3 tablespoons olive oil"
    ],
    "instructions": [
      "Pat-dry the sirloin tip roast using a paper towel. Set aside.",
      "In a bowl, combine thyme, rosemary, garlic powder, oregano, paprika, salt, and pepper. Mix well using a spoon.",
      "Rub the spice mixture all over the sirloin tip. Let it stay for at least 1 hour so that the meat can better absorb the flavor.",
      "Preheat the oven to 325 degrees Fahrenheit. Arrange the sirloin tip roast in a roasting pan. Roast for 70 minutes. If you’re sirloin tip roast is less than or is more than 3 lbs. (as indicated in this recipe), roast your sirloin tip roast in the oven for 23 minutes per lb.",
      "Remove the roast from the oven. Let the meat rest for 15 minutes. Slice the meat. Serve with your favorite sauce. You can use steak sauce such as A1, Worcestershire sauce, or even gravy."
    ],
    "cooking_time": "1 hour",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/sirloin-tip-roast-recipe/",
    "image_url": "",
    "image_path": "",
    "category": "Other Filipino Dishes"
  }
]