[
  {
    "title": "Lumpiang Sariwa (Fresh Spring Rolls Recipe)",
    "ingredients": [
      "▢ 2 cups sweet potato cubed",
      "▢ 2 tbsp fish sauce patis",
      "▢ 1 lb cabbage shredded",
      "▢ 1 ½ cup carrots julienned",
      "▢ ½ cup water",
      "▢ ½ cup peanuts crushed",
      "▢ 6 pieces lettuce",
      "▢ ½ lb pork thinly sliced",
      "▢ 10 ounces tofu extra firm, sliced into strips",
      "▢ 1 cup shrimp shelled and deveined",
      "▢ 15 pieces long green beans baguio beans, chopped",
      "▢ 1 onion chopped",
      "▢ ½ cup cilantro chopped",
      "▢ 3 tbsp garlic minced",
      "▢ 1 cup all-purpose flour",
      "▢ 2 eggs",
      "▢ 2 tablespoons cooking oil",
      "▢ ½ teaspoons salt",
      "▢ 1½ cups milk Water can also be used as a substitute",
      "▢ 1 tablespoon soy sauce",
      "▢ 6 tablespoons brown sugar",
      "▢ 1 1/2 cups water",
      "▢ ½ teaspoon beef powder",
      "▢ 1 tablespoon garlic minced",
      "▢ 1 tablespoon cornstarch diluted in 3 tablespoons of water"
    ],
    "instructions": [
      "Cook the filling by heating a pan. Pour-in the cooking oil then sauté the garlic and onions. Add the pork and cook until color turns light brown. Add ½ cup water then simmer until pork becomes tender. Add the shrimps and sweet potatoes and cook for 5 minutes or until potatoes are soft. Add the tofu and cook for a few minutes. Put-in the cilantro, carrots, and long green beans then mix with the other ingredients. Add the cabbage and let cook for 5 minutes. Add the fish sauce and mix. Set aside2 cups sweet potato, 2 tbsp fish sauce, 1 lb cabbage, 1 ½ cup carrots, ½ lb pork, 10 ounces tofu, 1 cup shrimp, 15 pieces long green beans, 1 onion, ½ cup cilantro, 2 tablespoons cooking oil, 1 tablespoon garlic, ½ cup water",
      "Make the wrapper by cracking the eggs in a mixing bowl. Beat. Add the milk while beating. Put in the salt and all-purpose flour then mix thoroughly. Add the vegetable oil and mix well. Turn the stove on to medium heat and put the non-stick pan in place. Spray the pan with oil or grease with butter. Pour-in the wrapper mixture (about half a cup) and tilt the pan to distribute the liquid evenly. Cook until the top part of the mixture is dry (about 2 minutes). Using a spatula, remove the cooked mixture and place in a flat plate. Set aside1 cup all-purpose flour, 2 eggs, 1½ cups milk, 2 tablespoons cooking oil",
      "Make the sauce by pouring water in a sauce pan. Bring to a boil. Add the brown sugar and beef powder. Season with salt and soy sauce then mix well. Dilute the cornstarch in water and pour in the saucepan. Cook until the sauce becomes thick. Set aside.½ teaspoons salt, 6 tablespoons brown sugar, 1 1/2 cups water, ½ teaspoon beef powder, 1 tablespoon cornstarch, 1 tablespoon soy sauce",
      "Wrap the filling. Place the wrapper in a plate then place a lettuce leaf in the middle top part of the wrapper. Spoon the filling and place in the middle of the wrapper (over the lettuce leaf). Close the wrapper by folding the lower part first then roll the sides until the filling is sealed.6 pieces lettuce",
      "Pour the sauce over the Lumpiang Sariwa and garnish with crushed peanuts and minced garlic.½ cup peanuts, 3 tbsp garlic",
      "Serve. Share and Enjoy!"
    ],
    "cooking_time": "50 minutes",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/asian-vegetable-dish-fresh-spring-roll-lumpiang-sariwa-recipe/",
    "image_url": "",
    "image_path": "",
    "category": "Vegetable Dishes"
  },
  {
    "title": "Cheese Sticks",
    "ingredients": [
      "▢ 7 ounces cheddar cheese sliced into individual strips (I used pinoy cheese for this recipe)",
      "▢ 30 pieces spring roll lumpia wrapper",
      "▢ 1 cup cooking oil"
    ],
    "instructions": [
      "Wrap the cheeses in spring roll wrapper",
      "Heat the pan and pour-in the cooking oil. Let the oil heat-up for a few minutes. (use a smaller pan to save oil)",
      "Deep-fry the cheese in spring roll wrapper (uncooked cheese sticks) for 4 minutes or until the color of the spring roll wrapper turns golden brown.",
      "Remove from the pan and place in a plate with paper towel. Let stand for a few minutes for the oil to drain.",
      "Serve with mayonnaise and ketchup dip. Share and enjoy!"
    ],
    "cooking_time": "16 minutes",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/filipino-food-budget-friendly-meal-cheese-sticks-recipe/",
    "image_url": "",
    "image_path": "",
    "category": "Vegetable Dishes"
  },
  {
    "title": "Inihaw na Liempo Recipe (Grilled Pork Belly)",
    "ingredients": [
      "▢ 2 lbs. pork belly",
      "▢ 1/2 cup soy sauce",
      "▢ 1 piece lemon or 3 to 4 pieces calamansi",
      "▢ 1/2 tsp ground black pepper",
      "▢ 1 tsp salt",
      "▢ 4 cloves garlic crushed",
      "▢ 1/4 cup banana catsup",
      "▢ 1 tbsp cooking oil"
    ],
    "instructions": [
      "Combine pork belly with the soy sauce, lemon, salt, ground black pepper, garlic and mix well. Marinade the pork belly for at least 3 hours.",
      "In a bowl, pour the pork belly marinade. Add banana catsup and cooking oil. Stir well. (This will be the basting sauce)",
      "Grill the pork belly while basting the top part of the pork after flipping it over.",
      "Serve hot with spiced vinegar or toyomansi. Share and Enjoy!"
    ],
    "cooking_time": "3 hours",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/filipino-food-grilled-pork-belly-inihaw-na-liempo-baboy-recipe/",
    "image_url": "",
    "image_path": "",
    "category": "Pork Dishes"
  },
  {
    "title": "Kamote Cue Recipe (Deep Fried Caramelized Sweet Potato)",
    "ingredients": [
      "▢ 1 lb sweet potato sliced crosswise about 1.5 cm thick (Asian sweet potato is preferred)",
      "▢ 1 cup brown sugar",
      "▢ 1 cup cooking oil"
    ],
    "instructions": [
      "Heat the pan and pour the cooking oil.",
      "Let the cooking oil heat-up then put-in the brown sugar.",
      "When the brown sugar floats, put-in the sweet potato and fry for 7 to 10 minutes. Flip the sweet potato once in a while to allow the sugar to stick.",
      "Remove the sweet potato from the pan one after the other. You could directly skewer the fried sweet potatoes once removed from the pan.",
      "Let it cool down for a few minutes then serve. Share and Enjoy."
    ],
    "cooking_time": "15 minutes",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/filipino-food-sweet-potato-camote-kamote-que-recipe/",
    "image_url": "",
    "image_path": "",
    "category": "Other Filipino Dishes"
  },
  {
    "title": "Homemade Lasagna Recipe",
    "ingredients": [
      "▢ 1 lb. mozzarella cheese",
      "▢ 1 cup Parmesan cheese grated",
      "▢ 1 lb. lasagna",
      "▢ 1 lb. ground beef",
      "▢ 1/2 cup chopped onions",
      "▢ 2 cloves garlic chopped",
      "▢ 28 ounces crushed tomatoes",
      "▢ 16 ounces tomato sauce",
      "▢ 6 ounces tomato paste",
      "▢ 1/2 cup Water",
      "▢ 2 tbsp cooking oil",
      "▢ 2 tbsp white sugar",
      "▢ 3 tbsp fresh parsley chopped",
      "▢ 3 tbsp fresh Basil leaves chopped",
      "▢ 1 tsp salt",
      "▢ 1 tsp Italian Seasoning",
      "▢ 1/2 tsp ground pepper",
      "▢ 2 tbsp fresh parsley chopped",
      "▢ 1 1/2 lb. ricotta cheese",
      "▢ 1 piece raw egg"
    ],
    "instructions": [
      "Soak the Lasagna in water for 15 to 20 minutes",
      "Make the meat sauce by heating a cooking pot and pouring-in the cooking oil.",
      "Sauté the garlic and onions",
      "Put-in the ground beef and cook until color turns brown (about 7 to 8 minutes)",
      "Add the crushed tomato, tomato sauce, and tomato paste then stir.",
      "Put-in the fresh parsley, fresh basil leaves, sugar, salt, and Italian seasoning. Stir and simmer for 60 minutes.",
      "Add the ground black pepper and then set aside.",
      "Make the white sauce by combining the ricotta cheese, parsley, and egg in a mixing bowl.",
      "Mix the combined ingredients then set aside.",
      "Arrange the Lasagna layers by pouring-in 2 cups of meat sauce in a baking tray. Evenly distribute it on the tray's flat surface",
      "Lay the Lasagna Noodles over the layer of meat sauce (about 6 to 7 pieces per layer)",
      "Put half of the white sauce on top of the Lasagna Noodle layer then spread evenly",
      "Put a layer of mozzarella cheese over the white sauce (use half of the total mozzarella cheese)",
      "Sprinkle half of the parmesan cheese over the mozzarella cheese layer",
      "Spread 2 cups of meat sauce over the parmesan cheese",
      "Lay the another layer of Lasagna Noodles over the meat sauce",
      "Put and spread the remaining white sauce (ricotta mixture) over the Lasagna Noodles",
      "Put the mozzarella cheese over the white sauce and spread again (save some for the final topping)",
      "Sprinkle the rest of the parmesan cheese over the mozzarella cheese layer",
      "Pour-in all the remaining meat sauce and spread evenly",
      "Put-in the remaining mozzarella cheese on top of the meat sauce",
      "Cover the baking tray with Aluminum foil and bake in 350 degrees Fahrenheit for 25 minutes",
      "Remove the Aluminum foil on top of the tray and bake for 20 minutes in 350 degrees Fahrenheit",
      "Serve Hot. Share and Enjoy"
    ],
    "cooking_time": "1 hour",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/italian-food-cheese-lasagne-lasagna-recipe/",
    "image_url": "",
    "image_path": "",
    "category": "Other Filipino Dishes"
  },
  {
    "title": "Cassava Cake Recipe",
    "ingredients": [
      "▢ 2 packs grated cassava about 2 lbs total weight",
      "▢ 2 cups coconut milk",
      "▢ 1/2 12 oz. can evaporated milk",
      "▢ 3 pieces egg",
      "▢ 1/4 cup butter melted",
      "▢ 6 tablespoons cheddar cheese grated",
      "▢ 1/2 cup condensed milk",
      "▢ 14 tablespoons granulated white sugar",
      "▢ 2 tablespoons flour",
      "▢ 2 tablespoons sugar",
      "▢ 1/2 cup condensed milk",
      "▢ 2 tablespoons cheddar cheese grated",
      "▢ 2 cups coconut milk"
    ],
    "instructions": [
      "Make the batter by combining the grated cassava, butter, 1/2 cup condensed milk, 1/2 cup evaporated milk, 6 tablespoons cheddar cheese, 14 tablespoons sugar, and 2 eggs in a mixing bowl and mix thoroughly.",
      "Add the 2 cups coconut milk in the mixing bowl where the mixed ingredients are. Mix again.",
      "Grease the baking tray then pour-in the batter (these are the ingredients that you just mixed together).",
      "Pre -heat oven for 350 degrees Fahrenheit for 10 minutes then put-in the baking tray with batter and bake for 1 hour.Remove from the oven and set aside.",
      "Meanwhile prepare the topping by combining 2 tablespoons sugar and flour in the heated saucepan.",
      "Pour-in 1/2 cup condensed milk then mix thoroughly.",
      "Add 2 tablespoons cheddar cheese while stirring constantly.",
      "Pour 2 cups of coconut milk and stir constantly for 10 minutes",
      "Pour the topping over the Cassava Cake (baked batter) and spread evenly.",
      "Separate the yolk from the egg white of the remaining egg (we’ll be needing the egg white only)",
      "Glaze the topping with the egg white using a basting brush. Simply dip the brush to the egg white and brush it on the cassava cake.",
      "Set your oven to broil mode. Broil the Cassava cake until color turns light brown.",
      "Garnish with extra grated cheese on top. Serve. Share and enjoy!"
    ],
    "cooking_time": "1 hour",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/filipino-food-dessert-holiday-cassava-cake-recipe/",
    "image_url": "",
    "image_path": "",
    "category": "Other Filipino Dishes"
  },
  {
    "title": "Pandesal Recipe",
    "ingredients": [
      "▢ 2 cups all purpose flour",
      "▢ 2 cups bread flour",
      "▢ 1/2 cup white sugar",
      "▢ 5 tbsp butter melted",
      "▢ 1 tsp baking powder",
      "▢ 1 1/4 cup fresh milk warm",
      "▢ 1 pouch rapid rise yeast",
      "▢ 1 tsp salt",
      "▢ 1 cup bread crumbs",
      "▢ 1 piece raw egg",
      "▢ 1 tbsp cooking oil"
    ],
    "instructions": [
      "Combine the yeast, sugar, and warm milk and stir until the yeast and sugar are fully dissolved",
      "In the mixing bowl, combine the dry ingredients starting with the flour then the sugar, salt, and baking powder . Mix well by stirring",
      "Add the egg, butter, cooking oil, and yeast-sugar-milk mixture in the mixing bowl with the dry ingredients then mix again until a dough is formed. Use your clean hands to effectively mix the ingredients.",
      "In a flat surface, knead the dough until the texture becomes fine. For faster and easier kneading, you may use a Stand Mixer with dough hook.",
      "Mold the dough until shape becomes round then put back in the mixing bowl. Cover the mixing bowl with damp cloth and let the dough rise for at least 1 hour",
      "Put the dough back to the flat surface and divide into 4 equal parts using a dough slicer",
      "Roll each part until it forms a cylindrical shape",
      "Slice the cylindrical dough diagonally (These slices will be the individual pieces of the pandesal)",
      "Roll the sliced dough over the breadcrumbs and place in a baking tray with wax paper (makes sure to provide gaps between dough as this will rise later on)",
      "Leave the sliced dough with breadcrumbs in the tray for another 10 to 15 minutes to rise",
      "Pre-heat the oven at 375 degrees Fahrenheit for 10 minutes",
      "Put the tray with dough in the oven and bake for 15 minutes",
      "Turn off the oven and remove the freshly baked pandesal.",
      "Serve hot. Share and enjoy!"
    ],
    "cooking_time": "1 hour",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/filipino-food-bread-of-salt-pandesal-recipe/",
    "image_url": "",
    "image_path": "",
    "category": "Other Filipino Dishes"
  },
  {
    "title": "Ginisang Upo Recipe",
    "ingredients": [
      "▢ 1 medium sized Upo White Squash , sliced",
      "▢ 5 cloves garlic crushed",
      "▢ 1 medium sized onion diced",
      "▢ 2 medium sized tomatoes diced",
      "▢ 1/4 lb ground pork",
      "▢ 3 tbsp cooking oil",
      "▢ 1 tsp salt",
      "▢ 1/2 tsp ground black pepper"
    ],
    "instructions": [
      "Heat the pan and pour the cooking oil",
      "Sauté the garlic, onions, and tomatoes",
      "Put-in the ground black pepper and ground pork then simmer for 3 to 5 minutes",
      "Add the Upo (White Squash), cover the pan, and simmer for 6 minutes",
      "Add salt to taste",
      "Serve hot. Enjoy!"
    ],
    "cooking_time": "20 minutes",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/healthy-vegetable-dis-ginisang-upo-recipe/",
    "image_url": "",
    "image_path": "",
    "category": "Vegetable Dishes"
  },
  {
    "title": "Liver Steak Recipe",
    "ingredients": [
      "▢ 1 lb Liver pig's or cow's liver are best",
      "▢ 2 medium sized onions sliced thinly crosswise",
      "▢ 1 piece lemon or 3-4 pieces calamansi",
      "▢ 4 tbsp soy sauce",
      "▢ 3 tbsp garlic. minced optional",
      "▢ 1 tsp salt",
      "▢ 1/2 tsp pepper",
      "▢ 4 tbsp cooking oil"
    ],
    "instructions": [
      "Marinate the liver in lemon juice, soy sauce, salt, and ground black pepper for a minimum of 1 hour",
      "Pour the cooking oil in a pan and apply heat",
      "Put-in the garlic and fry until color turns golden brown. Set aside.",
      "On the same pan with the remaining cooking oil, fry the both sides of the liver (do not overcook ) then set aside.",
      "Put the onions in the pan where the liver was fried and cook until texture becomes soft",
      "Add the marinade and simmer for 5 to 7 minutes or until sauce becomes thick",
      "Pour the sauce with onions over the fried liver and garnish with fried garlic",
      "Serve hot. Share and enjoy!"
    ],
    "cooking_time": "35 minutes",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/lutong-bahay-atay-liver-steak-recipe/",
    "image_url": "",
    "image_path": "",
    "category": "Other Filipino Dishes"
  },
  {
    "title": "Pancit Canton Recipe",
    "ingredients": [
      "▢ 1 lb flour sticks or pancit canton, about 500 grams",
      "▢ 2 tbsp oyster sauce",
      "▢ 1 tbsp garlic minced",
      "▢ 1 tsp ground black pepper",
      "▢ 4 cups chicken stock",
      "▢ 1 tbsp salt",
      "▢ 4 tbsp soy sauce",
      "▢ ½ head cabbage chopped",
      "▢ 2 cups carrots julienned",
      "▢ 2 cups pork thinly sliced",
      "▢ 1 cup sliced chorizo",
      "▢ 8 pieces medium sized shrimps optional",
      "▢ 1 cup parsley chopped finely",
      "▢ 1 cup onion sliced",
      "▢ 1 ½ cups snow peas",
      "▢ 2 tbsp cooking oil"
    ],
    "instructions": [
      "In a pan, heat the oil then sauté the garlic and onion",
      "Add the pork and cook until the outer part turns light brown",
      "Add the soy sauce and cook for 5 minutes",
      "Put in the chorizo, oyster sauce, and chicken stock and simmer for 20 minutes",
      "While simmering, blanch all the vegetables in a separate pot",
      "Put in the parsley and shrimp on the pan where the pork, chorizo, and other ingredients are cooked",
      "Add salt and pepper to taste then let cook for 2 minutes",
      "Put in the Flour sticks and cook until the liquid has been absorbed by the noodles",
      "Add all the blanched vegetables and mix with the rest of the ingredients",
      "Serve hot. Share and enjoy!"
    ],
    "cooking_time": "50 minutes",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/filipino-chow-mein-noodle-pansit-pancit-canton-recipe/",
    "image_url": "",
    "image_path": "",
    "category": "Noodles"
  },
  {
    "title": "Fried Chicken with White Gravy Recipe",
    "ingredients": [
      "▢ 2 lbs chicken cut into serving pieces",
      "▢ 2 1/4 cups flour",
      "▢ 2 cups fresh milk",
      "▢ 1 tbsp ground black pepper",
      "▢ 1 tbsp salt",
      "▢ 2 pieces raw eggs",
      "▢ 3 cups cooking oil",
      "▢ 1/2 cup butter",
      "▢ 1 1/2 cups chicken stock"
    ],
    "instructions": [
      "Make the gravy by melting the butter in a saucepan. Once the butter starts to get hot, gradually add 1/4 cup flour while stirring. Pour 1 cup fresh milk in and mix all the ingredients thoroughly. Bring to a boil. Add the chicken stock and stir mixture continuously until texture becomes thick. Add salt and pepper to taste, then set aside.",
      "Prepare the chicken by rubbing salt all over it (make sure to distribute it evenly on all pieces)",
      "In a separate container, combine the raw eggs and milk then beat until fully mixed. Set aside for a while.",
      "In a plastic bag or any container, put-in the flour and ground black pepper and mix both ingredients. Set aside for a while.",
      "Dip the chicken in the eggs and milk mixture then place in the plastic bag (or container) with flour and ground black pepper. Ensure that the chicken is coated with enough flour mixture.",
      "Heat the pan and pour the oil. When the oil is hot enough, put-in the chicken and fry both sides until in medium heat until cooked.",
      "Let the oil drip then transfer the fried chicken in a serving plate. Serve with white gravy.",
      "Share and enjoy!"
    ],
    "cooking_time": "45 minutes",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/southern-asian-pan-fried-chicken-recipe/",
    "image_url": "",
    "image_path": "",
    "category": "Chicken Dishes"
  },
  {
    "title": "Sisig Recipe",
    "ingredients": [
      "▢ 2 lbs pig ears",
      "▢ ¼ lb pork belly",
      "▢ 1 cup onion minced",
      "▢ 3 tbsp soy sauce",
      "▢ 1 tsp ground black pepper",
      "▢ 1 knob ginger minced",
      "▢ 3 tbsp chili",
      "▢ 1 piece lemon or 3 to 5 pieces calamansi",
      "▢ ½ cup butter or margarine",
      "▢ ¼ lb chicken liver",
      "▢ 34 ounces water",
      "▢ 3 tbsp mayonnaise",
      "▢ 1 tsp salt"
    ],
    "instructions": [
      "Pour the water in a pan and bring to a boil",
      "Add salt and pepper",
      "Put-in the pig’s ears and pork belly then simmer for 40 minutes to 1 hour (or until tender).",
      "Remove the boiled ingredients from the pot then drain excess water",
      "Grill the boiled pig ears and pork belly until done",
      "Chop the pig ears and pork belly into fine pieces",
      "In a pan, melt the butter then add the onions. Cook until onions are soft.",
      "Put-in the ginger and cook for a few minutes",
      "Add the chicken liver and cook until well done.",
      "Crush the chicken liver while being cooked in the pan",
      "Add the chopped pig ears and pork belly then cook for 10 minutes",
      "Put-in the soy sauce and chili then mix well",
      "Add salt and pepper to taste",
      "Put-in the mayonnaise and mix with the other ingredients",
      "Serve hot. Share and Enjoy (add the lemon or calamansi before eating)"
    ],
    "cooking_time": "1 hour",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/filipino-food-appetizer-pulutan-sisig/",
    "image_url": "",
    "image_path": "",
    "category": "Pork Dishes"
  }
]