[
  {
    "title": "Simple Baked Pork Chop Recipe",
    "ingredients": [
      "▢ 4 pieces thick cut pork chops",
      "▢ 3/4 cups barbecue sauce use your favorite brand",
      "▢ cooking oil spray",
      "▢ 1/2 teaspoon salt",
      "▢ 1/4 teaspoon ground black pepper"
    ],
    "instructions": [
      "Sprinkle salt and pepper on both sides of the pork chop. Let it stay for 15 minutes so that the pork can absorb the flavor.",
      "Heat a skillet or frying pan. Spray enough cooking oil (using the cooking oil spray) on the skillet.",
      "Sear each side of the pork chop for 3 minutes or until brown. Note: Doing this will help retain some moisture inside the pork chops.",
      "Preheat the oven to 350 degrees Fahrenheit.",
      "While the oven is being preheated, spread the barbecue sauce on both sides of the seared pork chops.",
      "Arrange the pork chops in a baking pan. Bake for 20 to 25 minutes.",
      "Transfer to a serving plate. Serve with grilled corn. mashed potatoes, or white rice."
    ],
    "cooking_time": "30 minutes",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/simple-baked-pork-chop-recipe/",
    "image_url": "",
    "image_path": "",
    "category": "Pork Dishes"
  },
  {
    "title": "Sardines with Misua and Patola Recipe",
    "ingredients": [
      "▢ 4 ounces Misua noodles",
      "▢ 15 ounce canned sardines in tomato sauce",
      "▢ 1 medium patola luffa peeled and sliced",
      "▢ 1/2 cup chopped green onions",
      "▢ 1/2 to 1 head garlic crushed",
      "▢ 1 medium onion diced",
      "▢ salt and pepper to taste",
      "▢ 3 tablespoons cooking oil",
      "▢ 4 to 5 cups water"
    ],
    "instructions": [
      "Heat the cooking oil in a soup pot.",
      "Saute the garlic until medium brown.",
      "Add-in the onion. Continue to saute until the texture becomes soft.",
      "Pour-in the sardines in tomato sauce. Stir.Cook for a 2 minutes.",
      "Put-in the patola and cook for 1 minute.",
      "Pour-in the water. Let boil. Simmer for 3 to 5 minutes.",
      "Add-in the misua. Gently stir. Cook for 2 minutes.",
      "Add salt and pepper to taste. Put-in the green onions.",
      "Transfer to a serving bowl. Serve.",
      "Share and enjoy!"
    ],
    "cooking_time": "25 minutes",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/misua-sardines-patola-recipe/",
    "image_url": "",
    "image_path": "",
    "category": "Soups and Stews"
  },
  {
    "title": "Easy Calamari Recipe",
    "ingredients": [
      "▢ 1 lb. calamari rings soaked in milk for 3 hours",
      "▢ 1/2 cup all-purpose flour",
      "▢ 1 1/2 teaspoon salt",
      "▢ 2 teaspoons garlic powder",
      "▢ 2 teaspoons dried parsley flakes",
      "▢ Lemon wedges",
      "▢ 2 cups cooking oil",
      "▢ Cooking Procedure"
    ],
    "instructions": [
      "Combine the flour, salt, garlic powder, and parsley flakes. Mix well and set aside.",
      "Heat the cooking oil in a wok or a deep cooking pot.",
      "Drain the milk of the calamari. Dredge the calamari rings one-at-a-time on the flour mixture. Make sure that the calamari ring is completely coated with the mixture.",
      "Deep fry the coated calamari rings on hot oil for 2 minutes or until the calamari turns light brown.",
      "Strain the calamari from the wok or cooking pot using a skimmer or strainer. Let the excess oil drip.",
      "Transfer the fried calamari in a serving plate.",
      "Serve with lemon wedges.",
      "Share and enjoy!"
    ],
    "cooking_time": "20 minutes",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/easy-calamari-recipe/",
    "image_url": "",
    "image_path": "",
    "category": "Other Filipino Dishes"
  },
  {
    "title": "Sweet and Sour Mahi mahi",
    "ingredients": [
      "▢ 1 lb. frozen Mahi mahi fillets",
      "▢ 1/4 cup all-purpose flour",
      "▢ 2/3 cups rice wine vinegar",
      "▢ 1/2 small red bell pepper julienned",
      "▢ 1/2 small green bell pepper julienned",
      "▢ 1/4 cup carrots julienned",
      "▢ 1 small red onion sliced",
      "▢ 1 teaspoon dark soy sauce",
      "▢ 1/4 cup tomato ketchup",
      "▢ 1/2 cup brown sugar",
      "▢ 1 1/2 tablespoons cornstarch diluted in 3 tablespoons water",
      "▢ 1/2 cup cooking oil",
      "▢ Salt and pepper to taste"
    ],
    "instructions": [
      "Season Mahi mahi fillets with salt and pepper.",
      "Heat the cooking oil in a frying pan.",
      "When the oil gets hot, dredge the seasoned mahi mahi fillets in all-purpose flour. Fry each side in medium heat for 3 to 5 minutes or until medium brown. Remove the fried fish from the pan. Arrange in a serving plate. Set aside.",
      "Meanwhile, make the sweet and sour sauce by combining vinegar, soy sauce, ketchup, and sugar in a bowl. Mix well.",
      "Heat a saucepan and pour-in the vinegar mixture. Let boil.",
      "Adjust the heat to medium and then add the carrots, bell peppers, and onion. Stir and cook for 2 minutes.",
      "Pour-in the cornstarch diluted in water. Stir quickly. Continue to stir gently until the texture becomes thick.",
      "Turn the heat off. Scoop some sweet and sour sauce and top over the fried Mahi mahi.",
      "Serve with warm steamed white rice.",
      "Share and enjoy!"
    ],
    "cooking_time": "40 minutes",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/sweet-and-sour-mahi-mahi/",
    "image_url": "",
    "image_path": "",
    "category": "Seafood"
  },
  {
    "title": "Beef Pho Noodle Soup",
    "ingredients": [
      "▢ 10 ounces flat rice noodles Banh Pho",
      "▢ 3 lbs. calf knuckle bones",
      "▢ 2 lbs shank bones with marrow",
      "▢ 8 to10 cups water",
      "▢ 2 lbs. thinly sliced sirloin",
      "▢ 1 large red onion peeled and cut in half",
      "▢ 1 thumb ginger about a tablespoon, cut in half",
      "▢ 3 pieces star anise",
      "▢ 1 black cardamom pod",
      "▢ 1 cinnamon stick",
      "▢ 1 teaspoon fennel seeds",
      "▢ 4 pieces cloves",
      "▢ 1 teaspoon coriander seeds",
      "▢ 1 piece green Jalapeno pepper thinly sliced diagonally",
      "▢ 1 piece red Jalapeno pepper thinly sliced diagonally",
      "▢ 1 bunch fresh Cilantro",
      "▢ 3 pieces lime wedged",
      "▢ Sriracha sauce to taste",
      "▢ Hoisin Sauce to taste",
      "▢ Fish Sauce to taste"
    ],
    "instructions": [
      "Cook the noodles according to package instructions. Set aside.",
      "Preheat the oven to 450 degrees Fahrenheit.",
      "Arrange the bones in a baking tray. Cover with aluminum foil. Roast in the oven for 25 minutes.",
      "Put the onion and ginger in the oven. Remove the foil from the bones. Continue to roast for 20 minutes.",
      "Meanwhile, boil the water in large cooking pot.",
      "Once the bones, onion, and ginger are ready, add them in the boiling water. Let it boil for 12 minutes in medium to high heat. This is the part where scum from the meat will float.",
      "Scrape the scum floating on the beef stock. Reduce the heat to a simmer.",
      "Meanwhile, heat a saute pan. When the saute pan gets hot. Put in the cinnamon, fennel, clove, coriander, star anise, and cardamom. Roast in the pan while gently shaking the pan for 5 to 6 minutes. Make sure that you do not over roast the spices as it will taste bitter, so reduce the time as necessary.",
      "Add the roasted spices on the cooking pot where the bones are in. Continue to simmer for 2 to 3 hours. Add more water if needed.",
      "Add some fish sauce to taste. Stir.",
      "Arrange the noodles and sliced sirloin (raw) in a bowl. Pour in the beef broth. (Note: the hot broth will cook the thinly sliced sirloin). Top with cilantro and jalapeno. Add some hoisin sauce and Sriracha sauce to taste (and additional fish sauce as needed).",
      "Serve with lime wedges. Serve!",
      "Share and enjoy!"
    ],
    "cooking_time": "2 hours",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/beef-pho-noodle-soup/",
    "image_url": "",
    "image_path": "",
    "category": "Seafood"
  },
  {
    "title": "Rotisserie Chicken Arroz Caldo Recipe",
    "ingredients": [
      "▢ 1/2 rotisserie chicken or lechon manok cut into serving pieces",
      "▢ 1 cup uncooked Jasmin rice",
      "▢ 1 thumb ginger peeled and julienned",
      "▢ 32 oz. chicken broth",
      "▢ 2 cups water",
      "▢ 1 medium yellow onion minced",
      "▢ 2 teaspoons garlic powder",
      "▢ a pinch of saffron or safflower",
      "▢ 3 stalks scallions chopped",
      "▢ 1 lemon sliced crosswise",
      "▢ 3 tablespoons cooking oil",
      "▢ Salt and pepper to taste"
    ],
    "instructions": [
      "Heat the oil in a large cooking pot.",
      "Saute the onion until the texture becomes soft.",
      "Add the ginger and garlic powder. Shake-in some ground black pepper. Continue cooking for 1 minute.",
      "Put-in the chicken and rice. Stir fry for 2 minutes.",
      "Pour-in chicken broth and water. Let boil.",
      "Adjust the heat between low and medium. Stir. Cover while stirring every 5 minutes. Continue to cook for the next 35 to 44 minutes. Add more water if needed.",
      "Add-in a pinch of saffron or safflower (kasubha). Shake-in some salt and pepper to taste. You can also use fish sauce as a replacement for salt. stir.",
      "Transfer to a bowl. Top with a slice of lemon and some chopped scallions.",
      "Serve hot. Share and enjoy!"
    ],
    "cooking_time": "55 minutes",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/rotisserie-chicken-arroz-caldo-recipe/",
    "image_url": "",
    "image_path": "",
    "category": "Pork Dishes"
  },
  {
    "title": "Pork Menudo with Raisins and Green Peas",
    "ingredients": [
      "▢ 2 lbs. pork cubed",
      "▢ 1/4 lb. pig’s liver cubed",
      "▢ 4 hotdogs sliced diagonally",
      "▢ 2 medium baking potatoes peeled and cubed",
      "▢ 2 medium carrots peeled and cubed",
      "▢ 1 medium yellow onion chopped",
      "▢ 2 teaspoons minced garlic",
      "▢ 1 teaspoon minced ginger",
      "▢ 1/2 cup raisins",
      "▢ 3/4 cups frozen green peas",
      "▢ 3 pieces dried bay leaves",
      "▢ 15 oz. tomato sauce",
      "▢ 16 ounces beef broth or 2 cups beef stock",
      "▢ 3 tablespoons cooking oil",
      "▢ Salt and pepper to taste"
    ],
    "instructions": [
      "Heat the cooking oil in a wide cooking pot.",
      "Saute the hotdogs for 1 minute. Transfer the hotdogs in a plate while leaving the remaining cooking oil.",
      "On the same cooking pot, add-in the ginger. Saute for 30 seconds to a minute.",
      "Put-in the liver. Continue to saute for 2 minutes. Transfer to a plate while leaving the remaining cooking oil in the cooking pot. Set the liver aside.",
      "On the same cooking pot with remaining cooking oil, saute the onion and garlic until the onion becomes soft. Note: you can add more oil if there isn’t enough left.",
      "Add-in the pork. Continue to cook until light brown.",
      "Add the raisins, pour-in the tomato sauce and beef broth. Bring to a boil.",
      "Add the dried bay leaves and simmer for 45 to 60 minutes or until the pork becomes tender.",
      "Put-in the sauteed liver and hotdog. Stir.",
      "Add the carrots, green peas and potatoes. Cover and cook for 8 minutes.",
      "Add salt and pepper to taste.",
      "Transfer to a serving plate. Serve.",
      "Share and enjoy!"
    ],
    "cooking_time": "1 hour",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/menudo-with-raisins-and-green-peas/",
    "image_url": "",
    "image_path": "",
    "category": "Main Dishes"
  },
  {
    "title": "Spaghetti with Meatballs",
    "ingredients": [
      "▢ 15 pieces meatballs see meatball recipe here",
      "▢ 1 lb. spaghetti",
      "▢ 5 to 6 cups homemade marinara sauceor 6 to 8 ounces bottled spaghetti sauce",
      "▢ 1/2 cup grated Parmesan cheese",
      "▢ Salt and pepper to taste"
    ],
    "instructions": [
      "Cook the spaghetti noodles according to package instructions. Set aside.",
      "Heat the homemade marinara sauce in a sauce pan. If you are using the bottled spaghetti sauce purchased from the grocery store, you can saute 1 small onion (minced) before adding the sauce to make it more flavorful.",
      "Add-in the meatballs. Let boil and continue to cook in low heat for 10 to 15 minutes. Add salt and pepper to taste.",
      "Arranged the spaghetti noodles in a plate. Top with spaghetti sauce and meatballs. Sprinkle some Parmesan cheese on top.",
      "Serve. Share and enjoy!"
    ],
    "cooking_time": "45 minutes",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/spaghetti-with-meatballs/",
    "image_url": "",
    "image_path": "",
    "category": "Other Filipino Dishes"
  },
  {
    "title": "Eggplant and Ground Chicken Omelet",
    "ingredients": [
      "▢ 2 pieces Chinese eggplant",
      "▢ 3 eggs beaten",
      "▢ 1/2 lb. ground chicken",
      "▢ 1 medium onion minced",
      "▢ 1/2 teaspoon minced garlic",
      "▢ 6 tablespoons cooking oil",
      "▢ Salt and pepper to taste"
    ],
    "instructions": [
      "Prepare the eggplants by removing the skin. This can be done by baking the eggplant in 350F for 20 to 25 minutes. Gently peel the skin off after removing the eggplant from the oven and letting the temperature cool down. A quicker way is to burn the skin off by directly exposing the eggplant to fire, but this is not recommended for beginners.",
      "After peeling the skin off the eggplants, arrange both eggplants flat in a wide plate. Using a fork, press the eggplant gently until it spreads-out and forms a paddle-like figure. Set aside.",
      "Heat 2 tablespoons of cooking oil in a sauté pan.",
      "Once the oil becomes hot, sauté the garlic and onion until the onion is soft.",
      "Put-in the ground chicken. Stir fry for 2 to 5 minutes.",
      "Add salt and pepper to taste. Stir, turn off the heat, and set aside.",
      "Meanwhile, heat the remaining 4 tablespoons of cooking oil in a wide frying pan.",
      "Once the oil is hot, quickly dip the eggplant in beaten egg and place it flat on the frying pan to fry.",
      "Scoop about a quarter (1/4) of the cooked ground chicken and arrange it on top of the eggplant. Pour beaten egg on the ground chicken enough to cover everything, do not put too much though as you will still need the egg later.",
      "Scoop some cooking oil from the pan and pour it over the top off the eggplant omelet. This will partially cook the egg on top and prevent the meat from falling apart.",
      "Gently turn-over the eggplant (side with ground chicken facing down). Use a wide spatula to do this. Continue to cook in medium heat for 3 minutes. While doing this, scoop a quarter of cooked ground chicken and arrange it on top of the other side. Pour some egg on top of the ground chicken and scoop some cooking oil on top.",
      "Flip the eggplant and cook the other side for 2 to 3 minutes.",
      "Transfer the eggplant to a serving plate. Serve with rice and banana ketchup.",
      "Share and enjoy!"
    ],
    "cooking_time": "23 minutes",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/eggplant-and-ground-chicken-omelet/",
    "image_url": "",
    "image_path": "",
    "category": "Chicken Dishes"
  },
  {
    "title": "Linguine Pasta with Clams",
    "ingredients": [
      "▢ 1 1/2 lbs round clam cleaned",
      "▢ 1 lb. linguine",
      "▢ 2 tablespoons chopped red bell pepper",
      "▢ 2 tablespoons chopped green bell pepper",
      "▢ 3 stalks scallions finely chopped",
      "▢ 1 small yellow onion minced",
      "▢ 1 teaspoon minced garlic",
      "▢ 1 cup dry white wine",
      "▢ 3 ounces bottled clam juice",
      "▢ 3 tablespoons extra virgin olive oil",
      "▢ Salt to taste"
    ],
    "instructions": [
      "Cook the linguine according to package instructions. Set aside in a large bowl.",
      "Heat the olive oil in a sauté pan.",
      "Add the onion and garlic. Cook until the onion turns soft.",
      "Add the red and green bell peppers and clams. Stir.",
      "Pour-in white wine and clam juice. Continue to cook until the liquid reduces in half.",
      "Add scallions and salt.",
      "Pour the cooked clams along with the sauce over the cooked linguine pasta. Toss.",
      "Serve. Share and enjoy!"
    ],
    "cooking_time": "25 minutes",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/linguine-pasta-with-clams/",
    "image_url": "",
    "image_path": "",
    "category": "Other Filipino Dishes"
  },
  {
    "title": "Sinigang na Liempo sa Sampaloc with Gabi",
    "ingredients": [
      "▢ 2 lbs. pork belly chopped",
      "▢ 16 ounces unripe sampaloc tamarind",
      "▢ 1 bunch kangkong onchoy, cleaned and sliced",
      "▢ 3 medium gabi eddo, halved",
      "▢ 2 medium ripe red tomatoes quartered",
      "▢ 1 medium yellow onion quartered",
      "▢ 12 pieces okra",
      "▢ 3 to 4 pieces long green chili siling pansigang",
      "▢ 4 cups water",
      "▢ 2 cups beef broth",
      "▢ 2 tablespoons cooking oil",
      "▢ Fish sauce to taste"
    ],
    "instructions": [
      "Boil the water in a cooking pot.",
      "Put-in the tamarind and continue to boil for 45 minutes.",
      "Meanwhile, heat the oil on another deep cooking pot.",
      "Once the oil is hot, sear the pork belly until the color turns light brown.",
      "Stir-in the tomatoes and onion. Cook for 2 minutes.",
      "Gently pour-in the boiling water, but do not include the tamarind. Add the beef broth and gabi afterwards.",
      "Place the tamarind on a strainer and let the remaining juice out by pushing a spoon against it. Add the tamarind juice to the cooking pot where the meat is. Simmer for 60 minutes. Add more water if necessary.",
      "Put-in the okra and long green chili. Cook for 3 minutes.",
      "Add the kangkong (onchoy) and fish sauce. Stir. Cover and turn the heat off. Let it stay covered for 5 minutes.",
      "Transfer to a serving bowl.",
      "Serve with warm rice.",
      "Share and enjoy!"
    ],
    "cooking_time": "1 hour",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/sinigang-na-liempo-sa-sampaloc-with-gabi/",
    "image_url": "",
    "image_path": "",
    "category": "Pork Dishes"
  },
  {
    "title": "Fried Fish Adobo",
    "ingredients": [
      "▢ 2 lbs. Fish Adobo click here for recipe",
      "▢ 3/4 cups cooking oil"
    ],
    "instructions": [
      "Drain the liquid from the fish adobo.",
      "Heat a frying pan. Fry each side of the fish for 3 to 4 minutes or until the color turns golden brown and the texture starts to be crispy.",
      "Remove the fish from the pan, and place in a plate lined with paper towels to absorb the oil.",
      "Serve with warm rice. Share and enjoy!"
    ],
    "cooking_time": "15 minutes",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/fried-fish-adobo/",
    "image_url": "",
    "image_path": "",
    "category": "Chicken Dishes"
  }
]