[
  {
    "title": "Halabos na Hipon with Butter",
    "ingredients": [
      "▢ 1 lb. shrimp deveined",
      "▢ 1 cup lemon lime soda",
      "▢ 2 tablespoons butter",
      "▢ 1 tablespoons parsley chopped",
      "▢ ½ teaspoon salt"
    ],
    "instructions": [
      "Heat pan and then add shrimp. Stir.",
      "Pour lemon lime soda. Let it boil while gently stirring shrimp once in a while. Continue cooking until the liquid reduces to half.",
      "Season with salt and add butter. Let the butter melt. Continue cooking for 1 to 2 minutes.",
      "Add parsley. Stir.",
      "Transfer to a serving plate. Serve warm",
      "Share and enjoy."
    ],
    "cooking_time": "N/A",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/halabos-na-hipon-with-butter/",
    "image_url": "",
    "image_path": "",
    "category": "Other Filipino Dishes"
  },
  {
    "title": "Ginataang Kalabasa at Sitaw",
    "ingredients": [
      "▢ 1 1/2 lbs. squash cubed",
      "▢ 18 pieces string beans see notes",
      "▢ 1 piece Knorr Pork cube",
      "▢ 3 ounces pork see notes",
      "▢ 4 cups coconut milk see notes",
      "▢ 1 piece onion chopped",
      "▢ 2 thumbs ginger sliced into strips",
      "▢ 5 cloves garlic crushed",
      "▢ ¼ teaspoon ground black pepper",
      "▢ 1 tablespoon cooking oil",
      "▢ Fish sauce to taste"
    ],
    "instructions": [
      "Heat oil in a pan. Add pork. Cook until brown and crispy.1 tablespoon cooking oil, 3 ounces pork",
      "Sauté garlic, onion, and ginger.1 piece onion, 5 cloves garlic, 2 thumbs ginger",
      "Once the onion softens, pour the coconut milk into the pan. Stir. Cover the pan and let the liquid boil. Once boiling, adjust the heat to medium and continue boiling for 5 minutes.4 cups coconut milk",
      "Add Knorr Pork Cube and squash. Continue cooking for 5 minutes.1 piece Knorr Pork cube, 1 1/2 lbs. squash",
      "Add string beans. Cook for 5 to 8 minutes.18 pieces string beans",
      "Season with ground black pepper and fish sauce as needed.¼ teaspoon ground black pepper, Fish sauce to taste",
      "Transfer to a serving plate. Serve with warm rice."
    ],
    "cooking_time": "N/A",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/ginataang-kalabasa-at-sitaw/",
    "image_url": "",
    "image_path": "",
    "category": "Pork Dishes"
  },
  {
    "title": "Chicken Macaroni Salad Recipe",
    "ingredients": [
      "▢ 1 lb. boneless chicken breast",
      "▢ 1 lb elbow macaroni",
      "▢ 1 1/2 cups Lady’s Choice Mayonnaise",
      "▢ 1 can  pineapple chunks 20 oz",
      "▢ 1 1/2 cups shredded cheddar cheese",
      "▢ 1 bottle pimiento 6.5 oz chopped",
      "▢ 1 cup carrot chopped",
      "▢ 1 piece green bell pepper chopped",
      "▢ 1 cup raisins",
      "▢ 1/4 cup sweet relish",
      "▢ 1/2 teaspoon garlic powder",
      "▢ 3 teaspoons salt this will be used when boiling chicken and macaroni, and as a seasoning",
      "▢ 1/4 teaspoon ground black pepper",
      "▢ Water for boiling"
    ],
    "instructions": [
      "Prepare the chicken. Start to boil the chicken by pouring 1 quart water on a cooking pot over a stove top. Apply heat and let boil. Add 1 teaspoon salt and put the chicken breasts into the pot. Cover and boil in medium heat for 22 minutes. Remove chicken from the pot. Let it cool down. Manually shred into pieces and set aside.",
      "Prepare the macaroni by following package instructions. Boil 3 quarts water in a pot. Add 1 teaspoon salt. Pour the macaroni into the pot. Stir. Cover the pot and continue to boil the macaroni in medium heat for 9 minutes or until al dente. Make sure to stir every 3 minutes to prevent the macaroni from sticking to each other. Drain the water. Set macaroni aside.",
      "Arrange Macaroni in a large mixing bowl. Add shredded chicken. Toss.",
      "Put-in pineapple, pimiento, green bell pepper, raisins, carrot, sweet relish, and cheese. Toss until ingredients are blended.",
      "Add lady’s Choice Mayonnaise and garlic powder. Gently toss until well blended.",
      "Season with salt and ground black pepper.",
      "Serve! Share with the family and enjoy."
    ],
    "cooking_time": "45 minutes",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/filipino-chicken-macaroni-salad-recipe/",
    "image_url": "",
    "image_path": "",
    "category": "Chicken Dishes"
  },
  {
    "title": "Ube Halaya with Cheese",
    "ingredients": [
      "▢ 1 lb. grated purple yam",
      "▢ 1 14 oz. can condensed milk",
      "▢ 2 cups coconut milk",
      "▢ 3 tablespoons butter",
      "▢ 1 teaspoon ube flavoring",
      "▢ 1/2 cup shredded cheddar cheese"
    ],
    "instructions": [
      "Pour coconut milk in a cooking pot. Let boil.",
      "Stir and add the condensed milk.",
      "Once the mixture starts to boil, add the grated purple yam and ube flavoring. Continue to cook in medium heat while continuously stirring for 30 minutes.",
      "Add butter. Stir. Cook until the mixture reaches your desired thickness. (I usually cook it for 10 to 12 minutes after adding butter).",
      "Transfer to a container. Top with shredded cheese.",
      "Serve. Share and enjoy!"
    ],
    "cooking_time": "50 minutes",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/ube-halaya-with-cheese-recipe/",
    "image_url": "",
    "image_path": "",
    "category": "Other Filipino Dishes"
  },
  {
    "title": "Sinigang Mix Inasal na Manok",
    "ingredients": [
      "▢ 1 whole  chicken",
      "▢ 2 1/2 tablespoons Knorr Sinigang sa Sampaloc Recipe Mix Original",
      "▢ 1 head garlic",
      "▢ 3 thumbs ginger",
      "▢ 1 stalk lemongrass chopped",
      "▢ 1 1/2 cups lemon lime soda",
      "▢ 1 1/2 teaspoons salt",
      "▢ 1/2 teaspoon ground black pepper",
      "▢ 8 tablespoons margarine",
      "▢ 2 1/2 tablespoons annatto seeds"
    ],
    "instructions": [
      "Cut the chicken into serving pieces. A whole piece of chicken can be cut into 4 parts. See video below for tips.",
      "Prepare the marinade ingredients by grinding garlic, lemongrass, and ginger using a mortar and pestle tool. Arrange in a large bowl. Add salt, ground black pepper, Knorr Sinigang sa Sampaloc Recipe Mix, and lemon lime soda. Mix well.",
      "Place the chicken inside a resealable bag. Pour-in marinade. Let the air out and then seal the bag. Let the chicken stay for at least 2 hours.",
      "Prepare basting sauce by Heating a saucepan. Add margarine. Let it melt. Add annatto seeds. Cook the seeds in low heat until the color of the mixture turns orange. Filter the seeds using a kitchen sieve. Note: Discard the seeds after filtering. Season with salt and ground black pepper.",
      "Heat-up your grill. You can use either gas o charcoal grill for this process.",
      "Remove the chicken from the bag.",
      "Grill chicken while flipping it every 5 minutes (or until needed) until the inner temperature reaches 165F. Brush basting sauce over the chicken while grilling.",
      "Serve with warm rice, papaya atchara, and with your favorite dipping sauce.",
      "Share and enjoy!"
    ],
    "cooking_time": "N/A",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/sinigang-mix-inasal-na-manok/",
    "image_url": "",
    "image_path": "",
    "category": "Chicken Dishes"
  },
  {
    "title": "Pork Katsu Curry",
    "ingredients": [
      "▢ 3 pieces pork chops",
      "▢ 1 ½ cups cooking oil",
      "▢ 3 cups cooked white rice",
      "▢ 2 cups water",
      "▢ 2 cups ice cubes",
      "▢ 1/4 cup salt",
      "▢ 2 tablespoons brown sugar",
      "▢ 2 pieces dried bay leaves",
      "▢ ½ cup all-purpose flour",
      "▢ 1 ½ cup Panko breadcrumbs",
      "▢ 2 pieces eggs beaten",
      "▢ 1 piece Knorr Pork Cube",
      "▢ 1 piece onion chopped",
      "▢ 1 piece carrot sliced",
      "▢ 1 piece potato cubed",
      "▢ 1 teaspoon ginger grated",
      "▢ 1 clove garlic grated",
      "▢ ½ piece apple peeled and grated",
      "▢ 1 tablespoon curry powder",
      "▢ 1 tablespoon garam masala",
      "▢ 5 tablespoons butter",
      "▢ 4 tablespoons all-purpose flour",
      "▢ 2 ¾ cups water",
      "▢ Salt and ground black pepper to taste"
    ],
    "instructions": [
      "Make the brine by combining all brine ingredients in a cooking pot, except for the ice cubes. Let it boil. Stir until sugar and salt dilutes completely. Let it cool down. Combine brine solution and ice cubes.",
      "Arrange pork chops in a resealable plastic bag and then pour the brine solution with ice cubes in it. Seal the bag. Refrigerate for not more than 8 hours.",
      "Make the curry sauce by melting 2 tablespoons butter in a pan. Add onion. Cook until the texture becomes soft.  Add garlic and ginger. Stir and then add carrot and potato. Continue cooking for 1 minute. Add apple and 1 cup water. Let boil. Cover and cook for 6 minutes. Set aside.",
      "Make the roux by melting 3 tablespoons of butter in a cooking pot. Add all-purpose flour. Stir and continue cooking for 4 minutes. Add curry powder and garam masala. Cook while stirring for a minute. Pour 1 ¾ cups water in the cooking pot. Stir until mixture thickens.  Add Knorr Pork Cube. Stir. Add the contents of the pot with potato and onion. Continue cooking for 3 to 5 minutes. Season with salt and ground black pepper. Set aside.",
      "Make the pork tonkatsu by rinsing pork with running water. Pat dry using paper towels.",
      "Heat oil in a cooking pot to 350F. While oil is heating, dredge a piece of pork chop in flour. Shake-off excess. Dip in beaten egg and the dredge in Panko breadcrumbs. Dip again in egg and then dredge in breadcrumbs once more.",
      "Deep fry breaded pork chop until the outer part turns golden brown and internal temperature reads 145F or more. Remove from the pot and let it cool down. Slice into serving pieces.",
      "Arrange a cup of rice on a plate. Top with sliced pork tonkatsu and then pour curry sauce on top.",
      "Serve warm. Share and enjoy!"
    ],
    "cooking_time": "N/A",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/pork-katsu-curry/",
    "image_url": "",
    "image_path": "",
    "category": "Pork Dishes"
  },
  {
    "title": "Ginataang Talong with Malunggay and Tofu",
    "ingredients": [
      "▢ 2 pieces eggplants sliced",
      "▢ 40 grams Knorr Ginataang Gulay Recipe Mix",
      "▢ 8 ounces extra firm tofu air fried for 10 minutes",
      "▢ 1 cup malunggay leaves",
      "▢ 2 cups water",
      "▢ 1 piece onion chopped",
      "▢ 4 cloves garlic chopped",
      "▢ 3 tablespoons cooking oil",
      "▢ Ground black pepper to taste",
      "▢ Salt to taste"
    ],
    "instructions": [
      "Heat oil in a pan. Saute garlic and onion until the later softens.",
      "Prepare the coconut milk by combining water and Knorr Ginataang Gulay Recipe Mix. Stir until the mixture gets well blended.",
      "Pour coconut milk into the pan. Cover and let it boil.",
      "Add eggplant. Cover the pan and cook for 8 minutes.",
      "Add air fried tofu. Stir and cook for 3 minutes.",
      "Add malunggay leaves. Stir and continue cooking for 1 minute.",
      "Season with ground black pepper and salt as needed.",
      "Serve. Share and enjoy!"
    ],
    "cooking_time": "N/A",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/ginataang-talong-with-malunggay-and-tofu/",
    "image_url": "",
    "image_path": "",
    "category": "Vegetable Dishes"
  },
  {
    "title": "Bicol Express Recipe",
    "ingredients": [
      "▢ 2 lbs. pork belly sliced into strips",
      "▢ 2 cups coconut milk",
      "▢ 2 cups  coconut cream",
      "▢ 1/4  cup shrimp paste or salted Krill",
      "▢ 5 cloves garlic crushed",
      "▢ 5 pieces Thai chili pepper chopped",
      "▢ 2 thumbs ginger minced",
      "▢ 1 piece onion chopped",
      "▢ 2 pieces Serrano pepper sliced",
      "▢ 1  cup water optional",
      "▢ 8  grams Maggi Magic Sarap"
    ],
    "instructions": [
      "Combine pork, ginger, garlic, onion, Thai chili pepper, long green pepper, and coconut milk in a pan. Mix well. Cover the pan and turn the heat to on. Let the mixture boil.2 lbs. pork belly, 2 cups coconut milk, 1/4  cup shrimp paste, 5 cloves garlic, 5 pieces Thai chili pepper, 2 thumbs ginger, 1 piece onion, 2 pieces Serrano pepper",
      "Stir and adjust the heat to low. Cover and simmer for 50 minutes. Note: add water as necessary1  cup water",
      "Add the remaining coconut cream and bagoong alamang (as needed). Season with Maggi Magic Sarap.  Continue cooking in low heat until the sauce thickens (around2 cups  coconut cream, 8  grams Maggi Magic Sarap",
      "Transfer to a serving plate and serve with warm rice."
    ],
    "cooking_time": "1 hour",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/bicol-express/",
    "image_url": "",
    "image_path": "",
    "category": "Pork Dishes"
  },
  {
    "title": "Chicken Gravy",
    "ingredients": [
      "▢ 3 tablespoons butter",
      "▢ 4 tablespoons all-purpose flour",
      "▢ 1 piece Knorr Chicken Cube",
      "▢ 1/2 teaspoon onion powder",
      "▢ 1/4 teaspoon garlic powder",
      "▢ 1/8 teaspoon ground black pepper",
      "▢ 1 3/4 cup water"
    ],
    "instructions": [
      "Make the gravy by melting butter in a saucepan.",
      "Add all-purpose flour. Cook in medium heat while stirring for 8 minutes to make a brown roux.",
      "Add Knorr Chicken Cube. Stir until melted.",
      "Pour water into the saucepan. Stir until well blended. Add onion powder, garlic powder, and ground black pepper. Stir. Cook for 1 minute.",
      "Serve with fried chicken."
    ],
    "cooking_time": "N/A",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/chicken-gravy/",
    "image_url": "",
    "image_path": "",
    "category": "Chicken Dishes"
  },
  {
    "title": "Crispy Pork Belly Chips",
    "ingredients": [
      "▢ 1 ½ lbs. pork belly",
      "▢ 3 tablespoons Knorr Liquid Seasoning",
      "▢ 6 cups water",
      "▢ 3 pieces dried bay leaves",
      "▢ 1 teaspoon whole peppercorn"
    ],
    "instructions": [
      "Combine pork belly, water, whole peppercorn, and dried bay leaves in a cooking pot. Cover the pot and let it boil. Adjust heat between low and medium. Continue boiling for 60 minutes.",
      "Remove pork from the pot. Let it cool down. Slice into thin pieces. Note: I usually freeze the pork for 1 ½ hours before slicing it. This method will harden the meat and fat by a bit. It helps prevent the meat from wobbling when sliced.",
      "Combine sliced pork and Knorr Liquid Seasoning. Mix well.",
      "Arrange pork on an air fryer. Set the air fryer to 350F and air fry for 20 minutes or until pork becomes crispy. Note: Make sure to flip the pork slices in the middle of the cooking process. This will ensure that both sides are cooked properly."
    ],
    "cooking_time": "N/A",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/crispy-pork-belly-chips/",
    "image_url": "",
    "image_path": "",
    "category": "Pork Dishes"
  },
  {
    "title": "Chop Suey",
    "ingredients": [
      "▢ 7 pieces shrimp cleaned and deveined",
      "▢ 3 ounces pork sliced",
      "▢ 3 ounces boneless chicken breast sliced",
      "▢ 1 ½ cup cauliflower florets",
      "▢ 1 piece carrot sliced crosswise into thin pieces",
      "▢ 15 pieces snow peas",
      "▢ 8 pieces baby corn",
      "▢ 1 piece red bell pepper sliced into squares",
      "▢ 1 piece green bell pepper sliced into squares",
      "▢ 1 ½ cups cabbage chopped",
      "▢ 12 pieces quail eggs boiled",
      "▢ 1 piece yellow onion sliced",
      "▢ 4 cloves garlic crushed",
      "▢ ¼ cup soy sauce",
      "▢ 1 ½ tablespoons oyster sauce",
      "▢ ¾ cup water",
      "▢ 1 tablespoon cornstarch diluted in ½ cup water",
      "▢ ¼ teaspoon ground black pepper",
      "▢ 3 tablespoons cooking oil"
    ],
    "instructions": [
      "Heat oil in a wok or pan.",
      "Pan fry the shrimp for 1 minute per side. Remove from the wok. Set aside.",
      "Saute onion. Add garlic and continue to saute until the onion becomes soft.",
      "Add pork and chicken. Stir fry until light brown.",
      "Add soy sauce and oyster sauce. Stir.",
      "Pour water. Let boil. Cover and cook in medium heat for 15 minutes.",
      "Add cauliflower, carrots, bell peppers, snow peas, and young corn. Stir.",
      "Add cabbage. Toss. Cover and cook for 5 to 7 minutes.",
      "Put the pan-fried shrimp into the pot and add ground black pepper.",
      "Add the boiled quail eggs and cornstarch diluted in water. Toss.",
      "Transfer to a serving plate. Serve.",
      "Share and enjoy!"
    ],
    "cooking_time": "40 minutes",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/chop-suey/",
    "image_url": "",
    "image_path": "",
    "category": "Pork Dishes"
  },
  {
    "title": "Leche Flan Recipe",
    "ingredients": [
      "▢ 10 pieces eggs",
      "▢ 1 can condensed milk (14 oz)",
      "▢ 1 cup fresh milk or evaporated milk",
      "▢ 1 cup granulated sugar",
      "▢ 1 teaspoon vanilla extract"
    ],
    "instructions": [
      "Using all the eggs, separate the yolk from the egg white (only egg yolks will be used).",
      "Place the egg yolks in a big bowl then beat them using a fork or an egg beater",
      "Add the condensed milk and mix thoroughly",
      "Pour-in the fresh milk and Vanilla. Mix well",
      "Put the mold (llanera) on top of the stove and heat using low fire",
      "Put-in the granulated sugar on the mold and mix thoroughly until the solid sugar turns into liquid (caramel) having a light brown color. Note: Sometimes it is hard to find a Llanera (Traditional flan mold) depending on your location. I find it more convenient to use individual Round Pans in making leche flan.",
      "Spread the caramel (liquid sugar) evenly on the flat side of the mold",
      "Wait for 5 minutes then pour the egg yolk and milk mixture on the mold",
      "Cover the top of the mold using an Aluminum foil",
      "Steam the mold with egg and milk mixture for 30 to 35 minutes.",
      "After steaming, let the temperature cool down then refrigerate",
      "Serve for dessert. Share and Enjoy!"
    ],
    "cooking_time": "55 minutes",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/leche-flan/",
    "image_url": "",
    "image_path": "",
    "category": "Desserts"
  }
]