[
  {
    "title": "Relyenong Talong with Tuna",
    "ingredients": [
      "▢ 3  eggplants large",
      "▢ 2 teaspoons Knorr Liquid Seasoning",
      "▢ 2 eggs",
      "▢ 12 ounces tuna in can",
      "▢ 1 bell pepper chopped",
      "▢ ½ cup carrot minced",
      "▢ 1 onion",
      "▢ 2 cloves garlic chopped",
      "▢ ½ cup cooking oil",
      "▢ 1/2  cup  green onion chopepd"
    ],
    "instructions": [
      "Slice the eggplants crosswise, half an inch thick. Create eggplant rings by cutting around the inside part of each sliced eggplant. Chop the part that has been cut-out and set it aside.",
      "Heat 3 tablespoons of cooking oil in a pan. Sauté onion and garlic. Add tuna and chopped eggplant once the onion softens. Cook for 3 to 5 minutes. Season with Knorr Liquid Seasoning. Transfer to a mixing bowl and let it cool down.",
      "Beat the eggs and add it to the cooked mixture in the bowl. Also add half of the carrot, green onions, and bell peppers. Mix well.",
      "Heat the remaining oil. Fry one side of the eggplant rings for 1 minute.",
      "Turn the eggplant over to cook the opposite side. Sprinkle some minced carrot, bell pepper, and green onions in each ring. Top it with a scoop of tuna mixture. Gently spread the mixture within the ring. Set your stove to medium heat and continue cooking for 2 minutes.",
      "Top the mixture with minced carrot, bell pepper, and green onions. Turn it over and cook the other side for 2 to 3 minutes. Remove the relyenong talong from the pan and arrange it on a serving plate. Serve with banana ketchup. Share and enjoy!"
    ],
    "cooking_time": "N/A",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/relyenong-talong-with-tuna/",
    "image_url": "",
    "image_path": "",
    "category": "Other Filipino Dishes"
  },
  {
    "title": "Special Lunch Menu",
    "ingredients": [
      "▢ 1 kg. pork belly",
      "▢ Knorr Liquid Seasoning",
      "▢ 5 Calamansi",
      "▢ 8 cloves garlic",
      "▢ 1 kg. large squid",
      "▢ Knorr Liquid Seasoning",
      "▢ 3 tomatoes diced",
      "▢ 1 red onion diced",
      "▢ 1 thumb  ginger grated",
      "▢ 4 eggplants grilled",
      "▢ 3 tomatoes diced",
      "▢ 1 red onion diced",
      "▢ 3 tablespoons white vinegar",
      "▢ 1 teaspoon sugar",
      "▢ Salt and ground black pepper to taste",
      "▢ 1 cup fresh milk",
      "▢ 4 cups Selecta Vanilla Ice Cream",
      "▢ Whipping cream"
    ],
    "instructions": [
      "Prepare the pork by combining the pork belly, Knorr Liquid Seasoning, and calamansi. Mix well. Marinate for at least 30 minutes.",
      "Make the ensaladang talong by combining diced tomato and onion in a bowl. Mix well. Divide this into two equal parts. Put the other half into a separate bowl. Set it aside for now. This will be used for the ensalada later.",
      "Meanwhile, work on the other bowl by adding Knorr Liquid seasoning and squeezing 2 pieces of calamansi. Mix well. This will be used as stuffing for the squid. Stuff the squid with the mixture and heat-up your grill.",
      "Grill the eggplants until the inside part softens. Let it cool down and peel the skin off. Mash the eggplant and combine with the first bowl with tomato and onion. Combine white vinegar, ground black pepper, and sugar. Mix well. Pour thus into the bowl with eggplant. Toss until well blended. Top with bagoong alamang.",
      "Grill the squid until it gets cooked completely. Remember to not overcook it as it can get tough. Remove from the grill and arrange on a serving plate.",
      "Start grilling the pork belly. You can make the basting sauce by combining Knorr Liquid Seasoning, calamansi, banana ketchup, and 2 teaspoons of cooking oil. Continue grilling the pork and turn it over every few minutes while basting until it gets completely cooked. Slice into serving pieces and arrange on a clean plate.",
      "Make the milk shake by scooping 4 cups of Selecta ice cream in a blener. Add milk. Blend for 30 seconds. Transfer to a tall glass. Top with whip cream.",
      "Serve everything together with lots of rice on the side. Share and enjoy!"
    ],
    "cooking_time": "N/A",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/special-lunch-menu/",
    "image_url": "",
    "image_path": "",
    "category": "Pork Dishes"
  },
  {
    "title": "Crispy Cabbage Rolls",
    "ingredients": [
      "▢ 12 Napa cabbage Leaves",
      "▢ 4 cups water",
      "▢ 3 cups ice cold water",
      "▢ 1 ½ cups panko breadcrumbs",
      "▢ 2 eggs  beaten",
      "▢ ½ cup all-purpose flour",
      "▢ 1 cup cooking oil",
      "▢ 1 teaspoon salt",
      "▢ 1 Knorr Pork Cube",
      "▢ 1 egg",
      "▢ 5 tablespoons all-purpose flour",
      "▢ ½ cup carrot minced",
      "▢ ½ cup green onion minced",
      "▢ 1 lb. ground pork",
      "▢ 1 onion chopped",
      "▢ 5 cloves garlic chopped",
      "▢ 2 tablespoons soy sauce",
      "▢ 2 teaspoons sesame oil",
      "▢ Salt and ground black pepper to taste",
      "▢ 3 tablespoons cooking oil"
    ],
    "instructions": [
      "Boil 4 cups of water in a cooking pot. Add 1 teaspoon salt.",
      "Put the Napa cabbage in the pot. Boil for 1 minute. Pour cold water in a large bowl. Remove the cabbage from the pot and submerge it into the cold water until it cools-down. Remove and dry the cabbage. Set aside.",
      "Cook the meat filling by heating 3 tablespoons of cooking oil in a pan. Sauté the garlic until it starts to brown. Add onion. Cook until the onion softens. Add the ground pork and continue cooking while stirring until the pork turns light brown. Add Knorr Pork Cube and then cook for 2 minutes. Season with salt and ground black pepper. Transfer to a large bowl. Let it cool down.",
      "Add minced carrot, minced green onion, egg, all-purpose flour, soy sauce, and sesame oil. Mix well.",
      "Scoop 3 tablespoons of the meat mixture and arrange it over a piece of Napa cabbage. Secure the filling by folding both sided of the cabbage inwards and roll until the filling is completely covered. Secure by inserting a toothpick into the cabbage roll.",
      "Start to fry the cabbage rolls by heating cooking oil in a pan. Meanwhile, dredge the cabbage roll in all-purpose flour, dip in beaten egg, and dredge in panko breadcrumbs until completely coated. Fry one side until it turns golden brown. Turn it over and do the same on the opposite side. Remove from the pan place over a plate lined with paper towel or on a wire rack. Let it cool down.",
      "Slice the cabbage rolls into bite-sized pieces. Serve with your favorite dipping sauce. Share and enjoy!"
    ],
    "cooking_time": "N/A",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/crispy-cabbage-rolls/",
    "image_url": "",
    "image_path": "",
    "category": "Pork Dishes"
  },
  {
    "title": "Butter Garlic Whole Fried Chicken",
    "ingredients": [
      "▢ 1 whole  chicken",
      "▢ 2 heads  garlic chopped",
      "▢ 1 egg",
      "▢ 2 tablespoons Knorr Liquid Seasoning",
      "▢ 1 teaspoon ground black pepper",
      "▢ 1 tablespoon fresh milk",
      "▢ 1 tablespoon water",
      "▢ 1 cup all-purpose flour",
      "▢ ½ cup unsalted butter melted",
      "▢ 2 tablespoons parsley chopped",
      "▢ 3 cups cooking oil",
      "▢ Salt and ground black pepper to taste."
    ],
    "instructions": [
      "Spatchcock the chicken. Rub Knorr liquid seasoning all over. Let it stay for 30 minutes.",
      "Meanwhile, combine garlic and 1 cup cooking oil in a small pot. Cook in low heat setting until the garlic turns golden brown. Filter the garlic using a kitchen strainer. Set both the toasted garlic and garlic oil aside.",
      "Crack the egg in a bowl and add milk. Whisk until well blended. Spread the mixture all over the chicken.",
      "Dredge the chicken in flour.  Make sure that the chicken gets completely coated with flour. Let it stay for 10 minutes. This will ensure that the flour sticks will stick well.",
      "Combine garlic oil with 2 cups cooking oil. Heat to 325F.",
      "Deep-fry the chicken for 13 to 16 minutes. Set aside.",
      "Make the butter mixture by melting 2 tablespoons of butter in a saucepan. Add salt, ground black pepper, parsley, and water. Turn off heat.",
      "Arrange the chicken on a serving plate. Spoon the butter mixture and top with lots of toasted garlic. Serve. Share and enjoy!"
    ],
    "cooking_time": "N/A",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/butter-garlic-whole-fried-chicken/",
    "image_url": "",
    "image_path": "",
    "category": "Chicken Dishes"
  },
  {
    "title": "Kinamatisang Manok",
    "ingredients": [
      "▢ 1 lb. chicken cut into serving pieces",
      "▢ 4 tomatoes sliced into wedges",
      "▢ 1 Knorr Chicken Cube",
      "▢ 2 bunches  bok choy",
      "▢ 3 long green chili peppers",
      "▢ 1 onion sliced",
      "▢ 3 thumbs  ginger crushed",
      "▢ 3 cloves garlic chopped",
      "▢ 2 cups water",
      "▢ 3 tablespoons cooking oil",
      "▢ Fish sauce and ground black pepper to taste"
    ],
    "instructions": [
      "Heat oil in a cooking pot. Sauté garlic until it starts to brown.",
      "Add onion and ginger. Continue cooking until the onion softens.",
      "Put the chicken pieces into the pot. Cook each side for 1 minute.",
      "Stir-in half of the tomatoes. Cook for 2 minutes.",
      "Pour the water and let boil.",
      "Add Knorr Chicken Cube and 2 teaspoons of fish sauce. Cover the pot and adjust the heat to low setting. Boil the chicken for 20 minutes.",
      "Add remaining tomatoes, long green pepper, and bok choy. Cover and cook for 3 minutes.",
      "Season with ground black pepper and fish sauce as needed.",
      "Serve warm with rice. Share and enjoy!"
    ],
    "cooking_time": "N/A",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/kinamatisang-manok/",
    "image_url": "",
    "image_path": "",
    "category": "Chicken Dishes"
  },
  {
    "title": "Fish Sinigang Recipe",
    "ingredients": [
      "▢ 2 lbs. salmon head",
      "▢ 23 grams Knorr sinigang sa Sampaloc with Miso",
      "▢ 1 bunch  mustard leaves",
      "▢ 1 daikon radish",
      "▢ 3 long green peppers",
      "▢ 2 tomatoes",
      "▢ 8 okras",
      "▢ 1 onion",
      "▢ 3 cloves garlic",
      "▢ 2 thumbs ginger",
      "▢ cooking oil",
      "▢ ground black pepper",
      "▢ water",
      "▢ fish sauce to taste"
    ],
    "instructions": [
      "Heat cooking oil in a cooking pot. Saute onion, garlic, and ginger.",
      "Add the salmon once the onion softens. Pour the water and let it boil.",
      "Add Knorr sinigang sa Sampaloc with Miso and daikon radish. Cover and continue cooking in low heat for 5 minutes.",
      "Add okra, long green pepper, and tomatoes. Cook for 5 minutes.",
      "Season with ground black pepper and fish sauce.",
      "Add the mustard leaves. Cook for 2 minutes.",
      "Transfer to a serving bowl. Serve hot.",
      "Share and enjoy!"
    ],
    "cooking_time": "N/A",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/fish-sinigang-recipe/",
    "image_url": "",
    "image_path": "",
    "category": "Seafood"
  },
  {
    "title": "Ginataang Sitaw at Kalabasa with Fried Tilapia",
    "ingredients": [
      "▢ 3 lbs. tilapia cleaned and scales removed",
      "▢ 45 grams Knorr Ginataang Gulay Mix",
      "▢ 1 lb. calabaza squash sliced",
      "▢ 12 string beans cut in 2-inch length pieces",
      "▢ 1 onion chopped",
      "▢ 4 cloves garlic crushed and chopped",
      "▢ 1 ½ cups water",
      "▢ 1 cup cooking oil",
      "▢ 3 tablespoons salt"
    ],
    "instructions": [
      "Prepare the fish by washing it thoroughly. Let it dry. Rub salt all over it and into the cavity.",
      "Heat 1 cup cooking oil in a pan. Fry one side of the fish until it gets golden brown and crispy. Turn it over and do the same procedure on the opposite side. Remove from the pan arrange on a serving plate. Set aside.",
      "Cook the ginataang sitaw by sauteeing garlic and onion in a pan.",
      "Add the sliced calabaza squash (kalabasa). Stir-fry for 2 minutes.",
      "Add the string beans. Cook while occasionally stirring for 2 minutes.",
      "Combine Knorr Ginataang Gulay Mix and 1 ½ cups water. Stir and pour it into the pan. Cover the pan with a lid and let the liquid boil. Cook for 5 to 7 minutes.",
      "You can season with salt and ground black pepper as needed.",
      "Serve with rice and fried tilapia. Share and enjoy!"
    ],
    "cooking_time": "N/A",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/ginataang-sitaw-at-kalabasa-with-fried-tilapia/",
    "image_url": "",
    "image_path": "",
    "category": "Vegetable Dishes"
  },
  {
    "title": "Pork Monggo with Crispy Galunggong",
    "ingredients": [
      "▢ 1 ½ cups mung beans",
      "▢ 1 Knorr Pork Cube",
      "▢ 4 ounces pork cut into small pieces",
      "▢ 1 bunch  hot pepper leaves",
      "▢ 4 cloves garlic chopped",
      "▢ 1 onion chopped",
      "▢ 2 tomatoes diced",
      "▢ 5 cups water",
      "▢ 3 tablespoons cooking oil",
      "▢ Fish sauce and ground black pepper to taste",
      "▢ 2 lbs. round scad galunggong, cleaned",
      "▢ 3 tablespoons salt",
      "▢ 1 cup cooking oil"
    ],
    "instructions": [
      "Start to tenderize the mung beans by boiling 4 cups of water in a cooking pot. Add the mung beans. Cover and cook in low heat setting until it softens.",
      "Meanwhile, prepare the fish by rubbing salt all over it, including the cavity. Heat 1 cups of cooking oil in a pan. Fry the fish until it gets crispy. Set aside.",
      "Cook the pork monggo by heating 3 tablespoons of cooking oil that you used to fry the fish. Saute garlic, onion, and tomato.",
      "Once the onion softens, add the pork. Cook it until it starts to brown. Pour 1 cup water. Let it boil. Cover and continue cooking for 10 minutes.",
      "Add the softened mung beans and more water as needed. Stir and cook for 5 minutes.",
      "Add hot pepper leaves and season with fish sauce and ground black pepper.",
      "Transfer to a serving bowl. Serve with warm rice and fried galunggong. Share and enjoy!"
    ],
    "cooking_time": "N/A",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/pork-monggo-with-crispy-galunggong/",
    "image_url": "",
    "image_path": "",
    "category": "Pork Dishes"
  },
  {
    "title": "Sinarsahang Pork Ribs",
    "ingredients": [
      "▢ 3 lbs. pork ribs (note 1)",
      "▢ 1 Knorr Pork cube",
      "▢ 12 string beans (note 2)",
      "▢ 1 carrot (note 3)",
      "▢ 3 ounces tomato paste",
      "▢ 3 tablespoons soy sauce",
      "▢ 1 onion chopped",
      "▢ 5 cloves garlic minced",
      "▢ 2 tablespoons butter",
      "▢ ½ teaspoon white sugar",
      "▢ 2 cups water",
      "▢ 3 tablespoons cooking oil",
      "▢ Salt and ground black pepper to taste"
    ],
    "instructions": [
      "Steam string beans and carrots for 3 minutes. Set aside.",
      "Heat the cooking oil in a pan. Sauté the onion and garlic until the onion softens.",
      "Put the pork ribs in the pan. Sauté until it turns light brown.",
      "Pour the soy sauce, add tomato sauce, and water. Let boil.",
      "Add Knorr Pork Cube. Cover the pan. Simmer until the pork tenderizes completely.",
      "Add the butter. Continue simmering uncovered until the sauce reduces to half.",
      "Add sugar and season with salt and ground black pepper.",
      "Transfer to a serving plate. Serve with steamed vegetables.",
      "Serve. Share and enjoy!"
    ],
    "cooking_time": "N/A",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/pork-ribs/",
    "image_url": "",
    "image_path": "",
    "category": "Pork Dishes"
  },
  {
    "title": "How to Cook Sotanghon Guisado",
    "ingredients": [
      "▢ 6 ounces pork shoulder sliced",
      "▢ 1 Knorr Shrimp Cube",
      "▢ 300 grams vermicelli (note 1)",
      "▢ ½ head cabbage (note 2)",
      "▢ 1 carrot (note 3)",
      "▢ 1 red bell pepper (note 4)",
      "▢ 1 bunch green onion (note 5)",
      "▢ 3 ounces snow peas",
      "▢ 1 onion chopped",
      "▢ 8 cloves garlic crushed",
      "▢ 2 teaspoons annatto seeds",
      "▢ ¼ cup soy sauce",
      "▢ 1 cup water",
      "▢ ¼ cup cooking oil",
      "▢ Fish sauce and ground black pepper to taste"
    ],
    "instructions": [
      "Soak sotanghon in water for 10 to 12 minutes.",
      "Heat cooking oil in a pan. Add the crushed garlic. Continue cooking until the garlic browns. Remove the garlic. Set aside.",
      "Make the annatto oil by adding annatto seeds into the pan with the garlic infused oil. Stir until the oil turns orange in color (around 10 seconds). Remove the seeds and discard.",
      "Saute the pork using the garlic infused annatto oil until it browns.",
      "Reduce the oil by removing part of it until around 3 tablespoons are left. Continue cooking by sautéing the onion until it softens.",
      "Add carrots. Cook for 1 minute and then add soy sauce and ½ cup water. Let boil.",
      "Add Knorr Shrimp Cube, cabbage, snow peas, and bell pepper. Stir and cook for 2 minutes.",
      "Put the sotanghon into the pan. Gently toss until all the ingredients are well blended.",
      "Add remaining water. Cover and continue cooking in low heat for 3 minutes.",
      "Add green onions and season with fish sauce and ground black pepper.",
      "Sprinkle the toasted garlic on top.",
      "Transfer to a serving plate. Serve. Share and enjoy!"
    ],
    "cooking_time": "N/A",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/how-to-cook-sotanghon-guisado/",
    "image_url": "",
    "image_path": "",
    "category": "Noodles"
  },
  {
    "title": "Balbacua Recipe",
    "ingredients": [
      "▢ 5 lbs. cow trotters",
      "▢ 1 Knorr Beef Cube",
      "▢ 1 bunch  lemongrass (white part) cut in 4-inch pieces",
      "▢ 1 bell pepper sliced",
      "▢ 3 tablespoons salted black beans",
      "▢ 1 bunch  green onions cut in 2-inch pieces",
      "▢ 3 Jalapeno pepper",
      "▢ 1 teaspoon ground black pepper",
      "▢ 8 ounces tomato sauce",
      "▢ 10 cups water",
      "▢ 2 teaspoons annatto powder",
      "▢ 5 cloves garlic crushed",
      "▢ 1 onion chopped",
      "▢ 2 knobs ginger crushed",
      "▢ Fish sauce to taste",
      "▢ 3 tablespoons cooking oil"
    ],
    "instructions": [
      "Heat oil in a pan. Sauté garlic, onion, and ginger until the onion softens. Set aside.",
      "Combine trotters, 10 cups water, ground black pepper, and lemongrass in a cooking pot. Let it boil. Adjust the stove to the lowest heat setting and then simmer for 3 hours or until the meat and fibers on the trotters soften.",
      "Remove the lemongrass. Add the annatto powder, sauteed aromatics (onion, garlic, and ginger), salted black beans, and Knorr Beef Cube. Continue cooking for 30 minutes.",
      "Add jalapeno, bell pepper, and green onions. Cook for 10 minutes."
    ],
    "cooking_time": "N/A",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/balbacua-recipe/",
    "image_url": "",
    "image_path": "",
    "category": "Seafood"
  },
  {
    "title": "Ginataang Mais at Malagkit (Sweet Corn and Glutinous Rice Porridge)",
    "ingredients": [
      "▢ 2 cups coconut cream",
      "▢ 2 cups coconut milk",
      "▢ 1/2 cup glutinous rice malagkit",
      "▢ 1 cup sweet corn chopped",
      "▢ 1/2 to 3/4 cup granulated white sugar",
      "▢ 1 teaspoon vanilla extract",
      "▢ a pinch of salt"
    ],
    "instructions": [
      "Pour coconut milk and coconut cream in a cooking pot. Let it boil.",
      "Once it starts to boil, add glutinous rice. Stir continously for 10 minutes.",
      "Add sugar. Stir.",
      "Add sweetcorn into the pot. Stir and continue to cook in low heat for 8 minutes. Note you can cook this longer to make the corn and rice softer.",
      "Add vanilla extract and salt. Stir.",
      "Transfer to a serving bowl. Serve",
      "Share and enjoy!"
    ],
    "cooking_time": "30 minutes",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/ginataang-mais-at-malagkit-sweet-corn/",
    "image_url": "",
    "image_path": "",
    "category": "Other Filipino Dishes"
  }
]