[
  {
    "title": "Shrimp with Butter and Taba ng Talangka Recipe – Bisita Kusina Episode 2",
    "ingredients": [
      "▢ 1 lb. shrimp cleaned",
      "▢ 5 tablespoons unsalted butter or margarine",
      "▢ 1/4 cup taba ng talangka",
      "▢ 2 pieces calamansi",
      "▢ 1 head garlic chopped",
      "▢ 1 teaspoon white vinegar",
      "▢ 1/8 teaspoon ground black pepper or cracked peppercorn",
      "▢ Salt to taste"
    ],
    "instructions": [
      "Melt butter or margarine in a pan.",
      "Add shrimp. Continue to cook for 3 to 5 minutes or until the shrimp turns orange.",
      "Add garlic. Stir fry for 30 seconds.",
      "Put the salt into the pan. Stir.",
      "Season with cracked peppercorn (or ground black pepper).",
      "Add the crab fat (taba ng talangka). Stir. Cook for 2 minutes.",
      "Pour calamansi and vinegar. Stir. Cook for 3 to 4 minutes.",
      "Transfer to a serving plate. Serve.",
      "Share and enjoy!"
    ],
    "cooking_time": "25 minutes",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/shrimp-with-butter-and-taba-ng-talangka-recipe-bisita-kusina-episode-2/",
    "image_url": "",
    "image_path": "",
    "category": "Other Filipino Dishes"
  },
  {
    "title": "Pocherong Baboy Recipe",
    "ingredients": [
      "▢ 1 ½ lbs. pork belly cut into cubes",
      "▢ 2 bunches baby bok choy",
      "▢ 4 medium ripe saba banana",
      "▢ 1 piece Chorizo de Bilbao",
      "▢ 4 medium ripe tomato wedged",
      "▢ 12 pieces long green beans",
      "▢ 1 medium potato cubed",
      "▢ 4 ounces tomato sauce",
      "▢ 1 medium yellow onion chopped",
      "▢ 3 cloves garlic crushed and chopped",
      "▢ 6 to 8 cups beef broth or pork broth",
      "▢ 2 ½ tablespoons fish sauce",
      "▢ ground white pepper to taste",
      "▢ 3 tablespoons cooking oil"
    ],
    "instructions": [
      "Heat oil in a cooking pot.",
      "Once the oil becomes hot, saute onion and garlic.",
      "Add pork belly. Continue to saute until it turns light brown.",
      "Add Chorizo de Bilbao. Cook for 1 minute.",
      "Put the tomato into the pot. Stir and pour-in tomato sauce. Continue to cook for 2 minutes.",
      "Pour beef or pork broth into the pot. Let boil. Cover and cook in low heat for 45 to 60 minutes. Note: you can add more broth or water if needed.",
      "Add banana and potato. Cover and cook for 8 minutes.",
      "Add the long green beans. Stir. Cook for 3 minutes.",
      "Put the baby bok choy into the pot. Cover. Cook for 2 minutes.",
      "Season with fish sauce and ground white pepper. Stir,",
      "Transfer to a serving bowl. Serve.",
      "Share and enjoy!"
    ],
    "cooking_time": "1 hour",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/pocherong-baboy-recipe/",
    "image_url": "",
    "image_path": "",
    "category": "Pork Dishes"
  },
  {
    "title": "How to Cook Bulalo and Tagaytay Mahogany Market Tour",
    "ingredients": [
      "▢ 7.5 lbs. Beef shank bulalo",
      "▢ 1 Knorr beef cube",
      "▢ 1 bunch Napa cabbage pechay Baguio",
      "▢ 2 pieces sweet corn divided into 3 parts",
      "▢ 15 to 20 pieces long green beans Baguio beans",
      "▢ 4 medium yellow onion wedged",
      "▢ 1 tablespoon whole peppercorn",
      "▢ 3 tablespoons fish sauce patis",
      "▢ 12 to 15 cups water"
    ],
    "instructions": [
      "Boil water in a large cooking pot.",
      "Add beef shank. Cover the pot and boil for 15 minutes.",
      "Scrape the scums out of the cooking pot. Add whole peppercorn and onion. Cover the pot. Continue to cook in low heat for 2 to 3 hours or until the beef becomes tender. Note: you can use a pressure cooker to tenderize the meat. It should only take around 45 minutes.",
      "Scoop the fats (oil) floating on top of the soup and discard.",
      "Add corn. Cover and cook for 15 minutes.",
      "Add long green beans (Baguio beans) and season with fish sauce (patis).",
      "Arrange the fresh Napa cabbage (pechay baguio) on the serving bowl. Pour hot broth and arrange the beef shank, corn, and long green beans in the bowl.",
      "Serve hot. Share and enjoy!"
    ],
    "cooking_time": "3 hours",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/how-to-cook-bulalo-and-tagaytay-mahogany-market-tour/",
    "image_url": "",
    "image_path": "",
    "category": "Soups And Stews"
  },
  {
    "title": "Calderetang Baboy Recipe",
    "ingredients": [
      "▢ 2 lbs. pork belly cubed",
      "▢ 1 small red bell pepper sliced into small squares",
      "▢ 1 small green bell pepper sliced into small squares",
      "▢ 3 medium ripe tomato wedged",
      "▢ 4 ounces Filipino style tomato sauce",
      "▢ 3 ounces liver spread",
      "▢ 2 medium potato diced",
      "▢ 1 medium carrot diced",
      "▢ 1 medium yellow onion diced",
      "▢ 4 cloves garlic crushed and chopped",
      "▢ 3 to 4 cups water",
      "▢ 6 tablespoons cooking oil",
      "▢ Salt and ground black pepper to taste"
    ],
    "instructions": [
      "Heat oil in a pan. Once the oil becomes hot, pan-fry the carrots and potato until the outer part turns light brown. This should take around 2 to 3 minutes. Set aside.",
      "Remove excess oil from the pan. Saute onion, garlic, and tomato. Continue to cook until the onion and tomato becomes soft.",
      "Add the pork belly slices into the pan. Cook until the pork turns light brown.",
      "Pour tomato sauce into the pan. Stir.",
      "Add water. Let boil. Cover and cook in low heat for 45 to 60 minutes.",
      "Add liver spread. Stir until well blended.",
      "Put the bell peppers into the pan. Stir. Continue to cook in medium heat until the sauce reduces to half.",
      "Season with salt and ground black pepper.",
      "Add the pan-fried carrot and potato. Stir and cook for 3 to 4 minutes.",
      "Transfer to a serving plate. Serve!",
      "Share and enjoy!"
    ],
    "cooking_time": "1 hour",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/calderetang-baboy-recipe/",
    "image_url": "",
    "image_path": "",
    "category": "Pork Dishes"
  },
  {
    "title": "Spicy Tokwat Baboy Recipe",
    "ingredients": [
      "▢ 1 ½ lb. pig ears",
      "▢ 3 slices 12 ounces extra firm tofu",
      "▢ ½ cup chopped onion leeks",
      "▢ 2 bunches lemongrass dahon ng tanglad",
      "▢ ½ oz. Cinnamon bark optional",
      "▢ 12 to 15 cups water",
      "▢ 3 cups cooking oil",
      "▢ 1½ cup white vinegar",
      "▢ ½ cup soy sauce",
      "▢ 2 tablespoons granulated white sugar",
      "▢ 1 ½ to 2 teaspoons salt",
      "▢ 10 to 12 pieces Thai chili pepper chopped",
      "▢ 5 pieces long green pepper siling pansigang sliced",
      "▢ 1 medium red onion sliced",
      "▢ ¼ teaspoon ground black pepper"
    ],
    "instructions": [
      "Pour 12 to 15 cups water in a cooking pot. Let boil. Add pig ears and continue to boil in medium heat for 15 minutes.",
      "Discard the water and let the pig ears cool down. Scrape thoroughly until all the hair and top skin are removed.",
      "Pour the same amount of water on the same cooking pot. (Note: make sure to throw-out the initial water used.). Let boil.",
      "Add cinnamon bark, lemongrass, and pig ears. Cover and continue to boil in medium heat for 1 hour or until the ears becomes tender. Note: add more water if needed.",
      "Meanwhile, heat oil on a pan. Fry one side of the tofu for 4 minutes. Turn it over and fry the opposite side for 4 to 5 minutes.",
      "Remove from the pan and slice the tofu into cubes. Set aside.",
      "Remove the pig ears from the pot. Let cool. Slice into serving pieces and then combine with the sliced tofu.",
      "Prepare the spicy vinegar mixture by combining salt, sugar, vinegar, and soy sauce. Stir. Microwave for 15 seconds. Continue to stir until well blended. Add chili peppers, onion, and ground black pepper to the spicy vinegar mixture. Toss.",
      "Pour the vinegar mixture all over the tokwat baboy. Toss.",
      "Top with chopped onion leeks. Serve.",
      "Share and enjoy!"
    ],
    "cooking_time": "1 hour",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/spicy-tokwat-baboy-recipe/",
    "image_url": "",
    "image_path": "",
    "category": "Pork Dishes"
  },
  {
    "title": "Oxtail Soup Recipe",
    "ingredients": [
      "▢ 2 ½ lbs. Oxtail",
      "▢ 1 Knorr Beef Cube",
      "▢ 1 bunch bok choy or pechay",
      "▢ 1 cup sliced Shiitake mushroom",
      "▢ 1 cup scallions chopped",
      "▢ 2 thumbs ginger cut into strips",
      "▢ 1 medium onion sliced",
      "▢ 3 pieces star anise",
      "▢ ½ teaspoon ground black pepper",
      "▢ 1 ½ teaspoons salt",
      "▢ 10 to 12 cups water"
    ],
    "instructions": [
      "Combine water and oxtail. Let boil. Continue to cook in medium heat for 15 minutes. Discard the water.",
      "Pour 10 to 12 cups water into the cooking pot. Add the semi-boiled oxtail, onion, ginger, and star anise. Let boil.",
      "Add Knorr beef cube. Stir. Continue to cook between low to medium heat until the oxtail becomes tender. Note: this usually takes between 2 to 3 hours. You can use a pressure cooker to make the cooking time faster. If using a pressure cooker, 35 minutes should be enough.",
      "Add the Shiitake mushroom. Cook for 15 minutes.",
      "Season with ground black pepper and salt. Stir.",
      "Add scallions and bok choy. Stir.",
      "Turn the heat off. Cover and let it stay for 5 minutes.",
      "Transfer to a serving bowl. Serve.",
      "Share and enjoy!"
    ],
    "cooking_time": "2 hours",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/oxtail-soup-recipe_knr_bc/",
    "image_url": "",
    "image_path": "",
    "category": "Soups and Stews"
  },
  {
    "title": "Crispy Bicol Express",
    "ingredients": [
      "▢ 3 lbs. pork belly",
      "▢ 1 45 g pack Knorr Ginataang Gulay Mix",
      "▢ 3 to 4 pieces long green pepper sliced",
      "▢ 8 pieces Thai chili chopped",
      "▢ 3 tablespoons alamang",
      "▢ 1 thumb ginger sliced into thin strips",
      "▢ 1 medium onion chopped",
      "▢ 3 cloves garlic chopped",
      "▢ ¼ teaspoon ground black pepper",
      "▢ 3 to 4 cups cooking oil",
      "▢ 8 cups water"
    ],
    "instructions": [
      "Pour water in a cooking pot. Let boil.",
      "Add pork belly. Continue to cook for 30 minutes. Remove the pork belly. Let it cool down.",
      "Meanwhile, prepare the Bicol express sauce by adding Knorr Ginataang Gulay Mix into the remaining water in the cooking pot. Stir until well blended.",
      "Add the onion, ginger, and garlic. Let boil.",
      "Add the long green chili pepper and Thai chili. Stir. Cook for 3 minutes.",
      "Put the alamang into the cooking pot. Stir.",
      "Season with ground black pepper. Continue to cook until the sauce reduces to half. Set aside.",
      "Continue to prepare the pork belly by rubbing salt all over it. Let is stay for at least 10 minutes.",
      "Heat oil in a deep cooking pot or deep fryer. Once the oil reaches 330F, deep-fry the pork belly for 8 minutes. Let it rest for 5 minutes. Put it back into the pot or deep fryer and continue to deep fry for 3 to 5 minutes.",
      "Remove from the pot. Slice. Arrange in a serving plate. Top with Bicol Express sauce.",
      "Serve. Share and enjoy!"
    ],
    "cooking_time": "50 minutes",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/crispy-bicol-express/",
    "image_url": "",
    "image_path": "",
    "category": "Vegetable Dishes"
  },
  {
    "title": "Chicharon Bulaklak with Spicy Vinegar",
    "ingredients": [
      "▢ 2 lbs. pork masentery bulaklak",
      "▢ a bunch of lemongrass tied into knots",
      "▢ 2 tablespoons coarse sea salt",
      "▢ 4 cups cooking oil",
      "▢ 8 cups water",
      "▢ 2 cups Sukang Paombong",
      "▢ 1 cup unrefined coconut vinegar",
      "▢ 10 to 15 pieces Thai chili pepper",
      "▢ ½ red bell pepper",
      "▢ 3 cloves garlic",
      "▢ 1 tablespoon whole peppercorn",
      "▢ 2 thumbs ginger",
      "▢ Salt to taste"
    ],
    "instructions": [
      "Prepare the chicharon bulaklak by boiling water in a cooking pot.",
      "Once the water starts to boil, add the pork masentry (bulaklak) and lemongrass. Cover and boil in medium heat for 1 hour.",
      "While the masentry is cooking, prepare the spicy vinegar. Start by adding the Thai chili pepper, garlic, whole pepperorn, and ginger in a food processor. Mince.",
      "Transfer to a large bowl and then add the unrefined coconut vinegar and sukang paombong. Add salt to taste. Stir. Tranfer to a container. Set aside. Note: serve this later with the crispy chicharon.",
      "Remove the boiled masentry from the pot. Let it cool down. Rub salt all over.",
      "Heat oil in a deep fryer or a deep coking pot. Once the reaches 330F, deep fry the bulaklak for 15 minutes. Let it rest for 5 minutes (take out from the oil).",
      "Deep fry for the second time for 3 to 5 minutes or until crispy and golden brown. Arrange on a serving plate. Serve with Spicy vinegar.",
      "Serve! Share and enjoy!"
    ],
    "cooking_time": "2 hours",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/chicharon-bulaklak-with-panlasang-pinoy-vinegar/",
    "image_url": "",
    "image_path": "",
    "category": "Pork Dishes"
  },
  {
    "title": "Sinigang na Bangus Recipe",
    "ingredients": [
      "▢ 2 lbs. bangus milkfish, cleaned and sliced",
      "▢ 1 40g pack Knorr Sinigang sa Sampaloc Mix (Original)",
      "▢ 1 bunch fresh kangkong leaves",
      "▢ 12 pieces sitaw snake beans, cut into 2 inch pieces",
      "▢ 6 to 8 pieces okra",
      "▢ 2 pieces long green pepper siling pansigang",
      "▢ 1 medium tomato wedged",
      "▢ 1 medium yellow onion wedged",
      "▢ 2 ½ tablespoons fish sauce",
      "▢ ¼ teaspoon ground black pepper",
      "▢ 2 quarts water"
    ],
    "instructions": [
      "Heat a cooking pot. Pour water into it.",
      "Add tomato and anion. Let boil.",
      "Add bangus. Cover and cook in medium heat between 8 to 12 minutes.",
      "Add Knorr Sinigang sa Sampaloc Mix. Stir. Cook for 2 minutes.",
      "Put the long green pepper into the pot. Add snake beans and okra. Stir. Cover and cook for 5 to 7 minutes.",
      "Add fish sauce and ground black pepper. Stir.",
      "Put the kangkong leaves into the pot. Cover the pot and turn the heat off. Let it stay for 5 minutes.",
      "Transfer to a serving bowl. Serve.",
      "Share and enjoy!"
    ],
    "cooking_time": "40 minutes",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/sinigang-na-bangus-recipe/",
    "image_url": "",
    "image_path": "",
    "category": "Seafood"
  },
  {
    "title": "Pata at Hipon sa Gata na May Monggo at Langka",
    "ingredients": [
      "▢ 3 lbs. pata pork hock, sliced",
      "▢ 1 lb. shrimp deveined",
      "▢ 1 Knorr Pork Cube",
      "▢ 4 cups coconut milk",
      "▢ 1 cup fresh pepper leaves",
      "▢ 1 1/2 cups unripe jackfruit sliced",
      "▢ 1/2 cup mung beans",
      "▢ 3 tablespoons bagoong alamang",
      "▢ 1 tablespoon whole peppercorn",
      "▢ 5 pieces dried bay leaves",
      "▢ 1 medium onion chopped",
      "▢ 4 cloves garlic chopped",
      "▢ 4 to 6 pieces Thai chili pepper or siling labuyo",
      "▢ 1/4 teaspoon ground black pepper",
      "▢ 8 quarts water for boiling pork",
      "▢ 4 tablespoons cooking oil"
    ],
    "instructions": [
      "Pour 4 quarts water in a pressure cooker. Add the pork hock. Boil for 15 minutes. Remove the pork hock and place in a bowl. Discard the water.",
      "Pour clean water on the same pressure cooker. Let boil.",
      "Add whole peppercorn, dried bay leaves, and put the pork hock back into the pressure cooker.",
      "Cover and pressure cook for 25 minutes.",
      "Remove the pressure and open the pressure cooker. Take the tender pork hocks out and set aside.",
      "Heat a cooking pot. Pour oil into it.",
      "Once the oil gets hot, pan-fry the shrimp for 1 minute per side.Remove the shrimp from the pot. Set aside.",
      "Add more oil if needed. Saute onion for 30 seconds.",
      "Add garlic. Continue to saute until onion becomes soft.",
      "Pour coconut milk into the pot. Let boil.",
      "Add Knorr Pork Cube. Stir.",
      "Put the mung beans into the pot. Cover and cook for 15 to 18 minutes.",
      "Add unripe jackfruit. Cover and cook for 10 to 12 minutes.",
      "Add chili pepper, shrimp paste, and ground black pepper. Stir.",
      "Put the pork hock into the pan. Cover and cook for 10 minutes.",
      "Add hot pepper leaves. Stir.",
      "Add the shrimp back into the pot. Cook for 3 minutes.",
      "Tranfer to a serving bowl. Serve.",
      "Share and enjoy!"
    ],
    "cooking_time": "1 hour",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/pata-at-hipon-sa-gata-na-may-monggo-at-langka/",
    "image_url": "",
    "image_path": "",
    "category": "Pork Dishes"
  },
  {
    "title": "Tanigue Fish Steak ala Bistek",
    "ingredients": [
      "▢ 3 to 4 lbs. Tanigue Wahoo or Kingfish, sliced crosswise",
      "▢ 3 medium onions sliced into rings",
      "▢ 1 lemon",
      "▢ 6 tablespoons soy sauce",
      "▢ 5 cloves garlic crushed",
      "▢ 2 1/2 tablespoons salt",
      "▢ 1 teaspoon granulated white sugar",
      "▢ 1/4 teaspoon ground black pepper",
      "▢ 1 cup water",
      "▢ 3/4 cups cooking oil"
    ],
    "instructions": [
      "Rub salt all over the fish steaks. Let it stay for 20 minutes.",
      "Heat 1/2 cup oil in a pan. Fry the fish for 3 to 5 minutes per side or until golden brown. Set aside.",
      "Heat 3 to 4 tablespoons oil in a cooking pot. Saute garlic until light brown.",
      "Add 1/3 of the total onions. continue to saute until soft.",
      "Pour soy sauce and add lemon juice into the cooking pot.",
      "Pour water and let boil.",
      "Add sugar and ground black pepper. Stir.",
      "Put the fried fish steaks into the pot. Cover and cook in medium heat for 3 minutes.",
      "Turn the fish over in a way that the opposite side faces the bottom of the pot. Add the remaining onion. Cover and continue to cook for 3 to 5 minutes.",
      "Transfer to a serving plate. Serve with rice.",
      "Share and enjoy!"
    ],
    "cooking_time": "1 hour",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/tanigue-fish-steak-ala-bistek/",
    "image_url": "",
    "image_path": "",
    "category": "Main Dishes"
  },
  {
    "title": "Classic Macaroni Salad Recipe",
    "ingredients": [
      "▢ 1 lb. elbow macaroni",
      "▢ 1 1/2 cups Lady's Choice Mayonnaise",
      "▢ 1 medium red bell pepper",
      "▢ 1 medium green bell pepper",
      "▢ 1/4 cup minced carrot",
      "▢ 1/2 cup minced celery",
      "▢ 1 medium onion minced",
      "▢ 4 tablespoons distilled or white vinegar",
      "▢ 2 1/4 tablespoons mustard powder",
      "▢ 4 tablespoons granulated white sugar",
      "▢ 1/2 teaspoon ground black pepper",
      "▢ 4 teaspoons salt",
      "▢ 5 quarts water for boiling macaroni"
    ],
    "instructions": [
      "Pour water into a cooking pot. Let boil.",
      "Add 2 teaspoons salt and then put-in the elbow macaroni. Continue to boil for 6 minutes.",
      "Drain the water and add cold water into the pot. Let is stay for 3 minutes and then drain. Set the macaroni aside.",
      "Combine mayonnaise, vinegar, mustard powder, ground black pepper, salt, and sugar. Mix well.",
      "Add the minced vegetables (onion, carrot, celery, and bell peppers). Fold the mixture until blended.",
      "Add the macaroni. Continue to fold until all the ingredients are well blended.",
      "Cover the bowl. Refrigerate the macaroni salad for at least 3 hours.",
      "Transfer to a serving bowl. Serve cold.",
      "Share and enjoy!"
    ],
    "cooking_time": "22 minutes",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/classic-macaroni-salad-recipe/",
    "image_url": "",
    "image_path": "",
    "category": "Other Filipino Dishes"
  }
]