[
  {
    "title": "Kalderetang Kambing (Goat Stew)",
    "ingredients": [
      "▢ 1 lb goat meat chevon, cubed",
      "▢ 1 tablespoon garlic minced",
      "▢ 1 onion minced",
      "▢ 3 tomatoes diced",
      "▢ 4 Thai chili optional",
      "▢ 1 cup tomato sauce",
      "▢ 3/4 cup bell pepper sliced",
      "▢ 6 tablespoon liver spread",
      "▢ 3/4 cup green olives optional",
      "▢ 1/2 cup vinegar",
      "▢ 1 carrot cubed",
      "▢ 1 potato cubed",
      "▢ 3 tablespoons cooking oil",
      "▢ 2 cups water",
      "▢ Salt and pepper to taste"
    ],
    "instructions": [
      "Combine the vinegar, salt, and ground black pepper in a large bowl then marinate the goat meat for at least an hour (This should eliminate the gamey smell and taste of the meat) then separate the meat from the marinade.",
      "Pour the cooking oil in a cooking pot or casserole and apply heat.",
      "Sauté the garlic, onion, and tomatoes",
      "Add the marinated goat meat then cook until the color of the outer part turns light brown",
      "Put-in the tomato sauce and crushed chili then allow to cook for 2 minutes",
      "Add the water and allow to boil. Simmer for at least 45 minutes or until the meat is tender.",
      "Add the liver spread and cook for 5 minutes (You may add water if the sauce seems to dry up)",
      "Put-in the potatoes and carrots then simmer for 8 minutes.",
      "Add the olives and bell pepper then simmer for another 5 minutes.",
      "Add salt and pepper to taste.",
      "Serve hot. Share and enjoy!"
    ],
    "cooking_time": "1 hour",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/stew-goat-meat-kalderetang-kambing-recipe/",
    "image_url": "",
    "image_path": "",
    "category": "Main Dishes"
  },
  {
    "title": "Bam-I Recipe (Pancit Bisaya)",
    "ingredients": [
      "▢ 1/2 lb pork sliced",
      "▢ 1/2 lb chicken boiled and shredded",
      "▢ 4 pieces Chinese sausage sliced",
      "▢ 1 lb shrimp shelled and heads removed",
      "▢ 8 ounces flour sticks pancit canton noodles",
      "▢ 4 to 6 ounces rice noodles sotanghon soaked in water",
      "▢ 1 1/2 to 2 cups chicken stock",
      "▢ 3 cups cabbage chopped",
      "▢ 3/4 cup carrots julienned",
      "▢ 1/2 cup dried wood ear soaked in water and chopped (also known as tenga ng daga)",
      "▢ 1 medium onion diced",
      "▢ 1/4 cup parsley cleaned and chopped",
      "▢ 1/2 cup shrimp juice derived by pounding the head of the shrimp",
      "▢ 1/2 cup soy sauce",
      "▢ 1 piece chicken cube or bouillon",
      "▢ 1 tablespoon garlic minced",
      "▢ Salt and ground black pepper to taste",
      "▢ 2 to 3 tablespoons cooking oil"
    ],
    "instructions": [
      "Heat a cooking pot then pour-in cooking oil.",
      "Sauté garlic and onions then add the sliced pork and cook for 3 minutes.",
      "Put-in the Chinese sausage and shredded chicken and cook for 3 to 5 minutes.",
      "Add soy sauce, shrimp juice, salt, ground black pepper, chicken bouillon, and chicken stock then let boil. Simmer for 5 to 8 minutes.",
      "Put the shrimps, cabbage, carrots, and wood ears in then cook for 2 minutes.",
      "Add the soaked noodles then stir. Cook for a minute.",
      "Put-in the flour sticks then stir well. Cook for 3 minutes or until the liquid is gone.",
      "Top with green onions and place calamansi on the side.",
      "Serve hot. Share and enjoy! Mangaon na Ta!"
    ],
    "cooking_time": "50 minutes",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/bam-i-cebuano-pansit-recipe/",
    "image_url": "",
    "image_path": "",
    "category": "Noodles"
  },
  {
    "title": "How to Make Macaroni Salad for the Holidays",
    "ingredients": [
      "▢ 500 grams elbow macaroni",
      "▢ 470 ml Lady’s Choice real mayonnaise",
      "▢ 300 ml condensed milk",
      "▢ 250 ml all-purpose cream",
      "▢ 250 grams sharp cheddar cheese diced",
      "▢ 250 grams nata de coco red, drained",
      "▢ 250 grams nata de coco green, drained",
      "▢ 350 grams kaong (sugar palm) drained",
      "▢ 850 grams fruit cocktail  drained"
    ],
    "instructions": [
      "Cook macaroni based on package instructions. Set aside.",
      "Combine all-purpose cream, condensed milk, and Lady’s Choice Mayonnaise in a large mixing bowl. Mix well.",
      "Add kaong, nata de coco, fruit cocktail, and cheese. Mix well.",
      "Put the cooked macaroni into the bowl with the other ingredients. Toss until well blended.",
      "Cover the bowl and refrigerate for at least 1 hour.",
      "Serve chilled. Share and enjoy!"
    ],
    "cooking_time": "N/A",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/how-to-make-macaroni-salad-for-the-holidays/",
    "image_url": "",
    "image_path": "",
    "category": "Other Filipino Dishes"
  },
  {
    "title": "Creamy Baked Salmon",
    "ingredients": [
      "▢ 3 lbs salmon fillet skin removed",
      "▢ ½ cup Lady’s Choice Mayonnaise",
      "▢ 7 ounces all-purpose cream",
      "▢ ½ cup cheddar cheese shredded",
      "▢ ¼ teaspoon garlic powder",
      "▢ 1 lemon",
      "▢ 1 ½ cups broccoli florets",
      "▢ 1 bell pepper chopped",
      "▢ 2 carrots sliced",
      "▢ 20 long green beans",
      "▢ 6 Tablespoons extra virgin olive oil",
      "▢ Salt and ground black pepper to taste"
    ],
    "instructions": [
      "Season both sides of the salmon with salt and ground black pepper. Set aside.",
      "Arrange carrot, bell pepper, broccoli, and long green beans on a baking tray. Sprinkle ground black pepper and salt. Drizzle with olive oil. Toss. Spread the vegetables evenly in the baking pan. Roast in the oven for 5 minutes.",
      "Heat remaining olive oil in a pan. Fry both sides of the salmon for 2 minutes. Squeeze half a lemon over the salmon. Set aside.",
      "Make the dressing by heating the all-purpose cream in a saucepan (use low heat setting). Turn the heat off. Add cheese and then stir until it melts. Add salt, onion powder, and garlic powder. Squeeze the remaining lemon. Stir until well blended. Add Lady’s Choice Mayonnaise. Stir.",
      "Remove the roasted vegetables from the oven. Arrange the salmon on top of the vegetables and then spread the dressing all over the salmon.",
      "Preheat oven to 350F. Bake the salmon for 12 minutes.",
      "Remove from the oven and serve. Share and enjoy!"
    ],
    "cooking_time": "N/A",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/creamy-baked-salmon/",
    "image_url": "",
    "image_path": "",
    "category": "Other Filipino Dishes"
  },
  {
    "title": "Baked Spaghetti",
    "ingredients": [
      "▢ 1/2 lb spaghetti",
      "▢ 1/2 lb. mozzarella cheese",
      "▢ 4 ounces quick melt cheese",
      "▢ 1 1/2 teaspoons parsley chopped",
      "▢ 1 lb ground beef",
      "▢ 1 Knorr Beef Cube",
      "▢ 15 ounces tomato sauce",
      "▢ 15 ounces diced tomato",
      "▢ 1 teaspoon Italian seasoning",
      "▢ 1 onion chopped",
      "▢ 2 cloves garlic minced",
      "▢ Salt and ground black pepper to taste"
    ],
    "instructions": [
      "Cook spaghetti based on package instructions. Set aside.",
      "Make the sauce by browning the ground beef in a pan until beef fat gets rendered. Separate the oil from the meat using a sieve or colander. Note: leave around 2 tablespoons of oil for sauteing.",
      "Heat remaining oil in the pan and then saute garlic and onion.",
      "Add the ground beef back into the pan and saute for 3 minutes.",
      "Pour diced tomato and tomato sauce into the pan. Cook for 2 minutes.",
      "Add Italian seasoning and Knorr Beef Cube. Stir and cover the pan. Adjust heat to low setting and continue cooking for 25 minutes. Note: add water if needed. Season with salt and ground black pepper.",
      "Combine spaghetti and sauce. Toss until all ingredients are well distributed. Arrange the mixture on a baking pan and top with mozzarella. Bake at 350F for 30 minutes.",
      "Serve with buttered toast or garlic bread."
    ],
    "cooking_time": "N/A",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/baked-spaghetti/",
    "image_url": "",
    "image_path": "",
    "category": "Other Filipino Dishes"
  },
  {
    "title": "Beef Mechado Recipe",
    "ingredients": [
      "▢ 3 cloves garlic crushed",
      "▢ 1 piece large onion sliced",
      "▢ 2 lbs beef chuck cubed",
      "▢ 8 ounces tomato sauce",
      "▢ 1 cup water",
      "▢ 3 tbsp cooking oil",
      "▢ 1 slice lemon with rind",
      "▢ 1 piece large potato sliced",
      "▢ 1/4 cup soy sauce",
      "▢ 1/2 tsp. ground black pepper",
      "▢ 2 pieces bay leaves laurel",
      "▢ salt to taste"
    ],
    "instructions": [
      "Heat cooking oil in a pan then saute the garlic and onion.",
      "Put-in the beef and saute for about 3 minutes or until color turns light brown",
      "Add the tomato sauce and water then simmer until the meat is tender. Add water as needed. Note this can take 60 to 120 minutes depending on the quality of the beef.",
      "Add the soy sauce, ground black pepper, lemon rind, laurel leaves, and salt then simmer until excess liquid evaporates",
      "Put-in the potatoes and cook until the potatoes are soft",
      "Place in a serving plate then serve hot with rice. Share and Enjoy!"
    ],
    "cooking_time": "1 hour",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/filipino-pinoy-food-tomato-sauce-beef-mechado-recipe/",
    "image_url": "",
    "image_path": "",
    "category": "Main Dishes"
  },
  {
    "title": "Ginisang Ampalaya (Sauteed Bitter Melon)",
    "ingredients": [
      "▢ 2 pieces ampalaya cleaned and cut into thin slices",
      "▢ 1 tbsp garlic minced",
      "▢ 1/2 tsp ground black pepper",
      "▢ salt to taste",
      "▢ 2 raw eggs",
      "▢ 18 ounces luke warm water",
      "▢ 1 tomato sliced",
      "▢ 1 onion sliced",
      "▢ 3 tbsp cooking oil"
    ],
    "instructions": [
      "Place the ampalaya in a large bowl",
      "Add salt and lukewarm water then leave for 5 minutes",
      "Place the ampalaya in a cheesecloth then squeeze tightly until all liquid drips",
      "Heat the pan and place the cooking oil",
      "Saute the garlic, onion, and tomato",
      "Add the ampalaya mix well with the other ingredients",
      "Put-in salt and pepper to taste",
      "Beat the eggs and pour over the ampalaya then let the eggs cook partially",
      "Mix the egg with the other ingredients",
      "Serve hot. Share and Enjoy!"
    ],
    "cooking_time": "30 minutes",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/healthy-bitter-melon-ginisang-ampalaya-recipe/",
    "image_url": "",
    "image_path": "",
    "category": "Vegetable Dishes"
  },
  {
    "title": "Bibingka Recipe",
    "ingredients": [
      "▢ 1 cup rice flour",
      "▢ 1/8 teaspoon salt",
      "▢ 2 1/2 teaspoon baking powder",
      "▢ 3 tablespoons butter",
      "▢ 1/2 cup granulated sugar",
      "▢ 1 cup coconut milk",
      "▢ 1/4 cup fresh milk",
      "▢ 1 piece salted duck egg sliced",
      "▢ 1/2 cup grated cheese",
      "▢ 3 pieces raw eggs",
      "▢ 1/4  cup grated coconut",
      "▢ Pre-cut banana leaf"
    ],
    "instructions": [
      "Preheat oven to 375 degrees Fahrenheit.",
      "Combine rice flour, baking powder, and salt then mix well. Set aside.",
      "Cream butter then gradually put-in sugar while whisking.",
      "Add the eggs then whisk until every ingredient is well incorporated.",
      "Gradually add the rice flour, salt, and baking powder mixture then continue mixing.",
      "Pour-in coconut milk and fresh milk then whisk some more for 1 to 2 minutes.",
      "Arrange the pre-cut banana leaf on a cake pan or baking pan.",
      "Pour the mixture on the pan.",
      "Bake for 15 minutes.",
      "Remove from the oven then top with sliced salted egg and grated cheese (do not turn the oven off).",
      "Put back in the oven and bake for 15 to 20 minutes or until the color of the top turn medium brown.",
      "Remove from the oven and let cool.",
      "Brush with butter and top with grated coconut.",
      "Serve. Share and enjoy!"
    ],
    "cooking_time": "45 minutes",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/rice-cake-bibingka-recipe/",
    "image_url": "",
    "image_path": "",
    "category": "Rice Dishes"
  },
  {
    "title": "Pininyahang Baboy sa Gata Recipe (Pineapple Pork with Coconut Milk)",
    "ingredients": [
      "▢ 2 ½ lbs. Pork belly cubed",
      "▢ 1 red bell pepper sliced",
      "▢ 1 green bell pepper sliced",
      "▢ 20 ounces canned pineapple chunks with juice",
      "▢ 1 carrot cubed",
      "▢ 4 cloves garlic chopped",
      "▢ 1 onion chopped",
      "▢ 2 cups coconut milk",
      "▢ 1 cup water as needed",
      "▢ 3 tablespoons cooking oil",
      "▢ Salt and fish sauce to taste"
    ],
    "instructions": [
      "Heat oil in a pan. Saute garlic and onion.",
      "Once the onion softens, add pork. Saute until the color of the pork turns light brown.",
      "Pour pineapple juice, half of the pineapple chunks, and coconut milk into the pan. Let boil. Cover the pan and adjust the heat to a low setting. Continue boiling the pork until it tenderizes. Note: you can add water if the meat needs more time to tenderize.",
      "Add carrots and remaining pineapple. Cook for 7 minutes.",
      "Add bell peppers. Cook for 5 minutes.",
      "Season with ground black pepper and fish sauce.",
      "Serve warm with rice. Share and enjoy!"
    ],
    "cooking_time": "N/A",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/pininyahang-baboy-sa-gata-recipe-pineapple-pork-with-coconut-milk/",
    "image_url": "",
    "image_path": "",
    "category": "Pork Dishes"
  },
  {
    "title": "Original Buffalo Chicken Wings",
    "ingredients": [
      "▢ 2 lbs chicken wings",
      "▢ 5 Tablespoons unsalted butter",
      "▢ 1/2 cup Frank's RedHot sauce"
    ],
    "instructions": [
      "Divide the wings into 3 parts. Separate the drumette from the wingette. Cut off the wingtip and set aside. Note: we'll only be using the big parts.",
      "Pat the wings dry with paper towel and arrange inside an air fryer. Air fry one side for 12 minutes at 350F. Do the same with the opposite side.",
      "Make the sauce by melting butter in a microwave oven. Add the hot sauce and stir until well blended.",
      "Soak chicken wings in the sauce. Make sure that each piece is fully coated.",
      "Serve with ranch dressing, carrots, and celery. Share and enjoy!"
    ],
    "cooking_time": "N/A",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/original-buffalo-chicken-wings/",
    "image_url": "",
    "image_path": "",
    "category": "Chicken Dishes"
  },
  {
    "title": "Vegetable Okoy",
    "ingredients": [
      "▢ 8 ounces kalabasa",
      "▢ 1 piece carrot",
      "▢ 3/4 cup malunggay leaves",
      "▢ 1 cup cooking oil",
      "▢ 1/2 cup cornstarch",
      "▢ 3/4 cup flour",
      "▢ 4 grams Maggi Magic Sarap",
      "▢ 1 egg",
      "▢ 3/4 cup water",
      "▢ ½ piece onion chopped",
      "▢ 2 tablespoons green onion chopped",
      "▢ ¾ cups white vinegar",
      "▢ 4 grams Maggi Magic Sarap"
    ],
    "instructions": [
      "Slice the kalabasa and carrot into matchstick pieces.8 ounces kalabasa, 1 piece carrot",
      "Combine all the sliced vegetables including the malunggay leaves in a mixing bowl. Toss to blend.3/4 cup malunggay leaves",
      "Make the batter by beating an egg on a separate bowl. Add water. Mix well. Gradually add flour and cornstarch while mixing. Add Maggi Magic Sarap. Whisk until the texture of the batter smoothens.1/2 cup cornstarch, 3/4 cup flour, 1 egg, 3/4 cup water, 4 grams Maggi Magic Sarap",
      "Combine the batter with the vegetables. Fold until the vegetables are completely coated with the batter.",
      "Make the dipping sauce by combining all dipping sauce ingredient in a bowl. Stir until blended.½ piece onion, 2 tablespoons green onion, ¾ cups white vinegar, 4 grams Maggi Magic Sarap",
      "Heat oil in a pan. Scoop around ¼ cup of mixture and place it on a saucer or small bowl. Slide the mixture into the pan. Fry until golden brown and crispy. Flip the okoy and do the same to the opposite side. Remove from the pan and place on a plate lined with a paper towel. Perform the same step until the entire mixture is consumed.1 cup cooking oil",
      "Transfer to a serving plate. Serve with dipping sauce. Share and enjoy!"
    ],
    "cooking_time": "N/A",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/vegetable-okoy/",
    "image_url": "",
    "image_path": "",
    "category": "Vegetable Dishes"
  },
  {
    "title": "Cheesy Onion Rings",
    "ingredients": [
      "▢ 1 piece onion large sliced into thick rings",
      "▢ 8  Mozzarella cheese sticks",
      "▢ 1 cup milk",
      "▢ 1  egg beaten",
      "▢ 1 cup Panko bread crumbs",
      "▢ 2 cups cooking oil",
      "▢ 1 teaspoon baking powder",
      "▢ 1  cup all-purpose flour",
      "▢ 1 teaspoon salt fine"
    ],
    "instructions": [
      "Pair two slices of onion rings. One piece should be larger than the other and there should be a space in between the rings when the smaller piece is placed inside the larger one.",
      "Slice the mozzarella cheese in such a way that it fits the space in between the rings. Put the sliced cheese in between the two pieces of onions and secure by inserting a toothpick. Perform this step on all pairs of onion rings that you have.",
      "Heat oil in a deep cooking pot.",
      "Combine all dry ingredient mixture in a bowl. Mix well. Dredge all onion rings onto the dry ingredient mixture.  Place over a wire rack. Set aside.",
      "Combine milk and egg. Mix well. Pour the mixture into the bowl with the dry ingredients. Mix well until a better is formed.",
      "Dip the onion rings in the batter mixture. Put it back over the wire rack for the excess batter to drip.",
      "Coat with Panko breadcrumbs.",
      "Fry one side until it turns golden brown. Turn it over and do the same thing on the opposite side.",
      "Serve warm with marinara sauce. Share and enjoy!"
    ],
    "cooking_time": "N/A",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/cheesy-onion-rings/",
    "image_url": "",
    "image_path": "",
    "category": "Other Filipino Dishes"
  }
]