[
  {
    "title": "How to Make Tom Yum Goong",
    "ingredients": [
      "▢ 3/4 lb large shrimps or prawns shelled and deveined",
      "▢ 10 pieces chili peppers sliced",
      "▢ 1/2 cup onion sliced",
      "▢ 2 tablespoons chili paste roasted",
      "▢ 2 cups straw mushrooms",
      "▢ 1 medium sized tomato wedged",
      "▢ 1 1/2 tablespoons lime juice",
      "▢ 1/2 cup cilantro",
      "▢ 4 cups water",
      "▢ 2 stalks lemon grass cut in 1 inch lenght",
      "▢ 2 pieces galangal root pounded",
      "▢ 3 pieces lime leaves",
      "▢ 1 tablespoon tamarind paste",
      "▢ 1 tablespoon fish sauce"
    ],
    "instructions": [
      "Pour water in a cooking pot and bring to a boil.",
      "Put-in galangal, lime leaves, lemon grass, tamarind paste, and fish sauce. Stir well and simmer for 5 minutes.",
      "Add the shrimps and simmer for 3 to 4 minutes.",
      "Put-in the onion, straw mushrooms, and chili paste then simmer for another 5 minutes.",
      "Add chili and tomato then simmer for one minute.",
      "Put-in the lime juice and cilantro then turn off the heat.",
      "Transfer to a serving bowl.",
      "Serve hot. Share and enjoy!"
    ],
    "cooking_time": "30 minutes",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/how-to-make-tom-yum-goong-recipe/",
    "image_url": "",
    "image_path": "",
    "category": "Seafood"
  },
  {
    "title": "Shrimp with Quail Eggs and Green Peas",
    "ingredients": [
      "▢ 1 lb shrimps shelled and deveined",
      "▢ 1 1/2 cups sweet green peas",
      "▢ 1 cup chicken broth",
      "▢ 10 pieces quail eggs hard boiled",
      "▢ 3/4 cup jicama singkamas, diced",
      "▢ 3/4 cup carrots diced",
      "▢ 1 medium sized onion diced",
      "▢ 3 tablespoons butter",
      "▢ 1/2 cup toasted cashews",
      "▢ 1 tablespoon cornstarch diluted in 3 tablespoons of water",
      "▢ 1/2 teaspoon salt",
      "▢ 1/2 teaspoon ground black pepper"
    ],
    "instructions": [
      "Melt butter in a pan or cooking pot.",
      "Put-in the onions and cook in low fire until the texture becomes soft.",
      "Add the carrots and jicama then cook for 3 minutes.",
      "Add the green peas and cashews then cook for 2 minutes",
      "Move the vegetables on one side of the pan to form an extra space. Place the shrimp over the extra space and cook for 1 minute.",
      "Stir the ingredients until well incorporated then pour the chicken broth in. Simmer for 2 minutes.",
      "Add the salt and ground black pepper then stir.",
      "Put-in the quail eggs and cornstarch (diluted in water) and stir lightly. Cook until desired thickness is achieved.",
      "Turn of the heat and transfer to a serving bowl.",
      "Serve hot with lots of love. Share and enjoy!"
    ],
    "cooking_time": "23 minutes",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/shrimps-with-quail-eggs-and-green-peas/",
    "image_url": "",
    "image_path": "",
    "category": "Chicken Dishes"
  },
  {
    "title": "How to Make Sinamak",
    "ingredients": [
      "▢ 2 to 3 cups vinegar use white, cane, or coconut vinegar",
      "▢ 1 cup bird’s eye or Thai chilies dried or fresh will do",
      "▢ 3 tablespoons ginger sliced",
      "▢ 1 head garlic",
      "▢ 3 teaspoons whole peppercorns",
      "▢ 1 medium size white onion"
    ],
    "instructions": [
      "Combine whole peppercorn, ginger, garlic, onion, and chili in a clean container (usually an empty bottle of liquor). Shake well to distribute the ingredients.",
      "Fill the bottle with the vinegar of your choice then tightly cover the bottle.",
      "Shake the bottle lightly and store in a safe place for at least 3 days. The longer the storage time, the spicier the vinegar will become.",
      "Serve as condiment for fried and grilled foods"
    ],
    "cooking_time": "16 minutes",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/how-to-make-spiced-vinegar-sinamak/",
    "image_url": "",
    "image_path": "",
    "category": "Other Filipino Dishes"
  },
  {
    "title": "Chicken Sopas Recipe",
    "ingredients": [
      "▢ 3 tablespoons butter",
      "▢ 1 medium sized onion diced",
      "▢ 1 lb boneless skinless chicken breast diced",
      "▢ 32 ounces chicken broth about 4 cups",
      "▢ 2 cups elbow macaroni",
      "▢ 3/4 cup celery stalk chopped",
      "▢ 3/4 cup carrots diced",
      "▢ 3/4 cup cabbage; shredded",
      "▢ 3/4 cup fresh or evaporated milk",
      "▢ 1 cup water",
      "▢ Salt and ground black pepper to taste"
    ],
    "instructions": [
      "Heat a cooking pot and put-in the butter. Allow the butter to melt.",
      "Add onions and cook until the texture becomes soft.",
      "Put-in the boneless chicken breasts and cook for 3 to 5 minutes.",
      "Sprinkle some salt and ground black pepper and stir.",
      "Add chicken broth and bring to a boil.",
      "Pour-in water and milk and wait to re-boil. Simmer for 15 to 20 minutes.",
      "Add the elbow macaroni and cook for 8 minutes while stirring once in awhile.",
      "Put-in the carrots and celery and simmer for 3 minutes.",
      "Add the cabbage and cook for 2 minutes more.",
      "Turn-off the heat and transfer to a serving plate.",
      "Serve hot. Share and enjoy!"
    ],
    "cooking_time": "40 minutes",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/chicken-sopas-soup-recipe/",
    "image_url": "",
    "image_path": "",
    "category": "Soups And Stews"
  },
  {
    "title": "Sotanghon Guisado Recipe",
    "ingredients": [
      "▢ 1/2 lb sotanghon noodles",
      "▢ 1 lb chicken",
      "▢ 1 cup celery chopped",
      "▢ 1 1/2 cups onion diced",
      "▢ 1 teaspoon whole peppercorn",
      "▢ 4 cups water",
      "▢ 1/4 cup annatto water",
      "▢ 2 to 3 tablespoons garlic minced",
      "▢ 1 cup onion leeks chopped",
      "▢ 2 tablespoons fish sauce",
      "▢ 1/2 cup carrots julienned",
      "▢ 2 tablespoons cooking oil"
    ],
    "instructions": [
      "Pour water in the cooking pot and apply heat.",
      "When the water starts boiling, add celery, 3/4 cup diced onions, whole peppercorns, and chicken",
      "Simmer for 40 to 60 minutes then turn off the heat and let cool.",
      "Remove the meat from the chicken using your hands. Discard the bones and skin. Set aside.",
      "Filter the liquid using a strainer and set aside. This will be the chicken broth.",
      "Soak the noodles in water until it becomes soft.",
      "Heat a clean wok or cooking pot and pour-in cooking oil.",
      "When the oil is hot enough, sauté garlic and the remaining 3/4 cup diced onions.",
      "Add-in chicken and cook for 2 minutes.",
      "Pour-in annatto water and chicken broth then bring to a boil.",
      "Stir-in the carrots and half of the chopped onion leeks. Cook for 3 minutes.",
      "Add the noodles and fish sauce then cook for another 2 minutes.",
      "Transfer to a serving plate and top with remaining onion leeks and place lemon or calamansi slices on the side.",
      "Serve hot. Share and enjoy!"
    ],
    "cooking_time": "1 hour",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/sotanghon-vermicelli-guisado/",
    "image_url": "",
    "image_path": "",
    "category": "Noodles"
  },
  {
    "title": "Halabos na Alimasag Recipe",
    "ingredients": [
      "▢ 3 lbs fresh blue crabs cleaned",
      "▢ 1/2 cup water",
      "▢ 2 teaspoons salt"
    ],
    "instructions": [
      "Pour water in a large cooking pot. Let boil.",
      "Add salt and crabs. Cook covered for 5 to 8 minutes while occasionally stirring.",
      "Serve. share and enjoy!"
    ],
    "cooking_time": "13 minutes",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/halabos-na-alimasag/",
    "image_url": "",
    "image_path": "",
    "category": "Other Filipino Dishes"
  },
  {
    "title": "Ukoy Recipe (Shrimp Fritter)",
    "ingredients": [
      "▢ 1 cup small shrimps cleaned",
      "▢ 1 cup cornstarch",
      "▢ 1/4 cup flour",
      "▢ 1 1/2 cups mung bean sprouts togue",
      "▢ 1/2 teaspoon salt",
      "▢ 1/2 teaspoon ground black pepper",
      "▢ 1 piece raw egg",
      "▢ 1/4 teaspoon baking powder",
      "▢ 1 1/4 cups water",
      "▢ 2 cups cooking oil"
    ],
    "instructions": [
      "Combine cornstarch, flour, baking powder, egg, water, salt, and ground black pepper then stir until diluted.",
      "Add the shrimps and mung bean sprouts in the mixture and lightly stir to distribute.",
      "Heat a frying pan or small cooking pot and pour-in the cooking oil.",
      "When the oil is hot enough, scoop about 2 to 3 tablespoons of the mixture and quickly (but cautiously) drop it in hot oil.",
      "Cook each side for 2 to 3 minutes or until the color turns golden brown. Please note that cooking time may vary. Repeat this step until the entire mixture is consumed.",
      "Remove the deep-fried ukoy from the pan and place in a plate lined with paper towel to absorb the oil.",
      "Remove the paper towel and serve with sinamak.",
      "Share and enjoy!"
    ],
    "cooking_time": "11 minutes",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/ukoy-shrimp-fritters-recipe/",
    "image_url": "",
    "image_path": "",
    "category": "Other Filipino Dishes"
  },
  {
    "title": "Chicken Parmesan Recipe",
    "ingredients": [
      "▢ 3 pieces boneless skinless chicken breast halves flattened",
      "▢ 1 cup bread crumbs",
      "▢ 1 cup all-purpose flour",
      "▢ 1 piece raw egg",
      "▢ 4 tablespoons extra virgin olive oil",
      "▢ 1 cup mozzarella cheese grated",
      "▢ 1/2 cup parmesan cheese grated",
      "▢ 1 tablespoon flat parsley chopped",
      "▢ 2 tablespoons extra virgin olive oil",
      "▢ 1 cup onions diced",
      "▢ 1/2 cup carrot minced",
      "▢ 1 tablespoon garlic minced",
      "▢ 1 can peeled whole tomatoes 28 ounces",
      "▢ Salt and pepper to taste"
    ],
    "instructions": [
      "Heat a cooking pot and pour-in 2 tablespoons of extra virgin olive oil.",
      "Sauté garlic and onions until the texture of the onions becomes soft.",
      "Add-in carrots and cook for 2 minutes.",
      "Add the whole peeled tomatoes and lightly mash it while cooking. Bring to a boil and simmer for 15 to 18 minutes",
      "Heat a skillet or frying pan and pour-in 4 tablespoons of extra virgin olive oil.",
      "While waiting for the oil to reach the desired temperature, rub the salt and pepper on each chicken breasts.",
      "Dredge the chicken breasts in flour, dip in the beaten egg mixture, and roll over bread crumbs.",
      "Pan-fry the chicken breast in the pan with extra virgin olive oil until half done. Flip the chicken to cook the other side.",
      "Preheat the oven to 350 degrees Fahrenheit.",
      "Arrange the cooked chicken breasts on an oven safe plate then pour the sauce over each piece.",
      "Sprinkle parmesan cheese over each chicken (this should be on top of the sauce).",
      "Top the parmesan cheese with mozzarella cheese and pour the remaining sauce on the plate.",
      "Place the plate with chicken in the oven and bake for 20 minutes.",
      "Remove from the oven and garnish with chopped parsley.",
      "Serve hot. Share and Enjoy!"
    ],
    "cooking_time": "1 hour",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/chicken-parmesan-recipe/",
    "image_url": "",
    "image_path": "",
    "category": "Chicken Dishes"
  },
  {
    "title": "Sizzling Gambas Recipe",
    "ingredients": [
      "▢ 1 lb shrimp peeled and deveined",
      "▢ 2 tablespoons garlic minced",
      "▢ 1/4 cup lemon juice",
      "▢ 1/2 cup green chili sliced diagonally",
      "▢ 1 cup red bell pepper chopped",
      "▢ 1/4 cup cooking oil or olive oil",
      "▢ 1 medium-sized onion quartered",
      "▢ 2 tablespoons cooking rice wine",
      "▢ 1/4 cup tomato sauce",
      "▢ 2 tablespoons chili sauce",
      "▢ Salt and pepper to taste"
    ],
    "instructions": [
      "Combine lemon juice and shrimp and marinade for 30 minutes.",
      "Pour cooking oil in a wok of frying pan then apply heat.",
      "When the oil is hot enough, put-in the garlic and cook until the color turns light brown.",
      "Add the onions and red bell pepper then cook until the texture softens.",
      "Put-in the shrimps and cook for 2 minutes.",
      "Add the cooking rice wine, salt, and pepper then cook for another minute.",
      "Add the tomato sauce and stir. Cook for 2 minutes.",
      "Put-in the hot sauce and simmer for 30 seconds. Turn off the heat and set-aside.",
      "Heat a sizzling plate and transfer the shrimp along with the other ingredients.",
      "Top with sliced green chilies and serve.",
      "Share and enjoy!"
    ],
    "cooking_time": "23 minutes",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/sizzling-gambas-shrimp-recipe/",
    "image_url": "",
    "image_path": "",
    "category": "Other Filipino Dishes"
  },
  {
    "title": "Tortang Giniling Recipe",
    "ingredients": [
      "▢ 3/4 lb. ground pork or beef",
      "▢ 6 pieces raw eggs",
      "▢ 1 medium-sized onion diced",
      "▢ 2 medium sized tomatoes diced",
      "▢ 4 cloves garlic chopped",
      "▢ 1 small green bell pepper minced",
      "▢ 1 small red bell pepper minced",
      "▢ 1/2 cup frozen green peas",
      "▢ 1 1/2 teaspoons salt",
      "▢ 1/4 teaspoon ground black pepper",
      "▢ 3 tablespoons cooking oil"
    ],
    "instructions": [
      "Heat a frying pan or wok and pour-in 2 tablespoons of cooking oil",
      "When the oil is hot enough, sauté the onion, garlic, and tomato.",
      "Add the ground meat and cook for 8 to 10 minutes.",
      "Put-in the bell peppers and green peas. Cook for 3 minutes.",
      "Add salt and pepper then stir to distribute. Transfer to a large bowl. Let it cool down.",
      "When the cooked ground meat reaches room temperature, beat the eggs and pour into the bowl same bowl. Stir to distribute all the ingredients.",
      "Heat a clean non-stick pan. Add the remaining cooking oil.",
      "Scoop 1/3 of the egg and pork mixture to the pan.",
      "Cook each side for 3 minutes or until you see that the eggs are fully cooked. Avoid overcooking the eggs. Do the same step until the mixture is consumed.",
      "Turn off the heat and transfer to a serving plate.",
      "Serve with banana ketchup. Share and enjoy!"
    ],
    "cooking_time": "30 minutes",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/tortang-giniling-omelet-recipe/",
    "image_url": "",
    "image_path": "",
    "category": "Pork Dishes"
  }
]