[
  {
    "title": "Tasty Pork Afritada Recipe",
    "ingredients": [
      "▢ 2 lbs pork shoulder cut into cubes",
      "▢ 1 large yellow onion minced",
      "▢ 4 cloves garlic minced",
      "▢ 6 pieces hotdogs or wieners sliced diagonally",
      "▢ 1 16 oz. can tomato sauce",
      "▢ 1 1/2 cups frozen green peas",
      "▢ 4 pieces potatoes cleaned and quartered",
      "▢ 2 teaspoons granulated white sugar",
      "▢ 3 tablespoons cooking oil",
      "▢ 2 to 3 cups beef broth",
      "▢ Salt and ground black pepper to taste"
    ],
    "instructions": [
      "Heat the cooking oil in a cooking pot or deep pan.",
      "Saute the garlic and onion when the oil becomes hot.",
      "Once the onion is soft, add the pork and cook until light brown (around 3 to 5 minutes).",
      "Pour-in the tomato sauce and beef broth. Stir. Let boil. Cover and simmer for 45 to 60 minutes or until the pork becomes tender.",
      "Add the hotdogs and potatoes. Cook for 8 minutes.",
      "Add the green peas, sugar, salt, and pepper. Stir and cook for 3 minutes.",
      "Transfer to a serving bowl. Serve.",
      "Share and enjoy!"
    ],
    "cooking_time": "1 hour",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/easy-pork-afritada-recipe/",
    "image_url": "",
    "image_path": "",
    "category": "Chicken Dishes"
  },
  {
    "title": "Chicken Enchilada Casserole Recipe",
    "ingredients": [
      "▢ 12 pieces flour tortilla",
      "▢ 29 ounces enchilada sauce",
      "▢ 3/4 lb. cooked shredded chicken",
      "▢ 1 teaspoon ground cumin",
      "▢ 1 1/2 cup Monterey jack cheese",
      "▢ 1 16 oz. can refried beans",
      "▢ 2 cups sour cream"
    ],
    "instructions": [
      "Preheat oven to 350F.",
      "Combine the ground cumin with the shredded chicken. Mix well. Set aside.",
      "Meanwhile, scoop around 1/2 cup of enchilada sauce and pour in a baking dish. Spread the sauce all over the dish.",
      "Lay four pieces of flour tortilla over the enchilada sauce. Spread some refried beans and sour cream over the tortilla. Arrange half of the shredded chicken on top and then top with cheese and enchilada sauce.",
      "Make the next layer by arranging four pieces of flour tortilla on top of the enchilada sauce. Do the same step as in the first layer by spreading refried beans and sour cream over the tortillas. Top with the remaining chicken. Add cheese and enchilada sauce on top.",
      "Make the last layer by arranging the last 4 flour tortilla pieces over the enchilada sauce. Spread the remaining refried beans, sour cream, and enchilada sauce. Top with Monterey jack cheese.",
      "Bake the Chicken Enchilada Casserole for 35 to 40 minutes.",
      "Remove from the oven. Serve.",
      "Share and enjoy!"
    ],
    "cooking_time": "45 minutes",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/chicken-enchilada-casserole-recipe/",
    "image_url": "",
    "image_path": "",
    "category": "Chicken Dishes"
  },
  {
    "title": "Grilled Mussels Recipe",
    "ingredients": [
      "▢ 1 lb. mussels",
      "▢ 1 medium plum tomato diced",
      "▢ 1 large yellow onion minced",
      "▢ 2 teaspoons minced garlic",
      "▢ 2 tablespoons tomato paste",
      "▢ 4 tablespoons bread crumbs",
      "▢ 2 tablespoons chopped parsley",
      "▢ 1 tablespoon chopped mint",
      "▢ 1 tablespoon olive oil",
      "▢ 1 teaspoon lemon juice"
    ],
    "instructions": [
      "Clean the mussels and boil in 2 cups of water for at least 2 to 5 minutes.",
      "Let the mussels cool. Drain and remove the beard. Set aside.",
      "Heat the olive oil in a pan.",
      "Sauté the onion until soft",
      "Add the garlic and continue to sauté for 1 minute.",
      "Add the tomato and tomato paste. Sauté for 1 minute. Transfer to a bowl and let cool.",
      "Meanwhile combine breadcrumbs, parsley, mint, and lemon juice. Mix well.",
      "Scoop the sautéed onion, garlic, and tomato mixture and arrange on top of the mussels. Add the breadcrumbs mixture above.",
      "Heat the grill and grill the mussels for 5 to 7 minutes in medium heat.",
      "Transfer to a serving plate.",
      "Serve as an appetizer.",
      "Share and enjoy!"
    ],
    "cooking_time": "12 minutes",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/grilled-mussels-recipe/",
    "image_url": "",
    "image_path": "",
    "category": "Other Filipino Dishes"
  },
  {
    "title": "Crusted Pork Chop with Adobo Rice Recipe",
    "ingredients": [
      "▢ 4 pieces pork chops 5 to 8 oz. each",
      "▢ 1 cup Panko bread crumbs",
      "▢ 2 eggs beaten",
      "▢ 1 1/2 teaspoon salt",
      "▢ 1/2 teaspoon ground black pepper",
      "▢ 1/2 cup cooking oil"
    ],
    "instructions": [
      "Rub salt and pepper on the pork chops. Let it stay for 15 minutes.",
      "Heat the cooking oil in a frying pan. Once the oil gets hot, adjust the heat to low.",
      "Arrange the eggs and breadcrumbs in separate bowls. Dip each pork chop into the beaten eggs and then dredge with breadcrumbs. Make sure that the entire pork chops are completely covered.",
      "Pan fry the pork chops for 6 to 9 minutes per side depending on the thickness of the pork chop. Note: you can increase the heat gradually if needed. Remember that too much heat can burn the outer part of the pork chop while leaving the center raw. Adjust the heat as necessary.",
      "Remove the fried crusted pork chop from the frying pan. Transfer to a serving plate with Adobo rice and egg.",
      "Serve. Share and enjoy!"
    ],
    "cooking_time": "30 minutes",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/crusted-pork-chop-adobo-rice-recipe/",
    "image_url": "",
    "image_path": "",
    "category": "Chicken Dishes"
  },
  {
    "title": "Ginataang Langka with Pork Recipe",
    "ingredients": [
      "▢ 20 oz. unripe jackfruit chopped",
      "▢ 10 oz. pork cubed",
      "▢ 2 cups coconut milk",
      "▢ 4 pieces chili pepper chopped (optional)",
      "▢ 1 medium onion sliced",
      "▢ 1 teaspoon minced garlic",
      "▢ 1 tablespoon fish sauce",
      "▢ 1/4 teaspoon ground black pepper",
      "▢ 2 tablespoons cooking oil"
    ],
    "instructions": [
      "Heat the cooking oil in a pan.",
      "Once the oil becomes hot, sauté the onion and garlic.",
      "Add the pork. Cook until medium brown.",
      "Pour the coconut milk in the pan. Let boil. Cover and simmer for 20 minutes. Add water if needed.",
      "Add the ground black pepper, chili, and fish sauce. Stir.",
      "Add the jackfruit. Stir and cook for 5 to 7 minutes.",
      "Transfer to a serving bowl. Serve.",
      "Share and enjoy!"
    ],
    "cooking_time": "35 minutes",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/ginataang-langka-with-pork-recipe/",
    "image_url": "",
    "image_path": "",
    "category": "Pork Dishes"
  },
  {
    "title": "Chicken Teriyaki, Brown Rice, and Sunny Side Up Egg Recipe",
    "ingredients": [
      "▢ 1 1/2 lbs. boneless and skinless chicken breast",
      "▢ 1/4 cup soy sauce",
      "▢ 2 tablespoons water",
      "▢ 2 tablespoons brown sugar",
      "▢ 1/4 teaspoon garlic powder",
      "▢ 2 tablespoons Mirin or cooking wine",
      "▢ 3 cups cooked brown rice",
      "▢ 3 eggs cooked sunny side up",
      "▢ 1 tablespoon toasted sesame seeds"
    ],
    "instructions": [
      "Make the marinade by combining the soy sauce, brown sugar, Mirin (or cooking wine), water, and garlic powder. Stir until all the ingredients are properly distributed.",
      "Place the chicken breasts in a Ziploc bag or in a bowl. Mix-in the marinade. Seal the bag and put inside the refrigerator. Marinate for at least 1 hour (overnight is better).",
      "Heat the grill. Grill the marinated chicken for 4 to 7 minutes per side or until the internal temperature reads 165F. You can flip the chicken twice while grilling each side for half the time per rotation to avoid one side from getting burnt.",
      "Arrange the cooked brown rice in a bowl. Put-in the grilled chicken teriyaki over the rice and top with sunny side up egg. Sprinkle some toasted sesame seeds on top of the chicken.",
      "Serve. Share and enjoy!"
    ],
    "cooking_time": "1 hour",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/chicken-teriyaki-brown-rice-sunny-side-up-egg/",
    "image_url": "",
    "image_path": "",
    "category": "Chicken Dishes"
  },
  {
    "title": "Pork Burger Patties",
    "ingredients": [
      "▢ 2 1/4 lbs ground pork",
      "▢ 1 large carrot minced",
      "▢ 1 medium onion minced",
      "▢ 1 egg",
      "▢ 1 teaspoon paprika optional",
      "▢ 1/2 teaspoon ground black pepper",
      "▢ 1 teaspoon garlic powder",
      "▢ 1/2 cup bread crumbs",
      "▢ 1 teaspoon salt"
    ],
    "instructions": [
      "Preheat the oven to 375 Fahrenheit.",
      "In a large bowl, combine the ground pork, carrot, onion, paprika, garlic powder, egg, salt, pepper, and bread crumbs. Mix until the ingredient are distributed properly.",
      "Arrange an aluminum foil sheet on top of a baking tray. Lightly grease the top of the sheet with cooking oil to prevent the patties from sticking.",
      "Scoop ½ cup of ground meat mixture and mold each into a ball shaped figure. Gently press on the ball shaped meat mixture to form a flat ground pork burger patty. Arrange the pork patties over the greased aluminum foil sheet.",
      "Place the baking tray with pork burger patties inside the oven and bake for 25 to 35 minutes or until the pork internal temperature reads 160 degrees Fahrenheit.",
      "Remove the baked pork burger patties from the tray and arrange in a serving plate. Serve with your favorite dipping sauce.",
      "Share and enjoy!"
    ],
    "cooking_time": "40 minutes",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/pork-burger-patties-recipe/",
    "image_url": "",
    "image_path": "",
    "category": "Pork Dishes"
  },
  {
    "title": "Easy Turkey Embutido Recipe",
    "ingredients": [
      "▢ 3 lbs. ground turkey",
      "▢ 2 eggs",
      "▢ 3/4 cup sweet pickle relish",
      "▢ 1 8 oz. can tomato sauce",
      "▢ 1 cup sharp cheddar cheese grated",
      "▢ 1 1/2 cup raisins",
      "▢ 2 large carrots finely minced",
      "▢ 1 large onion finely minced minced",
      "▢ 1 teaspoon garlic powder",
      "▢ 2 tablespoons olive oil",
      "▢ 3 teaspoons salt",
      "▢ 1/2 teaspoon ground black pepper",
      "▢ 2 cups regular or Italian bread crumbs",
      "▢ 8 to 10 cups water."
    ],
    "instructions": [
      "In a large mixing bowl, combine the ground turkey, onion, carrots, raisins, sweet pickle relish, olive oil, tomato sauce, and eggs. Mix well using a spatula or a stand mixer.",
      "Add the cheese, garlic powder, salt, pepper, and bread crumbs. continue to mix until all the ingredients are evenly dispersed.",
      "Cut the aluminum foil into 12\" x 12\" individual pieces. This recipe can use between 5 to 7 pieces of aluminum foil.",
      "Scoop around 1 1/2 to 2 cups of mixture into one end of the aluminum foil and mold the mixture to shape like a long cylinder. Secure the mixture by folding-in the opposite the sides of the aluminum foil and roll foil to the opposite side. Do this step until you finish wrapping all the mixture.",
      "Meanwhile, boil the water in a steamer.Once the water starts to boil, arrange the wrapped turkey embutido in the steamer. cover and steam for 40 to 50 minutes.",
      "Remove the steamed embutido from the steamer and let the it cool down. Once the embutido reaches room temperature, you can do either the following: refrigerate for at least 3 hours and serve cold; or slice and pan fry for a few minutes.",
      "Serve. Share and enjoy!"
    ],
    "cooking_time": "1 hour",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/easy-turkey-embutido-recipe/",
    "image_url": "",
    "image_path": "",
    "category": "Other Filipino Dishes"
  },
  {
    "title": "Taco Fried Rice Recipe",
    "ingredients": [
      "▢ 3 to 4 cups cooked white rice preferably leftover rice",
      "▢ 2 tablespoons cooking oil",
      "▢ 1/2 teaspoon salt",
      "▢ 1/2 lb. ground beef 80% lean",
      "▢ 1/2 pouch 1/2 oz. taco seasoning mix",
      "▢ 1/4 cup chopped flat leaf parsley",
      "▢ 1/4 cup water"
    ],
    "instructions": [
      "Sprinkle the salt over the cooked white rice. Using a large spoon, gently toss the rice to distribute the salt equally and to avoid the rice from forming.Set aside.",
      "Meanwhile, heat the cooking oil in a pan.",
      "Once the oil becomes hot, put-in the ground beef and cook until it turns light to medium brown (3 to 5 minutes).",
      "Pour-in the water and then mix-in the taco seasoning. Stir and continue to cook for 5 minutes or until the liquid evaporates.",
      "Add-in the rice. Toss once in a while using a flat spatula. Make sure that you DO NOT press the rice with the spatula as the rice can stick with each other -- we want out rice to be as loose as possible.Continue to cook for 5 to 8 minutes in medium heat.",
      "Transfer to a serving plate. Top with chopped parsley.",
      "Serve. Share and enjoy!"
    ],
    "cooking_time": "25 minutes",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/taco-fried-rice/",
    "image_url": "",
    "image_path": "",
    "category": "Other Filipino Dishes"
  },
  {
    "title": "Homemade Chicken Noodle Soup Recipe",
    "ingredients": [
      "▢ 2 1/2 lbs chicken whole",
      "▢ 4 to 5 ounces uncooked egg noodles",
      "▢ 12 to 15 cups low sodium chicken broth",
      "▢ 1 large sweet onion diced",
      "▢ 2 cups carrots diced",
      "▢ 1 cup celery stalk diced",
      "▢ 3 tablespoons salted butter",
      "▢ 1 teaspoon minced garlic",
      "▢ 1/4 cup chopped fresh flat leaf parsley",
      "▢ 1 teaspoon chopped fresh thyme",
      "▢ Salt and ground black pepper to taste"
    ],
    "instructions": [
      "Bring the chicken broth to a boil in a large cooking pot.",
      "Add-in 1 cup carrots, 3/4 cups celery, half of the diced onions, 1 teaspoon thyme, 1/4 cup chopped parsley. Let the broth reboil and continue to boil (covered) for 10 minutes.",
      "Put-in the whole chicken. Let the broth boil once more. Adjust the heat to a simmer and continue to cook the chicken for 60 to 90 minutes. This will make the chicken tender while extracting its flavor.",
      "Remove the chicken from the cooking pot. Let it cool down and then discard the skin and bones. Chop the chicken meat into small pieces.Make sure that the stock in the cooking pot is continuously simmering.",
      "Meanwhile melt the butter in a large saute pan.",
      "Saute the remaining onion, carrots, and celery. Add the garlic and continue to saute until the onion becomes soft.",
      "Add-in the chopped chicken. Saute for 5 minutes.",
      "Gently slide-in the contents of the saute pan (chicken and the vegetables) to the cooking pot where the stock is in. Increase the heat to medium and wait until the liquid boils.",
      "Add the egg noodles. Cook for 8 to 10 minutes. You can add water if needed.",
      "Add salt and pepper to taste.",
      "Transfer to a serving bowl.",
      "Serve. Share and enjoy!"
    ],
    "cooking_time": "1 hour",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/homemade-chicken-noodle-soup-recipe/",
    "image_url": "",
    "image_path": "",
    "category": "Chicken Dishes"
  },
  {
    "title": "Chicken Egg Fried Rice Recipe",
    "ingredients": [
      "▢ 4 ounces skinless and boneless chicken breasts thinly sliced",
      "▢ 2 eggs",
      "▢ 3 cups cooked white rice leftovers will do",
      "▢ 2 tablespoons butter",
      "▢ 1 tablespoon olive oil",
      "▢ 1 teaspoon garlic powder",
      "▢ 1/2 teaspoon salt",
      "▢ 1/2 cup frozen green peas"
    ],
    "instructions": [
      "Heat the olive oil in a wide pan.",
      "Once the oil turns hot, stir fry the chicken slices for 2 to 3 minutes until the chicken turns light brown.",
      "Melt-in the butter.",
      "Once the butter starts to get hot, crack the eggs-in. Let the eggs cook while quickly stirring to mix the yolk with the egg whites using your frying spatula, try to chop the eggs into several small pieces within the pan.",
      "Put-in the rice. Toss and continue cook for 3 minutes.",
      "Add-in the garlic powder, salt, and green peas. Toss while cooking for 3 to 5 minutes more.",
      "Transfer to a serving plate.",
      "Serve.Share and enjoy!"
    ],
    "cooking_time": "19 minutes",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/chicken-egg-fried-rice-recipe/",
    "image_url": "",
    "image_path": "",
    "category": "Chicken Dishes"
  },
  {
    "title": "How to Make Spaghetti with Meat Sauce",
    "ingredients": [
      "▢ 1 1/2 lbs ground beef 90% lean",
      "▢ 1 lb. spaghetti noodles",
      "▢ 3 cups tomato puree",
      "▢ 4 tablespoons tomato paste",
      "▢ 2 tablespoons olive oil",
      "▢ 2 teaspoons minced garlic",
      "▢ 1 medium yellow onion minced",
      "▢ 1/2 cup minced carrots",
      "▢ 1/2 teaspoon dried basil",
      "▢ 1/2 teaspoon dried thyme",
      "▢ 1/2 teaspoon dried oregano",
      "▢ 1 teaspoon salt",
      "▢ 1/4 teaspoon ground black pepper"
    ],
    "instructions": [
      "Cook the spaghetti noodles according to package instructions until al dente. Drain the water and arrange in a serving plate. Set aside.",
      "Start to make the meat by browning the beef. Do this by placing the meat in a deep pan. Turn-on the heat to medium. Cook the beef until brown while stirring once in awhile.",
      "Add-in the olive oil, garlic, onion, and carrots. Stir and cook until the onion turns soft.",
      "Pour-in the tomato puree. Stir and let boil. Cover and simmer for 15 to 20 minutes. Add water if the sauce starts to reduce.",
      "Remove the cover and put the heat back to medium. Add the oregano, thyme, basil, salt, and ground back pepper. Stir and cook for 3 minutes.",
      "Put-in the tomato paste. Stir and cook for 2 minutes.",
      "Top the spaghetti meat sauce over the cooked spaghetti noodles. Sprinkle Parmesan cheese on top.",
      "Serve. Share and enjoy!"
    ],
    "cooking_time": "45 minutes",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/how-to-make-spaghetti-with-meat-sauce/",
    "image_url": "",
    "image_path": "",
    "category": "Other Filipino Dishes"
  },
  {
    "title": "Rosemary Baked Chicken Recipe with Vegetables",
    "ingredients": [
      "▢ 4 boneless skinless chicken breasts around 3 to 4 ounces per piece",
      "▢ 2 teaspoons garlic powder",
      "▢ 3/4 to 1 teaspoon salt",
      "▢ 1 tablespoon dried rosemary",
      "▢ 1/4 teaspoon ground black pepper",
      "▢ 1 tablespoon lemon juice",
      "▢ 1 tablespoon olive oil",
      "▢ 1 pack frozen mixed vegetables thawed"
    ],
    "instructions": [
      "Combine rosemary, garlic powder, salt, pepper, and lemon juice, and olive oil in a bowl. Mix well.",
      "Meanwhile, cook the vegetables according to your preference. You can steam the vegetables or stir-fry them using a little cooking oil. Sprinkle some salt and pepper and arrange in a plate. Set aside.",
      "Rub the mixture over the chicken breasts. Arrange the chicken breasts in a resealable bag and pour-in the remaining mixture. Marinate for 15 to 30 minutes.",
      "Preheat the oven to 375 degrees Fahrenheit.",
      "Arrange the marinated chicken breasts in a baking pan.",
      "Bake one side for 15 minutes. Turn the chicken breasts over and bake the other side for another 15 minutes or until internal temperature reads 160 degrees Fahrenheit (you will need to use a meat thermometer to get the internal temperature of meats).",
      "Transfer the Baked Chicken on the plate where the vegetables are placed.",
      "Serve your baked chicken with vegetables. Share and enjoy!"
    ],
    "cooking_time": "45 minutes",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/rosemary-baked-chicken-recipe-vegetables/",
    "image_url": "",
    "image_path": "",
    "category": "Chicken Dishes"
  },
  {
    "title": "Easy Chicken Barbecue Recipe",
    "ingredients": [
      "▢ 1 1/2 to 2 lbs chicken cut into serving pieces",
      "▢ 1 recipe of chicken barbecue marinade",
      "▢ 1/4 cup barbecue sauce",
      "▢ 1 tablespoon soy sauce",
      "▢ 1 teaspoon lemon juice",
      "▢ 1/4 cup lemon lime soda"
    ],
    "instructions": [
      "Make the basting sauce by combining barbecue sauce, soy sauce, lemon juice, and lemon lime soda in a bowl. Mix well. Set aside.",
      "Arrange the chicken in a large bowl. Pour-in the chicken barbecue marinade. Make sure that all the chicken slices are coated with the marinade. Cover the bowl with a cling wrap. Refrigerate for at least 1 hour (the longer, the better).",
      "Heat-up your grill (around 320F). If you are using a charcoal grill, limit the charcoal in the two sides leaving an opening on the middle. If you are using a gas grill, only activate all the burner except the one in the middle (I am referring to the grill burners, not the one on the side, if your grill has one).",
      "Skewer at least 2 chicken slices in bamboo or metal skewers. Arrange the chicken in the middle of the grill wherein there is no direct heat in the bottom. The heat should be coming from the sides. This will take sometime to cook the chicken, but it prevents the skin from burning.",
      "Cover the grill (if applicable), and barbecue the chicken for 12 to 15 minutes.",
      "Turn the chicken over to barbecue the other side. Baste the top of the chicken with the basting sauce. Barbecue for another 12 to 15 minutes.",
      "Flip the chicken once more and baste the top part. Continue to barbecue for 12 to 15 minutes.",
      "Turn the chicken over for the last time and brush some basting sauce on the top part. Continue to barbecue for 12 to 15 minutes.",
      "Using a meat thermometer, measure the internal temperature of the chicken. A safe temperature for poultry is 165F. If the temperature of your chicken barbecue is 160F and above, this means you are done; otherwise, continue to barbecue the chicken until the desired internal temperature is achieved.",
      "Transfer to a serving plate.",
      "Serve. share and enjoy!"
    ],
    "cooking_time": "1 hour",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/chicken-barbecue/",
    "image_url": "",
    "image_path": "",
    "category": "Chicken Dishes"
  },
  {
    "title": "Recipe for Barbecue Chicken Marinade",
    "ingredients": [
      "▢ 12 oz. Lemon lime soda Sprite or 7-Up",
      "▢ 1/2 cup dark soy sauce",
      "▢ 1 large lemon",
      "▢ 1/2 teaspoon red chili flakes optional",
      "▢ 2 teaspoons salt",
      "▢ 1 tablespoon garlic powder",
      "▢ 1/2 teaspoon ground black pepper"
    ],
    "instructions": [
      "In a large bowl, Combine soy sauce, juice of 1 lemon, salt,  red chili flakes, ground black pepper, and garlic",
      "powder. Stir and mix well.",
      "Pour-in the lemon lime soda. Stir.",
      "You can use this to marinate chicken barbecue right on the spot, or you can place this inside the fridge for a day. Make sure to stir again before using."
    ],
    "cooking_time": "6 minutes",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/recipe-for-barbecue-chicken-marinade/",
    "image_url": "",
    "image_path": "",
    "category": "Chicken Dishes"
  },
  {
    "title": "Pancit Bato Mami (Noodle Soup)",
    "ingredients": [
      "▢ 1/2 lb. Pancit Bato",
      "▢ 1/4 head cabbage chopped",
      "▢ 1/2 cup carrot julienned",
      "▢ 3/4 cup snap peas",
      "▢ 2 cups chicken broth or stock",
      "▢ 2 cups water",
      "▢ 4 ounces pork sliced thinly",
      "▢ 2 tablespoons cooking oil",
      "▢ Salt and pepper to taste"
    ],
    "instructions": [
      "Heat oil in a soup pot.",
      "Once the oil becomes hot, saute the pork until the color turns light to medium brown (around 3 to 4 minutes).",
      "Pour-in the chicken broth or chicken stock and water. Let boil.",
      "Cover the soup pot and simmer for 20 minutes or until the pork becomes tender.",
      "Add-in the snap peas and carrots. Cook for 2 minutes.",
      "Put-in the cabbage and noodles. Stir and cook for 3 minutes.",
      "Sprinkle salt and pepper to taste. At this point, you can add more chicken broth (or water) if necessary.",
      "Transfer to a serving bowl. Serve.",
      "Share and enjoy!"
    ],
    "cooking_time": "30 minutes",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/pancit-bato-noodle-soup/",
    "image_url": "",
    "image_path": "",
    "category": "Soups And Stews"
  },
  {
    "title": "Crab and Pork Shumai Recipe (Siomai)",
    "ingredients": [
      "▢ 2 lbs ground pork",
      "▢ 12 ounces crab meat",
      "▢ 3 tbsp sesame oil",
      "▢ 1 large egg",
      "▢ 1 medium sweet onion minced",
      "▢ 1 cup minced carrots",
      "▢ 1 pack won ton wrapper",
      "▢ 1/2 teaspoon ground black pepper",
      "▢ 2 tsp salt",
      "▢ Cooking oil spray",
      "▢ 5 cups water for steaming"
    ],
    "instructions": [
      "In a large mixing bowl, combine the pork and crab meat. Mix well using a spatula or long wooden spoon.",
      "Add the sesame oil, egg, salt, pepper, onions, and carrots. Continue to mix until all the ingredients are properly incorporated. You can even mix using your hand if you feel comfortable doing this.",
      "Scoop around 1 to 1 1/2 teaspoon of mixture and place at the middle of a wonton wrapper.",
      "Fold the wonton wrapper to cover all the sides. Make sure that you leave the top open. Do this step until you are down with the last shumai. If you need more guidance on this step, this pork siomai recipe cooking video might be helpful.",
      "Spray cooking oil on the base of a bamboo or metal steamer to avoid the shumai from sticking. I use Pam cooking oil spray all the time, but feel free to use whatever brand suits you. If you do not have a cooking oil spray around, you can spread about a tablespoon of cooking oil using a paper towel.",
      "Arrange the shumai on steamer. Make sure that you leave a little space in between each piece to prevent the shumai from sticking to each other.",
      "Pour the water into the steamer and let boil.",
      "Steam the crab and pork shumai for 20 to 25 minutes.",
      "Remove from the steamer and serve with ponzu or soy sauce and a lemon dip.",
      "Share and enjoy!"
    ],
    "cooking_time": "35 minutes",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/crab-pork-shumai-recipe/",
    "image_url": "",
    "image_path": "",
    "category": "Street Food"
  },
  {
    "title": "Adobo Pork Chops",
    "ingredients": [
      "▢ 2 lbs. pork chops",
      "▢ 4 tablespoons dark soy sauce",
      "▢ 5 cloves garlic crushed",
      "▢ 3 tablespoons white or cane vinegar",
      "▢ 2 teaspoons whole peppercorn",
      "▢ 4 to 5 pieces dried bay leaves",
      "▢ 1 cup water",
      "▢ salt to taste if necessary",
      "▢ 3 tablespoons cooking oil"
    ],
    "instructions": [
      "Heat cooking oil in a wide and deep pan.",
      "Once the oil is hot, pan fry the pork chops turning them over once each side turns light to medium brown (this will take around 3 to 5 minutes per side depending on the thickness of your pork chops).",
      "Put-in the garlic, peppercorns, and bay leaves. Continue to cook until the garlic turns light brown (2 to 3 minutes).",
      "Pour-in water and soy sauce. Bring to a boil.",
      "Cover and simmer until the liquid reduces to half (around 40 to 50 minutes). You can add more water if needed.",
      "Pour-in the vinegar. Let the liquid boil. Stir and continue to cook (uncovered) for 10 minutes.",
      "Add salt if needed. The soy sauce alone gives this dish enough saltiness. You can add salt according to your preference.",
      "Serve with steamed white rice.",
      "Share and enjoy!"
    ],
    "cooking_time": "1 hour",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/adobo-pork-chops/",
    "image_url": "",
    "image_path": "",
    "category": "Chicken Dishes"
  },
  {
    "title": "Chili Garlic Shrimp Saute",
    "ingredients": [
      "▢ 1 lb. Shrimp cleaned",
      "▢ 2 tablespoons butter melted",
      "▢ 2 tablespoons olive oil",
      "▢ 1 teaspoon crushed red chili flakes",
      "▢ 1 teaspoon dried parsley flakes",
      "▢ 2 teaspoons minced garlic",
      "▢ Salt and pepper to taste"
    ],
    "instructions": [
      "Heat butter and olive oil in a saute pan.",
      "Put-in the garlic and crushed red chili flakes. Cook in medium heat until the garlic turns light brown (this will take between 2 to 3 minutes).",
      "Add the shrimp. Saute for 8 minutes.",
      "Sprinkle salt and pepper, and add the parsley flakes. Continue to cook for 2 to 4 minutes.",
      "Transfer to a serving plate. Serve.",
      "Share and enjoy!"
    ],
    "cooking_time": "20 minutes",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/chili-garlic-shrimp-saute/",
    "image_url": "",
    "image_path": "",
    "category": "Other Filipino Dishes"
  },
  {
    "title": "White Chocolate Chip Cookie",
    "ingredients": [
      "▢ 1 cup white chocolate chips",
      "▢ 2 1/2 cups all purpose flour",
      "▢ 1 cup granulated white sugar",
      "▢ 1 teaspoon baking soda",
      "▢ 2 medium eggs",
      "▢ 3/4 cup unsalted butter softened",
      "▢ 2 teaspoons vanilla extract",
      "▢ 1/2 teaspoon salt"
    ],
    "instructions": [
      "Combine AP flour, salt, and baking soda in a bowl. Mix well and set aside.",
      "Using a hand or stand mixer, cream the butter and then gradually add the sugar. Whisk-in the eggs and the vanilla extract.",
      "Gradually add-in the flour-mixture into the creamed butter mixture and fold using a spatula.",
      "Add the white chocolate chips and continue to fold until the ingredients are mixed well.",
      "Cover the mixing bowl with a cling wrap and refrigerate the dough for at least 3 hours (I usually do this 1 day in advance).",
      "Remove the cookie dough from the refrigerator and allow it stand in room temperature for 8 to 12 minutes.",
      "Preheat oven to 330 degrees Fahrenheit.",
      "Prepare the cookie sheet or baking tray by lining it with parchment paper.",
      "Scoop about 2 1/2 to 3 tablespoons of cookie dough and form it into a ball using your clean hands.You can add more white chocolate chips by pressing it in the ball. Arrange the cookie dough balls in the cookie sheet or baking tray. Make sure to leave space between each cookie dough balls as each will need more room when it flattens later on.",
      "Bake for 10 minutes. Remove from the oven and let the temperature cool down.",
      "Serve. Share and enjoy!"
    ],
    "cooking_time": "20 minutes",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/white-chocolate-chip-cookie/",
    "image_url": "",
    "image_path": "",
    "category": "Other Filipino Dishes"
  },
  {
    "title": "Brined Roast Beef",
    "ingredients": [
      "▢ 3 lbs ribeye or eye of round",
      "▢ 1 tablespoon sea salt",
      "▢ 1 teaspoon ground black pepper",
      "▢ 1 teaspoon garlic powder",
      "▢ 2 teaspoons garlic powder",
      "▢ 5 tablespoons sugar",
      "▢ 5 tablespoons sea salt",
      "▢ 2 1/2 tablespoons ground black pepper",
      "▢ 2 tablespoons ginger powder",
      "▢ 1 1/2 teaspoons cinnamon powder",
      "▢ 1 1/2 cups water",
      "▢ 3 cups ice cubes"
    ],
    "instructions": [
      "Combine all the brining ingredients in a saucepan, except for the ice cubes. Mix well.",
      "Place the saucepan in a stovetop. Let boil and continue to cook for 2 minutes.",
      "Arrange the ice cubes in a large metal mixing bowl. Pour-in the boiling mixture in the mixing bowl. Stir.",
      "Meanwhile, place the beef inside a large resealable bag. Pour the brine mixture inside the bag. Seal and place inside the refrigerator. Let it brine for 16 to 20 hours.",
      "After brining the meat, discard the brine. Preheat oven to 375 Fahrenheit.",
      "Rub salt, pepper, and garlic powder all over the meat and then place it in a roasting rack.",
      "Roast the beef for 23 to 27 minutes per pound. Note: A 3 lbs. beef needs to be roasted for 69 to 81 minutes.",
      "Remove the meat from the oven. Let is rest for 12 to 15 minutes.",
      "Carve the roast beef. Serve.",
      "Share and enjoy!"
    ],
    "cooking_time": "17 hours",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/brined-roast-beef-recipe/",
    "image_url": "",
    "image_path": "",
    "category": "Other Filipino Dishes"
  },
  {
    "title": "Snails with Spinach in Coconut Milk Recipe",
    "ingredients": [
      "▢ 2 lbs sea snails",
      "▢ 2 cups coconut milk",
      "▢ 1 cup chopped spinach",
      "▢ 2 tablespoons shrimp paste bagoong alamang",
      "▢ 1 tablespoon fish sauce paris",
      "▢ 1 medium onion minced",
      "▢ 1 thumb ginger minced",
      "▢ 1 teaspoon minced garlic",
      "▢ 3 tablespoons cooking oil",
      "▢ 1/4 teaspoon ground black pepper",
      "▢ 1 teaspoon crushed red pepper"
    ],
    "instructions": [
      "Heat the cooking oil in a cooking pot.",
      "Saute the garlic, ginger, and onion when the oil becomes hot.",
      "Add-in the ground black pepper and crushed red pepper. Stir.",
      "Pour-in the coconut milk. Let boil. Simmer (cook in low heat) for 10 minutes.",
      "Add-in the sea snails. Increase the heat to medium. Stir and cover. Cook for 15 to 20 minutes while gently stirring every 3 minutes.",
      "Put-in the spinach. Stir and continue to cook for 3 minutes.",
      "Transfer to a serving plate.",
      "Serve. Share and enjoy!"
    ],
    "cooking_time": "50 minutes",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/snails-spinach-coconut-milk/",
    "image_url": "",
    "image_path": "",
    "category": "Seafood"
  }
]