[
  {
    "title": "Corn Soup with Mussels and Malunggay",
    "ingredients": [
      "▢ 1 lb. mussels tahong, cleaned",
      "▢ 1 14 oz. can whole kernel corn",
      "▢ 1 cup malunggay leaves",
      "▢ 2 cups chicken broth",
      "▢ 2 cups water",
      "▢ 1/2 teaspoon ginger minced",
      "▢ 1 medium yellow onion minced",
      "▢ 1/2 teaspoon garlic powder",
      "▢ salt and pepper to taste",
      "▢ 2 tablespoons cooking oil"
    ],
    "instructions": [
      "Drain the water from the canned corn. Process the corn using a food processor or blender. Set aside.",
      "Heat the oil in a cooking pot.",
      "Once the oil gets hot, sauté the ginger and onion.",
      "Add the garlic powder, corn, and mussels. Cook for minute.",
      "Pour-in the water and chicken broth. Let boil. Simmer for 8 minutes.",
      "Add the malunggay leaves, salt, and pepper. Stir. Cook for 2 to 3 minutes.",
      "Transfer to as serving bowl.",
      "Serve hot. Share and enjoy!"
    ],
    "cooking_time": "38 minutes",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/corn-soup-with-mussels-and-malunggay/",
    "image_url": "",
    "image_path": "",
    "category": "Street Food"
  },
  {
    "title": "Binagoongang Baboy Recipe (Pork in Shrimp Paste)",
    "ingredients": [
      "▢ 1 1/2 lbs. pork shoulders cut into cubes",
      "▢ 1/4 cup shrimp paste cooked",
      "▢ 2 medium plum tomatoes diced",
      "▢ 1 large yellow onion diced",
      "▢ 1 teaspoon minced garlic",
      "▢ 2 1/2 cups beef broth",
      "▢ 1 medium Chinese eggplant sliced",
      "▢ 1/4 teaspoon ground black pepper",
      "▢ 3 tablespoons cooking oil"
    ],
    "instructions": [
      "Heat the oil in a cooking pot.",
      "Pan fry the sliced eggplants for 3 minutes per side. Remove the fried eggplants and place in a plate. Set aside.",
      "On the same pan, add the garlic, tomato, and onion. Saute for 5 minutes or until both onions and tomatoes are soft.Note: add more cooking oil if needed.",
      "Add the pork slices in. Cook until the color of the pork turns light brown.",
      "Pour-in the beed broth. Let boil. Cover and simmer for 45 to 60 minutes or until the pork is tender.",
      "Add the shrimp paste. Stir and cook in low to medium heat for 3 to 5 minutes. Note: there should still be some liquid in the pot. If the pot is almost dry, add 1 cup of beef broth.",
      "Add the fried eggplant.",
      "Tranfer to a serving plate.",
      "Serve. Share and enjoy!"
    ],
    "cooking_time": "1 hour",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/binagoongang-baboy-recipe-pork-in-shrimp-paste/",
    "image_url": "",
    "image_path": "",
    "category": "Pork Dishes"
  },
  {
    "title": "Easy Fish with Tausi Recipe (Fish with Salted Black Beans)",
    "ingredients": [
      "▢ 1 lb. fish fillet mahi-mahi, cod, or cream dory, cut into cubes",
      "▢ 3 tablespoons salted black beans tausi",
      "▢ ½ teaspoon minced ginger",
      "▢ ½ teaspoon minced garlic",
      "▢ 4 stalks green onion chopped",
      "▢ 1 1/2 teaspoon sesame oil",
      "▢ 5 tablespoons sherry cooking wine",
      "▢ ½ teaspoon salt",
      "▢ 3 ½ tablespoons cornstarch",
      "▢ ¾ cups chicken stock",
      "▢ ¼ teaspoon ground black pepper",
      "▢ ½ teaspoon sugar",
      "▢ 1 cup cooking oil"
    ],
    "instructions": [
      "Marinate the fish by combining 3 tbsp. sherry cooking wine, salt, and 1 tsp. sesame oil in a bowl. Mix well. Add the fish cubes and marinate for 30 minutes.",
      "Soak the salted black beans in warm water for 15 minutes. Drain and set aside. We will use this later.",
      "Start to fry the fish by heating the oil in a cooking pot. Remove the fish from the marinade. Roll the fish cubes on a bowl with 3 tablespoons cornstarch. Make sure that the fish is fully coated. Fry the coated fish until the color turns light brown. Remove from the cooking pot and place in a plate. Set aside.",
      "Make the sauce by combining the chicken broth, ½ tsp sesame oil, 2 tbsp. sherry cooking wine, ground black pepper, ½ tbsp. cornstarch, and sugar. Mix well.",
      "On a separate frying pan, heat 3 tablespoons of cooking oil (re-use the oil that fried the fish). Saute garlic, ginger, and salted black beans for 30 to 60 seconds.",
      "Put-in the fried fish cubes. Stir.",
      "Pour-in the sauce mixture. Stir and continue to cook until the sauce starts to thicken.",
      "Sprinkle some green onions.",
      "Transfer to a serving plate. Serve.",
      "Share and enjoy!"
    ],
    "cooking_time": "1 hour",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/easy-fish-with-tausi-recipe/",
    "image_url": "",
    "image_path": "",
    "category": "Chicken Dishes"
  },
  {
    "title": "Chicken with Oyster Sauce Stir Fry",
    "ingredients": [
      "▢ 1 lb. boneless chicken breast sliced into thin strips",
      "▢ 3 tablespoons oyster sauce",
      "▢ 2 tablespoons sherry cooking wine",
      "▢ ¼ teaspoon ground black pepper",
      "▢ ¼ teaspoon salt",
      "▢ ½ cup chicken stock",
      "▢ ½ teaspoon cornstarch",
      "▢ 1 ½ cups bell peppers sliced into strips (use any color that you want)",
      "▢ 3 tablespoons cooking oil"
    ],
    "instructions": [
      "Combine oyster sauce, sherry cooking wine, ground black pepper, and salt in a bowl. Mix well.",
      "Add the thinly sliced chicken. Marinate for 10 minutes.",
      "Heat 1 tablespoon cooking oil in a pan",
      "Once the oil becomes hot, stir-fry the bell peppers for 1 minute. Remove from the pan and set aside.",
      "Pour the remaining cooking oil on the same pan. Once the oil gets how, put the marinated chicken in the pan including the remaining marinade. Stir fry for 5 minutes or until the chicken turns light to medium brown.",
      "Add the cooked bell peppers. Continue to stir-fry for a few seconds.",
      "Combine the chicken stock and cornstarch. Mix well and then pour into the pan. Stir-fry until the texture of the sauce thickens.",
      "Transfer to a serving plate."
    ],
    "cooking_time": "28 minutes",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/chicken-with-oyster-sauce-stir-fry/",
    "image_url": "",
    "image_path": "",
    "category": "Chicken Dishes"
  },
  {
    "title": "Monggo with Tuyo Recipe (Mung Beans with Salted Fish)",
    "ingredients": [
      "▢ 2 cups mung beans monggo",
      "▢ 6 pieces bottled tuyo or fried tuyo, head removed",
      "▢ 2 cups malunggay leaves",
      "▢ 2 to 3 tablespoons fish sauce patis",
      "▢ 1 tablespoon garlic minced",
      "▢ 5 cups water",
      "▢ Ground black pepper to taste",
      "▢ 1 medium yellow onion sliced",
      "▢ 2 medium plum tomatoes diced",
      "▢ 3 tablespoons cooking oil"
    ],
    "instructions": [
      "Pour 5 cups of water in a cooking pot. Let boil.",
      "Put-in the mung beans. Cover and cook in low to medium heat until the mung beans completely absorb the water. Add more water if needed. Set aside.",
      "Heat the oil in a large cooking pot.",
      "Sauté the onion, tomato, and garlic",
      "Once the onion gets soft, add the salted fish (tuyo). Cook for 1 minute.",
      "Add the cooked mung beans. Stir.",
      "Put-in the malunggay leaves, fish sauce, and 1 cup water. Stir and cook uncovered for 3 to 7 minutes or until the desired consistency is achieved. You can add more water if needed.",
      "Sprinkle some ground black pepper to taste.",
      "Transfer to a serving bowl. Serve.",
      "Share and enjoy!"
    ],
    "cooking_time": "1 hour",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/monggo-with-tuyo-recipe-mung-beans-with-salted-fish/",
    "image_url": "",
    "image_path": "",
    "category": "Seafood"
  },
  {
    "title": "Kangkong in Oyster Sauce Recipe",
    "ingredients": [
      "▢ 1 bunch kangkong Ongchoy or water spinach, cleaned",
      "▢ 3 tablespoons oyster sauce",
      "▢ 3 tablespoons toasted garlic",
      "▢ ¾ cup beef broth",
      "▢ ½ teaspoon cornstarch",
      "▢ Salt and ground black pepper to taste",
      "▢ ¼ teaspoon red pepper flakes optional",
      "▢ 1 teaspoon toasted sesame seeds optional",
      "▢ 2 tablespoons cooking oil"
    ],
    "instructions": [
      "Separated the kangkong leaves from the stalk. Cut the stalk into 2 inch length pieces. Set aside.",
      "Prepare the toasted garlic by following this guide: How to make toasted garlic. Set aside.",
      "In a bowl, combine beef broth, oyster sauce, and corn starch. Mix well.",
      "Heat 2 tablespoons of cooking oil (preferably the one used to make toasted garlic) in a pan.",
      "When the oil gets hot, put-in the sliced kangkong stalks. Cook for 2 minutes.",
      "Pour-in the oyster sauce, beef broth, and cornstarch mixture. Add the toasted garlic. Stir. Cook for 1 minute of until the sauce starts to thicken.",
      "Add the kangkong leaves and red pepper flakes. Let it cook for 1 to 2 minutes.",
      "Sprinkle salt and ground black pepper to taste.",
      "Transfer to a serving bowl. Sprinkle sesame seeds on top.",
      "Share and enjoy!"
    ],
    "cooking_time": "25 minutes",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/kangkong-oyster-sauce-recipe/",
    "image_url": "",
    "image_path": "",
    "category": "Vegetable Dishes"
  },
  {
    "title": "Chicken Dynamite Lumpia Recipe",
    "ingredients": [
      "▢ 1 lb. ground chicken",
      "▢ 1 teaspoon garlic powder",
      "▢ 1 teaspoon onion powder",
      "▢ ¼ teaspoon ground black pepper",
      "▢ ½ teaspoon salt",
      "▢ 1 cup bread crumbs",
      "▢ 10 pieces long green pepper siling pansigang or finger peppers",
      "▢ Lumpia wrappers",
      "▢ 1 cup Panko bread crumbs",
      "▢ 2 eggs",
      "▢ 1 ½ cups cooking oil"
    ],
    "instructions": [
      "In a bowl, combine the ground chicken, garlic powder, onion powder, 1 piece egg, and bread crumbs, salt and ground black pepper. Mix well. Set aside.",
      "Arrange the long green pepper in the middle of the lumpia wrapper. Cover the pepper with 1 to 2 tablespoons of the ground chicken mixture. Wrap the pepper and chicken mixture. See this egg roll recipe video for guidance. However, you will only need to cover one side completely; the side with the pepper stem should be open so that part of the pepper will be visible.",
      "Heat the cooking oil in a frying pan.",
      "While the oil is being heated, beat an egg in a wide bowl.",
      "Dip the wrapped lumpia in beaten egg then roll over the Panko bread crumbs. Make sure that the lumpia is fully coated with crumbs.",
      "Gently place each piece of lumpia on the frying pan. Fry in low to medium heat for 5 to 6 minutes per side or until the color of the outer part turns golden brown. Note: the oil should be hot enough to fry the lumpia, but not too hot to the point of quickly browning the bread crumbs (250F is good enough). Otherwise, there is a possibility that the chicken will be somewhat raw.",
      "Transfer to a plate line with paper towels. This will absorb the oil.",
      "Arrange in a serving plate.",
      "Serve. Share and enjoy!"
    ],
    "cooking_time": "27 minutes",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/chicken-dynamite-lumpia-recipe/",
    "image_url": "",
    "image_path": "",
    "category": "Vegetable Dishes"
  },
  {
    "title": "Quick and Easy Beef and Pepper Stir Fry",
    "ingredients": [
      "▢ 1 lb. beef sirloin sliced thinly",
      "▢ 1/4 cup  red bell pepper chopped",
      "▢ 1/4 cup  yellow bell pepper chopped",
      "▢ 1/2 cup green bell pepper chopped",
      "▢ 1 piece  yellow onion sliced",
      "▢ 2 tablespoons light soy sauce",
      "▢ 1/4 cup oyster sauce",
      "▢ 3 tablespoons cornstarch",
      "▢ 1/4 teaspoon ground black pepper",
      "▢ 1/4 teaspoon salt",
      "▢ 4 tablespoons cooking oil"
    ],
    "instructions": [
      "In large bowl, combine beef, soy sauce oyster sauce, salt, and pepper. Mix well. Let is stand for 10 minutes.",
      "Add the cornstarch. Continue to mix until all the ingredients are well blended. Set aside.",
      "Meanwhile, heat a pan. Spray or pour cooking oil. Once the oil becomes hot, add the onion and peppers. Stir fry for 2 to 3 minutes.",
      "Transfer the cooked onion and peppers on a plate. Set aside.",
      "Add oil to the same pan. Put-in the beef. Stir fry until the beef turns medium brown (around 7 to 8 minutes). Make sure that you are cooking in very high heat. Add more cooking time if needed.",
      "Add the cooked onion and peppers. Continue to stir fry for 1 minute.",
      "Transfer to a serving plate.",
      "Serve with rice. Share and enjoy!"
    ],
    "cooking_time": "30 minutes",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/quick-and-easy-beef-and-pepper-stir-fry/",
    "image_url": "",
    "image_path": "",
    "category": "Other Filipino Dishes"
  },
  {
    "title": "Relyenong Tahong (Stuffed Mussels)",
    "ingredients": [
      "▢ 1 lb. ground pork",
      "▢ 16 to 20 pieces mussels cleaned and other shell removed",
      "▢ 1/2 teaspoon onion powder",
      "▢ 1 teaspoon garlic powder",
      "▢ 6 strips bacon chopped",
      "▢ 2 tablespoons chopped parsley",
      "▢ 1/2 cup shredded sharp cheddar cheese",
      "▢ 1 egg",
      "▢ 1/2 teaspoon salt",
      "▢ 1 /4 teaspoon ground black pepper"
    ],
    "instructions": [
      "In a mixing bowl, combine all the ingredients. Mix well until everything is blended.",
      "Scoop around 1 to 1 1/2 tablespoons of mixture and stuff it into the mussels. Do this step until all the mussels have stuffings.",
      "Arrange the stuffed mussels on a baking tray.",
      "Preheat oven to 370F.",
      "Place the tray with stuffed mussels in the oven. Bake for 30 to 40 minutes.",
      "Remove from the oven and arrange in a serving plate.",
      "Serve with banana ketchup.",
      "Share and enjoy!"
    ],
    "cooking_time": "55 minutes",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/relyenong-tahong-stuffed-mussels/",
    "image_url": "",
    "image_path": "",
    "category": "Street Food"
  },
  {
    "title": "Chicken Embutido Recipe",
    "ingredients": [
      "▢ 3 lbs. ground chicken",
      "▢ 1 red bell pepper minced",
      "▢ 1 green bell pepper minced",
      "▢ 1 yellow onion minced",
      "▢ 3 eggs",
      "▢ 8 oz  tomato sauce",
      "▢ 1 cup raisins",
      "▢ 1 cup  carrots minced",
      "▢ 3/4 cups sharp cheddar cheese grated",
      "▢ 1 1/2 cups bread crumbs",
      "▢ 1/4 cup olive oil",
      "▢ 1/4 cup sweet pickle relish",
      "▢ 1/2 teaspoon ground black pepper",
      "▢ 1 teaspoon salt"
    ],
    "instructions": [
      "In a large mixing bowl, combine the ground chicken, carrots, bell peppers, onion, raisins, sweet relish, cheese, and tomato sauce. Mix well.",
      "Pour-in the olive oil. Add the salt and pepper. Continue to stir until all the ingredients are well blended.",
      "Put the eggs and bread crumbs in the mixing bowl. Continue to mix with the other ingredients.",
      "Wrap the mixture (around 1 to 1 1/4 cup) in aluminum foil. Do this step until all the mixture are consumed.",
      "Arranged the chicken embutido in a steamer. Steam for 45 to 60 minutes.",
      "Remove the steamed embutido from the steamer. Let it cool down. You can also place it in the fridge.",
      "Slice the embutido and arrange in a serving plate.",
      "Serve chilled. Share and enjoy!"
    ],
    "cooking_time": "1 hour",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/chicken-embutido-recipe/",
    "image_url": "",
    "image_path": "",
    "category": "Chicken Dishes"
  },
  {
    "title": "Sinigang na Isda sa Kamias with Miso",
    "ingredients": [
      "▢ 1 lb. fish fillet or whole fish with bones",
      "▢ 2 cups bilimbi kamias",
      "▢ 2 medium tomatoes quartered",
      "▢ 1 medium onion quartered",
      "▢ 1 bunch string beans cut in 2 inch length",
      "▢ 8 to 10 pieces okra",
      "▢ 1 bunch kangkong ongchoy or water spinach, cleaned and chopped",
      "▢ 2 pieces long green pepper",
      "▢ 5 cups water",
      "▢ 3 tablespoons miso paste shiromiso or yellow miso",
      "▢ 2 tablespoons fish sauce"
    ],
    "instructions": [
      "Pour water in a cooking pot. Bring to a boil.",
      "Add the tomato, onion, and kamias. continue to boil for a minute.",
      "Add the miso paste. Stir and boil for 10 minutes more while covered.",
      "Gently add the fish fillet in the cooking pot. Cook in medium heat for 10 to 12 minutes.",
      "Add the long green pepper, string beans, and okra. Cook for 5 to 7 minutes.",
      "Pour-in the fish sauce. Stir.",
      "Add the kangkong. Cover the cooking pot and turn the heat off. Let it stay covered for 8 minutes.",
      "Transfer to a serving bowl. Serve.",
      "Share and enjoy!"
    ],
    "cooking_time": "45 minutes",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/sinigang-na-isda-sa-kamias-miso/",
    "image_url": "",
    "image_path": "",
    "category": "Seafood"
  }
]