[
  {
    "title": "Ginataang Monggo with Pork Recipe",
    "ingredients": [
      "▢ 7 ounces mung beans soaked in 4 cups water overnight",
      "▢ 1 Knorr Pork Cube",
      "▢ 1/2 lb pork belly sliced into thin small pieces",
      "▢ 2 cups coconut milk",
      "▢ 1 bunch fresh spinach",
      "▢ 3/4 cup ampalaya leaves",
      "▢ 4 pieces Thai chili pepper optional",
      "▢ 1 medium white onion chopped",
      "▢ 5 cloves garlic minced",
      "▢ 3 tablespoons fish sauce",
      "▢ 1/2 teaspoon ground black pepper",
      "▢ 4 to 6 cups water"
    ],
    "instructions": [
      "Heat a cooking pot.",
      "Put the pork into the pot. Sear until oil is extracted.",
      "Add onion and garlic. Saute until onion becomes soft.",
      "Add the mung beans. Stir. Continue to saute for 2 to 3 minutes. Note: the texture of the monggo should be soft as a result of soaking in water overnight.",
      "Pour-in 4 cups water and then add coconut milk. Let boil.",
      "Add Knorr Pork Cube. Stir. Cover and cook between low to medium heat for 30 to 35 minutes. Note: add more water if the liquid starts to dry-up.",
      "Put the greens (ampalaya leaves and spinach) and chili pepper into the pot. Cover the pot and cook for 2 minutes.",
      "Add fish sauce (patis) and ground black pepper. Stir.",
      "Transfer to a serving bowl. Serve.",
      "Share and enjoy."
    ],
    "cooking_time": "1 hour",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/ginataang-monggo-with-pork-recipe/",
    "image_url": "",
    "image_path": "",
    "category": "Pork Dishes"
  },
  {
    "title": "Healthy Chicken Menudo",
    "ingredients": [
      "▢ 1 lb. boneless chicken breast cubed",
      "▢ 1 medium carrot cubed",
      "▢ 1 medium baking potato cubed",
      "▢ 1 small red bell pepper cut into squares",
      "▢ 1 small green bell pepper cut into squares",
      "▢ 1/4 cup raisins",
      "▢ 1 medium red onion",
      "▢ 4 cloves garlic crushed",
      "▢ 8 ounces tomato sauce",
      "▢ 3 to 4 tablespoons light soy sauce",
      "▢ 1/2 piece lime",
      "▢ 1 teaspoon garlic powder",
      "▢ 1 1/2 cup chicken broth low sodium",
      "▢ 3 tablespoons Safflower oil",
      "▢ Salt and ground black pepper to taste"
    ],
    "instructions": [
      "Arrange chicken in a bowl.Add lime (or calamansi) and pour soy sauce. Also add garlic powder. Mix well. Let it stay for 30 minutes.",
      "Heat a pan and pour safflower oil.",
      "Once the oil becomes hot, saute onion and garlic until onion becomes soft.",
      "Add the marinated chicken. Continue to cook until the chicken turns light brown.",
      "Pour tomato sauce into the pan. Stir.",
      "Pour chicken broth. Let boil. Continue to cook uncovered in medium heat until the sauce reduces to half.",
      "Add raisin, carrot, and potato. Cover the pan. Cook between low to medium heat for 8 to 10 minutes.",
      "Add the bell peppers. Continue to cook for 5 minutes. Note: add more chicken broth or water if needed.",
      "Sprinkle some ground black pepper to taste.",
      "Tranfer to a serving plate. Serve.",
      "Share and enjoy."
    ],
    "cooking_time": "1 hour",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/healthy-chicken-menudo/",
    "image_url": "",
    "image_path": "",
    "category": "Main Dishes"
  },
  {
    "title": "No Bake Lasagna Pinoy Style",
    "ingredients": [
      "▢ 12 piece lasagna",
      "▢ 8 cups water",
      "▢ 2 teaspoons salt",
      "▢ 3/4 cup shredded cheddar cheese",
      "▢ 1 1/2 to 1 3/4 cups evaporated milk",
      "▢ 5 to 6 tablespoons all-purpose flour",
      "▢ 1/4 cup butter",
      "▢ 1/2 teaspoon salt",
      "▢ 1/2 cup shredded cheddar cheese",
      "▢ 1 lb. ground pork",
      "▢ 1 piece yellow onion chopped",
      "▢ 5 cloves garlic crushed and chopped",
      "▢ 2 cans cans tomato sauce 15 oz.",
      "▢ 1 can  tomato paste 6 oz.",
      "▢ 1 teaspoon crushed dried basil",
      "▢ 1/4 cup chopped parsley",
      "▢ Salt and ground black pepper to taste"
    ],
    "instructions": [
      "Prepare the meat sauce by searing the ground pork until light brown. Do this by heating a pan and then add the ground pork. Let the pork cook for 30 seconds and then stir for 15 seconds while trying to separate the meat from each other. Let the side that touches the pan cook for another 30 seconds and then repeat the process until the pork turns light to medium brown.",
      "Add onion. Saute for 30 seconds.",
      "Add garlic. Continue to cook until onion becomes soft.",
      "Add chopped parsley and dried basil. Stir.",
      "Pour tomato sauce into the pan. Stir. Let boil. Cover and cook in low heat for 15 minutes.",
      "Add tomato paste. Stir. Cover and cook in low heat for 12 minutes or until the sauce thickens.",
      "Add salt and ground black pepper. Set the meat sauce aside.",
      "Start to prepare the white sauce by melting the butter in a sauce pan.",
      "Gradually add the flour. Stir the mixture continuously until it forms a huge lump.",
      "Pour milk into the sauce pan. Stir thoroughly until the mixture becomes thick and smooth.",
      "Add cheese. Stir until melted. Set the white sauce aside.",
      "Boil water in a cooking pot. Add salt. Boil the lasagna for 10 minutes or use the instruction from the package.",
      "Let the lasagna cool down by discarding the water. You can add tap water to it so that it won't be soggy and for it to cool down quickly.",
      "Assemble the lasagna in a square or rectangular baking pan by pouring the meat sauce into the pan. Top with a layer of lasagna (around 4 pieces). Top the lasagna layer with meat sauce, followed by the white sauce. Continue the process by doing the same step until the lasagna is consumed. Finalize the topping by adding shredded cheese on top.",
      "Microwave for 8 to 10 minutes.",
      "Serve. Share and enjoy!"
    ],
    "cooking_time": "1 hour",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/no-bake-lasagna-pinoy-style/",
    "image_url": "",
    "image_path": "",
    "category": "Pork Dishes"
  },
  {
    "title": "Puto Cake",
    "ingredients": [
      "▢ 1 1/2 cup evaporated milk",
      "▢ 2 pieces salted eggs thinly sliced",
      "▢ 2 raw eggs",
      "▢ 2 teaspoons Vanilla extract optional",
      "▢ 1 3/4 cups cake flour",
      "▢ 3/4 cups granulated white sugar",
      "▢ 3 teaspoons baking powder",
      "▢ 1/4 teaspoon salt"
    ],
    "instructions": [
      "Sift the dry ingredients together in a bowl. Mix thoroughly using a wire whisk.",
      "Gradually pour milk into the mixture while whisking. You can also use a hand mixer, but it is not necessary.",
      "Add eggs. Continue to whisk until the mixture is well blended and the texture is soft. Note: you can also add vanilla extract in this step if desired.",
      "Pour the mixture into a mold such as a llanera or round baking pan.",
      "In a coking pot, boil water for steaming.",
      "Arrange the llanera mold in a steamer. Cover and steam for 12 minutes.",
      "Top with salted eggs. Continue to steam for 18 minutes or until it passes the toothpick test.",
      "Remove from the steamer. Let it cool down.",
      "Gently take the cake puto out of the mold and arrange in a plate.",
      "Serve for merienda. This can also be enjoyed with dinuguan.",
      "Share and enjoy!"
    ],
    "cooking_time": "45 minutes",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/puto-cake/",
    "image_url": "",
    "image_path": "",
    "category": "Desserts"
  },
  {
    "title": "Popcorn Chicken Recipe",
    "ingredients": [
      "▢ 1 lb. boneless chicken breast sliced into cubes",
      "▢ 1/2 teaspoon garlic powder",
      "▢ 1/4 teaspoon ground black pepper",
      "▢ 1 teaspoon salt",
      "▢ 1 teaspoon paprika optional",
      "▢ 2 eggs",
      "▢ 1 cup all-purpose flour",
      "▢ 3 to 4 cups cooking oil"
    ],
    "instructions": [
      "Place chicken in a bowl. Add garlic powder, ground black pepper, salt, and paprika. Mix well. Let the chicken absorb the seasonings for 10 minutes.",
      "Meanwhile, Crack the eggs in a bowl. Beat.",
      "Place flour in a bowl. Line-up with the bowl of beaten egg and then the one the marinated chicken breasts.",
      "Heat the oil in a cooking pot to 300F.",
      "Dip each piece of chicken in beaten egg, and then dredge in flour. Make sure that the chicken gets coated with flour all over. Put in a clean plate or bowl.",
      "Double coat the chicken by repeating the previous step (dip in egg again and then dredge in flour).",
      "Deep fry each coated chicken piece for 3 to 5 minutes or until light to medium brown. Remove from the pot and let the excess oil drip.",
      "Arrange in a a serving plate with your favorite dip. I suggest that you serve this with ranch. Here is the recipe."
    ],
    "cooking_time": "17 minutes",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/popcorn-chicken-recipe-2/",
    "image_url": "",
    "image_path": "",
    "category": "Chicken Dishes"
  },
  {
    "title": "Bacon and Egg Filipino Chicken Adobo",
    "ingredients": [
      "▢ 2 lbs. chicken sliced into serving pieces",
      "▢ 4 boiled eggs",
      "▢ 5 bacon strips chopped",
      "▢ ¾ cup water",
      "▢ 1 tablespoon brown sugar",
      "▢ Salt to taste optional",
      "▢ Marinade ingredients:",
      "▢ 5 cloves garlic crushed",
      "▢ ¼ cup soy sauce",
      "▢ ½ cup white vinegar",
      "▢ 1 tablespoon whole peppercorn"
    ],
    "instructions": [
      "Combine chicken, garlic, vinegar, soy sauce and whole peppercorn in a bowl. Mix well. Cover the bowl and marinate the chicken for at least 3 hours. Note:I suggest to marinate overnight for better results.",
      "Heat the bacon in a pan. Continue to cook the bacon until the oil is extracted and the bacon becomes crispy. Remove the bacon from the pan. Set aside.",
      "Pan-fry the marinated chicken in bacon grease (usen medium heat) for 3 minutes per side. Add the garlic used to marinate the chicken.",
      "Pour the remaining marinade ingredients in the pan and add water. Also add the crisp bacon. Let boil. Cover and cook between low to medium heat for 30 minutes.",
      "Add the brown sugar. Stir.",
      "Add boiled eggs. Cook for 2 minutes.",
      "Transfer to a serving plate. Serve.",
      "Share and enjoy!"
    ],
    "cooking_time": "1 hour",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/bacon-and-egg-filipino-chicken-adobo/",
    "image_url": "",
    "image_path": "",
    "category": "Chicken Dishes"
  },
  {
    "title": "How to Cook Crispy Pork Knuckles",
    "ingredients": [
      "▢ 2 ½ to 3 lbs. Pork hock pata, sliced",
      "▢ 3 cups cooking oil",
      "▢ 1 bunch lemongrass tanglad, tied into knots",
      "▢ 1 tablespoon whole peppercorn",
      "▢ 5 cloves garlic crushed",
      "▢ 1 tablespoon salt",
      "▢ 6 cups water for boiling",
      "▢ ½ small red onion minced",
      "▢ 4 pieces Thai chili chopped",
      "▢ 2 tablespoons chopped scallions",
      "▢ ½ cup white vinegar",
      "▢ 2 tablespoons soy sauce",
      "▢ ¼ teaspoon garlic powder"
    ],
    "instructions": [
      "Pour water in a pressure cooker. Let boil.",
      "Add pata slices, lemongrass (dahon ng tanglad), garlic, and whole peppercorn. Pressure cook for 20 to 25 minutes.",
      "Remove the tender pata from the pressure cooker. Place in a clean plate.",
      "Season with salt. Gently rub the salt all over the pata.",
      "Heat the oil in a deep fryer or a deep cooking pot. Deep fry the pata slices for 6 minutes.",
      "Let the pata cool down, and then deep fry for another 3 minutes.",
      "Remove from the fryer. Let the excess oil drip.",
      "Arrange in a serving plate and then prepare the crispy pata dipping sauce.",
      "Serve. Share and enjoy!"
    ],
    "cooking_time": "55 minutes",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/putok-batok-crispy-pata-slices/",
    "image_url": "",
    "image_path": "",
    "category": "Pork Dishes"
  },
  {
    "title": "Ginisang Ampalaya na May Itlog at Hipon (Sauteed Bitter Gourd)",
    "ingredients": [
      "▢ 1 small ampalaya cored and sliced",
      "▢ 1 medium tomato chopped",
      "▢ 1 small yellow onion chopped",
      "▢ 3 cloves garlic crushed",
      "▢ 1 egg",
      "▢ 5 pieces medium shrimp shell removed",
      "▢ 1/2 teaspoon garlic powder",
      "▢ 1/4 teaspoon salt",
      "▢ 1/4 teaspoon ground black pepper",
      "▢ 3 tablespoons cooking oil"
    ],
    "instructions": [
      "Sprinkle salt, ground black pepper, and garlic powder all over the shrimp. Rub. Let it stay for 5 minutes.",
      "Crack the egg and place in a bowl. Beat until smooth. Set aside.",
      "Spray or pour cooking oil in a wok. Pan-fry shrimp for 1 minute per side. Remove from the wok. Set aside.",
      "Pour oil on the wok. Let it heat-up.",
      "Saute onion, garlic, and tomato. Continue to cook until the onion and tomato softens.",
      "Add the ampalaya (bitter gourd). Cook for 3 minutes.",
      "Pour beaten egg into the wok. Stir-fry until the eggs are cooked.",
      "Put the shrimp back into the wok. Stir.",
      "Season with salt and ground black pepper.",
      "Transfer to a serving plate. Serve.",
      "Share and enjoy!"
    ],
    "cooking_time": "20 minutes",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/ginisang-ampalaya-na-may-itlog-at-hipon-sauteed-bitter-melon-with-egg-and-shrimp/",
    "image_url": "",
    "image_path": "",
    "category": "Vegetable Dishes"
  },
  {
    "title": "Chicken Meatball Noodle Soup",
    "ingredients": [
      "▢ 8 ounces egg noodles",
      "▢ 1 Knorr Chicken Cube",
      "▢ 3 celery stalks chopped",
      "▢ 1 medium carrot chopped",
      "▢ 1 medium yellow onion chopped",
      "▢ 3 cloves garlic crushed",
      "▢ 2 bay leaves",
      "▢ 5 cups water",
      "▢ Salt and ground black pepper to taste",
      "▢ 3 tablespoons olive oil",
      "▢ 1 lb. ground chicken",
      "▢ ½ cup bread crumbs",
      "▢ ¼ cup chopped parsley",
      "▢ 1 teaspoon onion powder",
      "▢ 1 teaspoon garlic powder",
      "▢ 1 egg",
      "▢ 1 teaspoon salt",
      "▢ ½ teaspoon ground black pepper"
    ],
    "instructions": [
      "Combine the meatball ingredients in a bowl. Mix well. Set aside.",
      "Heat olive oil in a cooking pot.",
      "Once the oil becomes hot, saute carrot, celery, and onion for 5 minutes.",
      "Add garlic. Continue to saute for 3 minutes or until the vegetables are soft.",
      "Pour water. Let boil.",
      "Add Knorr Chicken Cube. Stir.",
      "Add bay leaves. Cover the cooking pot and continue to cook in medium heat for 5 minutes.",
      "Scoop around 2 tablespoons of chicken mixture and then roll into a ball. Gently drop the chicken meatballs in boiling broth. Stir. Cover and cook in medium heat for 6 minutes.",
      "Add egg noodles. Cover and cook between low to medium heat for 15 minutes.",
      "Season with salt and ground black pepper.",
      "Transfer to a serving bowl. Serve.",
      "Share and enjoy"
    ],
    "cooking_time": "50 minutes",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/chicken-meatball-noodle-soup/",
    "image_url": "",
    "image_path": "",
    "category": "Chicken Dishes"
  },
  {
    "title": "Beef Tinola Recipe",
    "ingredients": [
      "▢ 1 ½ lb. beef chuck paypay, cubed",
      "▢ 3 cups beef broth",
      "▢ 5 cups water",
      "▢ 1 small green papaya wedged",
      "▢ 5 pieces long green chili pepper optional",
      "▢ 2 cups spinach or malunggay leaves",
      "▢ 1 medium yellow onion",
      "▢ 3 cloves garlic chopped",
      "▢ 3 thumbs ginger cut into strips",
      "▢ 3 tablespoons fish sauce patis",
      "▢ ¼ teaspoon ground black pepper",
      "▢ 3 tablespoons cooking oil"
    ],
    "instructions": [
      "Heat oil in a pressure cooker.",
      "Once the oil becomes hot, saute garlic and onion for 30 seconds.",
      "Add ginger. Continue to cook until onion gets soft.",
      "Put the beef chuck into the pressure cooker. Cook until brown.",
      "Pour beef broth and water. Let boil.",
      "Cover the pressure cooker and then pressure cook for 40 minutes.",
      "Safely remove the cover and then add green papaya and long green chili peppers. Cook for 8 to 10 minutes.",
      "Season with ground black pepper and fish sauce. Stir.",
      "Turn the heat off. Add spinach (or malunggay leaves). Let the residual het cook the leafy greens for 3 minutes.",
      "Transfer to a serving bowl. Serve hot.",
      "Share and enjoy!"
    ],
    "cooking_time": "1 hour",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/beef-tinola-recipe/",
    "image_url": "",
    "image_path": "",
    "category": "Chicken Dishes"
  },
  {
    "title": "Chicken Mami",
    "ingredients": [
      "▢ 1 lb. chicken breasts bone-in",
      "▢ 1 piece carrot peeled",
      "▢ ½ piece Napa cabbage",
      "▢ 1 bunch scallions",
      "▢ 1 lb. egg noodles fresh",
      "▢ ¼ cup toasted garlic",
      "▢ 4 pieces hard boiled egg sliced",
      "▢ 4 cups chicken broth",
      "▢ 4 cups water",
      "▢ 2 teaspoons salt"
    ],
    "instructions": [
      "Combine chicken broth and water in a cooking pot. Let boil.",
      "Add salt and chicken breasts. Cover and boil between low to medium heat for 30 to 35 minutes.",
      "Remove the chicken from the pot. Let it cool down. Shred the meat from the bone. Set aside. Save the broth used for boiling. It will be used later.",
      "Slice the carrot into thin strips (julienne) and then chop the Napa cabbage. Also chop the scallions. Set aside.",
      "Prepare the fresh noodles by boiling 4 cups water. Once the water starts to boil, add the noodles. Let the water boil once more, and then continue to cook the noodles for 3 minutes. Remove from the pot and arrange in a serving bowl.",
      "Top the noodles in the bowl with shredded chicken, julienne carrot, chopped cabbage, and slices of boiled eggs.",
      "Pour the hot broth into the bowl. Sprinkle with scallions and roasted or toasted garlic.",
      "Serve with a condiment composed of patis (fish sauce) and calamansi.",
      "Share and enjoy!"
    ],
    "cooking_time": "45 minutes",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/chicken-mami/",
    "image_url": "",
    "image_path": "",
    "category": "Soups And Stews"
  },
  {
    "title": "Pancit Canton at Bihon Recipe",
    "ingredients": [
      "▢ 2 ounces pancit canton",
      "▢ 2 ounces pancit bihon",
      "▢ 1 Knorr Shrimp Cube",
      "▢ 8 to 10 pieces medium shrimp peeled and deveined",
      "▢ 4 ounces pork shoulder sliced into small pieces",
      "▢ 4 ounces boiled and shredded chicken breast",
      "▢ 2 cups chopped cabbage",
      "▢ 1 medium carrot julienne",
      "▢ 1 ½ cup sliced green beans Baguio beans",
      "▢ ½ cup chopped parsley",
      "▢ 4 tablespoons soy sauce",
      "▢ 1 medium yellow or white onion sliced",
      "▢ 3 cloves garlic crushed",
      "▢ ¼ teaspoon ground black pepper",
      "▢ 4 tablespoons cooking oil"
    ],
    "instructions": [
      "Soak the bihon noodles in water for 10 minutes. Drain the water and set the soaked bihon aside.",
      "Heat a cooking pot and then pour 3 tablespoons of cooking oil.",
      "Once the oil becomes hot, pan fry the shrimp for 1 minute per side. Remove the shrimp from the pot after pan-frying, and then set aside.",
      "Add 1 to 2 tablespoons cooking oil. Saute onion and garlic until the onion becomes soft and translucent.",
      "Add sliced pork. Continue to sauté until it turns light brown.",
      "Add shredded chicken. Saute for 3 minutes.",
      "Pour soy sauce and water. Stir. Let boil.",
      "Add Knorr Shrimp Cube. Stir. Cover the pot and continue to cook in low heat for 20 minutes. Note: you can add more water, if needed.",
      "Add carrots, green beans, and cabbage. Stir. Cover and cook for 2 minutes.",
      "Put the pancit canton in the pot. Cover. Let the noodles absorb the steam from the boiling liquid for 3 minutes.",
      "Toss the pancit canton with the other ingredients.",
      "Add the pancit bihon. Toss some more until all ingredients are well blended.",
      "Put the pan-fried shrimp into the pot and sprinkle with ground black pepper. Toss and cook until the liquid has been absorbed completely.",
      "Transfer to a serving plate. Serve.",
      "Share and enjoy!"
    ],
    "cooking_time": "40 minutes",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/pancit-canton-at-bihon-recipe/",
    "image_url": "",
    "image_path": "",
    "category": "Noodles"
  }
]