[
  {
    "title": "Easy Sisig Recipes",
    "ingredients": [
      "▢ 1 cup Lady’s Choice Mayonnaise",
      "▢ 2 tablespoons Knorr liquid seasoning",
      "▢ 2 tablespoons lemon lime soda",
      "▢ 2 tablespoons calamansi juice",
      "▢ 1 tablespoon white vinegar",
      "▢ 1 teaspoon ground black pepper",
      "▢ 1 lb. pork belly",
      "▢ 3 dried bay leaves",
      "▢ 2 teaspoons whole peppercorn",
      "▢ 2 tablespoons liver spread",
      "▢ 2 Thai chili pepper chopped",
      "▢ 3 tablespoons green onions chopped",
      "▢ ¾ cup red onions chopped",
      "▢ 2 teaspoon salt",
      "▢ 6 cups water",
      "▢ 2 cups cooking oil",
      "▢ 16 ounces extra firm tofu diced",
      "▢ 2 Thai chili pepper chopped",
      "▢ ¼ cup red bell pepper chopped",
      "▢ 3 tablespoons green onions chopped",
      "▢ ¼ cup red onions chopped",
      "▢ 1 cup cooking oil",
      "▢ 15 oz. luncheon meat",
      "▢ 1 tablespoon liver spread",
      "▢ 3 tablespoons green onions chopped",
      "▢ ¼ cup red onions chopped",
      "▢ 1 cup cooking oil",
      "▢ 12 ounces tuna canned",
      "▢ ¼ cup red bell pepper chopped",
      "▢ 3 tablespoons green onions chopped",
      "▢ ¼ cup red onions chopped",
      "▢ ¼ teaspoon ground black pepper",
      "▢ ¼ teaspoon salt",
      "▢ 2 tablespoons butter"
    ],
    "instructions": [
      "Combine all Sisig seasoning ingredients in a bowl. Mix well until smooth. Set aside.",
      "Make lechon kawali sisig by boiling the pork belly with whole peppercorn and dried bay leaves in 6 to 8 cups of water for 50 minutes or until tender. Remove from the pot and let it cool down. Rub it with 2 teaspoons of salt. Deep-fry the pork belly until golden brown and crispy. Chop into serving pieces. Combine a quarter of the sisig seasoning ingredients with 2 tablespoons of liver spread. Put the chopped pork belly, thai chili pepper, green onions, and red onions in a mixing bowl and then add the Sisig seasoning mixture. Toss until well blended. Serve.",
      "Make the crispy tofu sisig by deep frying the tofu until golden brown and crispy. Drain the oil and set aside. Arrange fried tofu, bell pepper, thai chili pepper, green onions, and red onions in a mixing bowl. Add a quarter of the sisig seasoning. Toss until evenly distributed. Serve!",
      "Make the luncheon meat sisig by deep frying the luncheon meat until golden brown and crispy. Drain the oil and set aside. Arrange luncheon meat, green onions, and red onions in a mixing bowl. Combine Sisig seasoning with 1 tablespoon liver spread and add it into the bowl. Toss until evenly distributed. Serve!",
      "Make the tuna sisig by heating butter in a pan. Add drained canned tuna. Saute for 2 minutes. Season with salt and ground black pepper and let it cool down. Combine tuna, bell pepper, green onions, red onions, and the remaining sisig seasoning. Toss. Serve. Share and enjoy!"
    ],
    "cooking_time": "N/A",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/easy-sisig-recipes/",
    "image_url": "",
    "image_path": "",
    "category": "Pork Dishes"
  },
  {
    "title": "Not Your Ordinary Chicken Adobo",
    "ingredients": [
      "▢ 2 1/2 lbs. chicken cut into serving pieces",
      "▢ 1 Knorr chicken cube",
      "▢ 1 head  garlic crushed",
      "▢ 1 onion minced",
      "▢ 1 ½ teaspoon brown sugar",
      "▢ 4 bay leaves",
      "▢ 1 1/2 teaspoons whole peppercorn",
      "▢ 4 tablespoons soy sauce",
      "▢ 6 tablespoons white vinegar",
      "▢ 2 tablespoons oyster sauce",
      "▢ 1 cup water",
      "▢ ¼ cup green onions chopped",
      "▢ 1 tablespoon butter",
      "▢ 3 tablespoons cooking oil"
    ],
    "instructions": [
      "Combine chicken, soy sauce, vinegar, and half of the crushed garlic in a bowl. Mix until all ingredients are well blended. Let it stay for at least 1 hour.",
      "Fry the remaining garlic until golden brown. Set aside.",
      "Combine the butter and garlic-infused oil (this is the oil used to cook the garlic). Sauté the onion and then add the marinated chicken. Cook until the chicken turns light brown.",
      "Add the oyster sauce and then pour the remaining marinade and water. Let it boil.",
      "Add Knorr chicken cube, sugar, bay leaves, fried garlic, and whole peppercorn. Reduce to a simmer. Cover the pot and cook for 35 to 45 minutes.",
      "Transfer to a serving bowl. Garnish with chopped green onions.",
      "Serve. Share and enjoy!"
    ],
    "cooking_time": "N/A",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/not-your-ordinary-chicken-adobo/",
    "image_url": "",
    "image_path": "",
    "category": "Chicken Dishes"
  },
  {
    "title": "The Only Filipino Spaghetti Recipe That I Trust for the Holidays",
    "ingredients": [
      "▢ 1 lb. spaghetti noodles",
      "▢ 1 lb. ground pork",
      "▢ 35 ounces Filipino style spaghetti sauce",
      "▢ 1 Knorr Pork Cube",
      "▢ 3 ounces ham sliced",
      "▢ 5 hotdogs sliced diagonally",
      "▢ 1/2 cup red bell pepper minced",
      "▢ 1/2 cup green bell pepper  minced",
      "▢ 1 yellow onion  minced",
      "▢ 4 cloves garlic  minced",
      "▢ 8 cups water",
      "▢ 1 cup shredded cheddar cheese",
      "▢ 3 tablespoons cooking oil",
      "▢ Salt and ground black pepper to taste"
    ],
    "instructions": [
      "Boil water in a cooking pot. Add a teaspoon of salt. Put the spaghetti noodles in the pot. Cook according to package instructions. Drain the water and set the spaghetti aside.",
      "Make the sauce by heating oil in a cooking pot. Sauté garlic and onion until the onion softens.",
      "Add the ground pork. Cook it while stirring until it turns light brown in color.",
      "Add the ham and hotdogs. Sauté for 2 minutes.",
      "Put the bell peppers into the pot. Continue cooking for 1 minute.",
      "Pour the spaghetti sauce. Add 1 cup water. Stir and let boil.",
      "Add Knorr pork cube. Cover the pot and reduce the heat to a simmer. Cook for 30 minutes while stirring every 6 minutes or so.",
      "Season with salt and ground black pepper. You can add some grated cheese if preferred.",
      "Arrange spaghetti on a serving plate. Top with spaghetti sauce and shredded cheese.",
      "Serve. Share and enjoy!"
    ],
    "cooking_time": "N/A",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/the-only-filipino-spaghetti-recipe-that-i-trust-for-the-holidays/",
    "image_url": "",
    "image_path": "",
    "category": "Pork Dishes"
  },
  {
    "title": "Crispy Pata Kare Kare",
    "ingredients": [
      "▢ 4 lbs. pork hock pata",
      "▢ 2 teaspoons salt",
      "▢ 3 cups cooking oil",
      "▢ 1/2 cup shrimp paste",
      "▢ 3 quarts water",
      "▢ 1 tablespoon salt",
      "▢ 7 dried bay leaves",
      "▢ 1 tablespoon whole peppercorn",
      "▢ Salt and ground black pepper to taste",
      "▢ 1 1/4 cup peanut paste",
      "▢ 1 piece Knorr Pork Cube",
      "▢ 2 tablespoons annatto powder",
      "▢ 1 onion chopped",
      "▢ 4 cloves garlic minced",
      "▢ 2 cups water",
      "▢ 3 tablespoons cooking oil",
      "▢ Salt and ground black pepper to taste",
      "▢ 2 bunches bok choy",
      "▢ 2 eggplants sliced",
      "▢ 10 string beans cut in 2-inch pieces",
      "▢ 18 ounces banana blossom in brine canned"
    ],
    "instructions": [
      "Combine all the boiling ingredients in a large cooking pot. Add pork hock. Boil for 1 hour. Remove the pork hock from the cooking pot. Let it cool down and then rub salt all over. Air dry for 30 minutes.",
      "Heat oil in a pan. Sauté garlic and onion. Once the onion softens, add the peanut paste. Stir and cook for 1 minute. Pour water and then stir until the mixture becomes smooth. Let the liquid boil. Add Knorr Pork Cube and annatto powder. Cover the pot. Reduce the heat to a simmer. Continue cooking until your desired consistency is achieved. Season with salt and ground black pepper. Set aside.",
      "Heat oil in a wide and deep pot. Fry the pork hock until the bottom side turns golden brown and crispy. Turn it over and do the same thing on the opposite side. Remove from the pot. Let it cool down. Debone the pork hock. Set aside.",
      "Arrange the vegetable ingredients on a steamer. Steam for 3 to 5 minutes. Set aside.",
      "Assemble your crispy pata kare-kare by pouring half of the sauce on a serving bowl. Arrange the steamed vegetables all around. Top with crispy pata. Distribute the remaining sauce by pouring onto the bowl. Serve with shrimp paste (bagoong alamang) as a condiment. Share and enjoy!"
    ],
    "cooking_time": "N/A",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/crispy-pata-kare-kare/",
    "image_url": "",
    "image_path": "",
    "category": "Pork Dishes"
  },
  {
    "title": "Embutido Cordon Bleu",
    "ingredients": [
      "▢ 8 slices ham",
      "▢ 8 slices Swiss cheese",
      "▢ ½ cup all-purpose flour",
      "▢ 2 eggs",
      "▢ 1 1/2 cups panko breadcrumbs",
      "▢ 2 cups cooking oil",
      "▢ 1 lb. ground pork",
      "▢ 1 lb. ground chicken",
      "▢ 1 Knorr Chicken Cube mashed",
      "▢ ¼ cup sweet pickle relish",
      "▢ 1 cup cheddar cheese grated",
      "▢ 1 red bell pepper minced",
      "▢ ½ cup raisins",
      "▢ 1 carrot minced",
      "▢ 1 onion minced",
      "▢ 1 egg",
      "▢ 1 teaspoons salt",
      "▢ 1/2 teaspoon ground black pepper",
      "▢ 3/4 cups breadcrumbs",
      "▢ ½ cup heavy whipping cream",
      "▢ 2 tablespoons Dijon mustard",
      "▢ 1 ½ tablespoons butter",
      "▢ 2 tablespoons minced yellow onion",
      "▢ Salt to taste"
    ],
    "instructions": [
      "Combine all the embutido ingredients in a bowl. Mix well. Set aside.",
      "Lay a sheet of foil on a flat surface. Scoop ¾ cups of meat mixture and spread it on the foil. Lay 2 slices of ham over the meat mixture and top it with 2 slices of cheese. Roll the foil and secure by twisting the ends.",
      "Steam for 1 hour. Remove from the steamer and let this cool down. Remove foil wrap.",
      "Heat 2 cups cooking oil.",
      "Dredge each embutido in all-purpose flour. Dip it in beaten egg, and then coat with panko breadcrumbs.",
      "Deep fry until golden brown. Set aside.",
      "Make the Dijon cream sauce by melting butter in a saucepan. Add onion. Cook until soft.",
      "Pour heavy whipping cream. Stir and add Dijon mustard. Stir and continue cooking using between low to medium heat setting until the sauce reduces to half. Add salt to taste.",
      "Arrange the embutido cordon bleu on a serving plate. Serve with creamy Dijon sauce. Share and enjoy"
    ],
    "cooking_time": "N/A",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/embutido-cordon-bleu/",
    "image_url": "",
    "image_path": "",
    "category": "Pork Dishes"
  },
  {
    "title": "Lasagna Roll Ups",
    "ingredients": [
      "▢ 12 sheets  lasagna noodles",
      "▢ 1 cup mozzarella cheese",
      "▢ 3 tablespoons parsley minced",
      "▢ 6 cups water",
      "▢ 1 teaspoon salt",
      "▢ 1 lb. ground beef",
      "▢ 1 Knorr beef cube",
      "▢ 23 ounces marinara sauce",
      "▢ 1 onion minced",
      "▢ 2 cloves garlic minced",
      "▢ Salt and ground black pepper to taste",
      "▢ 1 lb. ricotta cheese",
      "▢ 2 cups mozzarella cheese",
      "▢ 5 tablespoons parmesan cheese",
      "▢ 1 egg beaten",
      "▢ 3 tablespoons basil chopped"
    ],
    "instructions": [
      "Boil 6 cups water in a cooking pot. Add salt and put-in the lasagna sheets. Cook it according to package instructions. Drain the water and set aside the lasagna.",
      "Make the meat sauce by browning the ground beef in a cooking pot. Add onion and garlic. Continue cooking until the onion softens.",
      "Pour the marinara sauce into the pot. Stir and let the mixture boil. Add Knorr beef cube. Reduce the heat to a simmer and cook for 8 to 10 minutes. Season with salt and ground black pepper. Set aside.",
      "Combine all the cheese filling ingredient in a bowl. Mix well. Set aside.",
      "Arrange the lasagna on a flat surface. Scoop around 3 to 4 tablespoons of cheese filling mixture and spread it over each lasagna sheet. Spread around 2 tablespoons of meat mixture over it.",
      "Spread ½ cup of meat sauce on your baking pan. Roll each lasagna sheet and arrange it on the pan. Top with remaining meat sauce and sprinkle 1 cup mozzarella cheese over it. Cover the pan with aluminum foil. Bake in 375F for 30 minutes.",
      "Take the foil out and broil until cheese browns a bit. Remove from the oven and sprinkle parsley on top.",
      "Serve. Share and enjoy!"
    ],
    "cooking_time": "N/A",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/lasagna-roll-ups/",
    "image_url": "",
    "image_path": "",
    "category": "Other Filipino Dishes"
  },
  {
    "title": "Crispy Pata Dinakdakan",
    "ingredients": [
      "▢ 3 ounces pork liver",
      "▢ 2 onions sliced",
      "▢ ½ cup green onions chopped",
      "▢ 3 Thai chili pepper chopped",
      "▢ 1 ½ teaspoons salt",
      "▢ 4 lbs. pork hock pata",
      "▢ 2 teaspoons whole peppercorn",
      "▢ 3 bay leaves",
      "▢ 6 cups water",
      "▢ ¾ cup Lady’s Choice Mayonnaise",
      "▢ 2 tablespoons Knorr Liquid Seasoning",
      "▢ 3 tablespoons white vinegar",
      "▢ ¼ teaspoon ground black pepper"
    ],
    "instructions": [
      "Tenderize the pork hock by combining all the pork hock boiling ingredients in a cooking pot. Cover and boil between low to medium heat setting for 80 minutes. Drain the liquid and let the pork cool down to room temperature. Debone the pork hock using a sharp knife. Set aside (note: You may discard the bones.).",
      "Rub 2 teaspoons of salt all over the skin of the pork.",
      "Prepare the dressing by combining all the dressing ingredients in a bowl. Stir until smooth.",
      "Rub 1 teaspoon salt all over the liver. Heat the cooking oil in a pan. Fry both sides of the liver until it browns. Remove from the pan and slice into serving pieces. Set aside.",
      "Heat oil in a deep cooking pot. Fry the pata until golden brown and crispy. Remove from the pot and let it cool down.",
      "Chop the crispy pata into bite-size pieces. Put it in a large mixing bowl, add the fried liver, and add the dressing, onion, green onion, and chili peppers. Toss until well blended.",
      "Transfer to a serving plate. Serve. Share and enjoy!"
    ],
    "cooking_time": "N/A",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/crispy-pata-dinakdakan/",
    "image_url": "",
    "image_path": "",
    "category": "Pork Dishes"
  },
  {
    "title": "Christmas Chicken Curry",
    "ingredients": [
      "▢ 2 1/2 lbs chicken",
      "▢ 1 Knorr chicken cube",
      "▢ 2 potatoes diced",
      "▢ 2 carrots diced",
      "▢ 1 red bell pepper",
      "▢ 3 long green peppers",
      "▢ 1 tbsp curry powder",
      "▢ 1 teaspoon turmeric powder",
      "▢ 2 cups coconut milk",
      "▢ 1 cups water",
      "▢ 1 tablespoon Knorr cream of mushroom",
      "▢ 3 tablespoons cooking oil",
      "▢ Salt and ground black pepper to taste"
    ],
    "instructions": [
      "Heat oil in a pot. Sauté garlic, onion, and ginger.",
      "Add the chicken once the onion softens. Cook until the chicken turns light brown.",
      "Add curry powder and turmeric powder. Stir and pour coconut milk and water. Let boil.",
      "Add Knorr chicken cube. Cover the pot. Cook in a low heat setting for 20 minutes.",
      "Add potato and carrots. Cook for 8 minutes.",
      "Combine 1 tablespoon of Knorr cream of mushroom soup mix with ½ cup water. Mix well. Add mixture to the pot. Stir.",
      "Add bell pepper and long green chili pepper. Cover the pot and continue cooking for 5 minutes.",
      "Season with salt and ground black pepper. Serve. Share and enjoy!"
    ],
    "cooking_time": "N/A",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/christmas-chicken-curry/",
    "image_url": "",
    "image_path": "",
    "category": "Chicken Dishes"
  },
  {
    "title": "Ham and Chicken Macaroni Salad",
    "ingredients": [
      "▢ 1 lb. elbow macaroni",
      "▢ 8 oz ham cubed",
      "▢ 8 ounces chicken breast",
      "▢ 1 red onion chopped",
      "▢ 4 ribs celery chopped",
      "▢ 1 cup green peas cooked",
      "▢ 2 red bell pepper chopped",
      "▢ ¾ cup sweet pickle relish",
      "▢ 8 ounces pineapple tidbits",
      "▢ 1 cup carrot cubed",
      "▢ 4 cups water",
      "▢ 1 ½ cups Lady’s Choice Mayonnaise",
      "▢ ¾ cup all-purpose cream optional",
      "▢ 1 ½ teaspoons onion powder",
      "▢ 1 teaspoon sugar",
      "▢ Salt and ground black pepper to taste"
    ],
    "instructions": [
      "Boil water in a cooking pot. Add 1 teaspoon of salt. Put the chicken into the pot. Cover and continue boiling in medium heat setting for 16 to 18 minutes. Remove the chicken from the pot and let it cool down. Dice it once the temperature is manageable.",
      "Continue boiling the chicken stock (this is the water used to boil the chicken) and add the elbow macaroni. Cook it according to package instructions. Drain the chicken stock and place the macaroni on a large mixing bowl.",
      "Combine all the dressing ingredients. Mix well. Set aside.",
      "Combine macaroni, ham, chicken, onion, celery, green peas, pickle relish, pineapple tidbits, and carrots. Toss.",
      "Add the dressing and continue tossing until all the ingredients are well incorporated.",
      "Cover the bowl and refrigerate for at least 3 hours. Serve chilled. Share and enjoy!"
    ],
    "cooking_time": "N/A",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/ham-and-chicken-macaroni-salad/",
    "image_url": "",
    "image_path": "",
    "category": "Chicken Dishes"
  },
  {
    "title": "Fried Chicken with Mayo Garlic Glaze",
    "ingredients": [
      "▢ 1 ½ lbs. chicken thighs cut into serving pieces",
      "▢ 2 eggs beaten",
      "▢ 2 cups cooking oil",
      "▢ 2 tablespoons Knorr Liquid Seasoning",
      "▢ ½ teaspoon ground black pepper",
      "▢ 1 teaspoon garlic powder",
      "▢ ¾ cup all-purpose flour",
      "▢ ½ cup cornstarch",
      "▢ ½ teaspoon salt",
      "▢ 1 teaspoon onion powder",
      "▢ 1 tablespoon butter",
      "▢ 3 cloves garlic minced",
      "▢ ½ cup Lady’s Choice Mayonnaise",
      "▢ ½ teaspoon lemon juice",
      "▢ 2 tablespoons honey",
      "▢ 1 teaspoon Knorr Liquid Seasoning"
    ],
    "instructions": [
      "Combine chicken with the chicken seasoning ingredients. Mix well. Let it stay for 10 minutes.",
      "Meanwhile combine flour mixture ingredients. Mix well and set aside.",
      "Heat 2 cups of cooking oil in a deep cooking pot.",
      "While the oil is heating-up, dredge the chicken in flour mixture. Dip in beaten egg, and then dredge once more with the flour mixture.",
      "Deep-fry the chicken for 14 minutes or until golden brown. Remove chicken from the cooking pot. Set aside.",
      "Make the Mayo Garlic glaze by melting butter on a clean pan. Add garlic. Cook until it starts to brown. Turn the heat off and add Lady’s Choice Mayonnaise, lemon juice, honey, and Knorr Liquid Seasoning. Mix well.",
      "Add the crispy fried chicken and toss with the glaze until completely coated.",
      "Transfer to a serving plate. Serve. Share and enjoy!"
    ],
    "cooking_time": "N/A",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/fried-chicken-with-mayo-garlic-glaze/",
    "image_url": "",
    "image_path": "",
    "category": "Chicken Dishes"
  },
  {
    "title": "Killer Crispy Sinigang",
    "ingredients": [
      "▢ 2 lbs. Pork Belly",
      "▢ 44 grams Knorr Sinigang sa Sampaloc mix",
      "▢ 1 tablespoon Knorr Liquid Seasoning",
      "▢ 1 bunch  string beans",
      "▢ 1 bunch  spinach",
      "▢ 1 eggplant sliced",
      "▢ 10 okras",
      "▢ 3 ounces daikon radish sliced",
      "▢ 3 long green peppers",
      "▢ 1 onion wedged",
      "▢ 2 tomatoes wedged",
      "▢ 3 cloves garlic crushed",
      "▢ 4 cups water",
      "▢ 2 cups cooking oil",
      "▢ Ground black pepper and fish sauce to taste"
    ],
    "instructions": [
      "Heat 3 tablespoons of cooking oil in a cooking pot. Saute garlic, onion, and tomato.",
      "Add the pork belly once the onion softens. Cook until the outside of the pork turns light brown.",
      "Pour the water into the pot. Let it boil. Add Knorr Sinigang sa Sampaloc Recipe mix (save 1 tablespoon for later use). Cover the pot and boil the pork in low heat setting until the pork tenderizes (around 45 minutes).",
      "Remove the pork belly from the cooking pot. Let it cool down. Rub the remaining sinigang mix all over the pork and then add Knorr Liquid Seasoning. Air dry the pork for at least 3 hours (note: it is better to soak it under the sun for best results).",
      "Heat the remaining cooking oil. Deep- fry the pork belly until crispy (note: you can double fry it too).",
      "Boil the soup on more time and then add the remaining vegetables. Cook for 5 minutes.",
      "Season with ground black pepper and fish sauce. Arrange the soup and vegetables in a bowl and then top with crispy pork.",
      "Serve. Share and enjoy!"
    ],
    "cooking_time": "N/A",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/killer-crispy-sinigang/",
    "image_url": "",
    "image_path": "",
    "category": "Seafood"
  },
  {
    "title": "Creamy Chicken Pasta with Bacon",
    "ingredients": [
      "▢ 8 oz. boneless chicken breast",
      "▢ 5 strips  bacon",
      "▢ 1 lb. penne pasta",
      "▢ 6 ounces grape tomato halved",
      "▢ 1 cup baby spinach",
      "▢ ½ teaspoon red pepper flakes optional",
      "▢ ½ cup Parmesan cheese",
      "▢ 4 cups water",
      "▢ 2 teaspoons paprika",
      "▢ 1 teaspoon salt",
      "▢ ½ teaspoon ground black pepper",
      "▢ 1 cup Lady’s Choice Mayonnaise",
      "▢ 1 teaspoon white vinegar",
      "▢ ½ cup heavy cream",
      "▢ 1 teaspoon onion powder",
      "▢ ½ teaspoon garlic powder",
      "▢ ½ teaspoon salt",
      "▢ 1 pinch ground black pepper"
    ],
    "instructions": [
      "Combine the chicken rub ingredients in a bowl. Mix well. Rub it all over the chicken breast.",
      "Boil water in a cooking pot and add 1 teaspoon of salt. Put the pasta in. Cook according to package instructions. Drain the water and set the pasta aside.",
      "Cook bacon in a pan until bacon oil is extracted and the bacon becomes crispy. Remove the crispy bacon from the pan. Set aside.",
      "Using the bacon oil, fry the chicken breast for 5 to 8 minutes per side (note: the thicker the breast, the longer the frying time). Remove the chicken and let it cool down. Slice into serving pieces. Set aside.",
      "Combine the pasta dressing ingredients and mix well.",
      "Arrange pasta in a mixing bowl and then toss-in the dressing. Add tomato, spinach, chicken, bacon, red pepper flakes, and Parmesan cheese. Toss until all ingredients are well distributed.",
      "Transfer to a pasta bowl and serve. Share and enjoy!"
    ],
    "cooking_time": "N/A",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/creamy-chicken-pasta-with-bacon/",
    "image_url": "",
    "image_path": "",
    "category": "Chicken Dishes"
  }
]