[
  {
    "title": "One Pot Spaghetti",
    "ingredients": [
      "▢ 1 lb ground beef",
      "▢ 1 lb. spaghetti",
      "▢ 1 Knorr Beef Cube",
      "▢ 1 1/2 cups fresh mushroom chopped",
      "▢ 1 bell pepper chopped",
      "▢ 4 cloves garlic diced",
      "▢ 1 onion diced",
      "▢ 24 ounces marinara sauce",
      "▢ 1 1/2 cups water",
      "▢ 1/4 cup cream cheese",
      "▢ 3/4 cup cheddar cheese grated",
      "▢ Salt and ground black pepper to taste"
    ],
    "instructions": [
      "Pour 4 quarts of water on a cooking pot. Let it boil and then add 1 teaspoon salt and spaghetti. Continue cooking for 11 minutes. Drain the water and set the spaghetti aside.",
      "Heat the same cooking pot. Add the ground beef. Cook until it browns.",
      "Add onion, garlic, mushroom, and bell pepper. Saute for 3 to 5 minutes.",
      "Drain the oil out and then add the marinara sauce and 1 1/2 cups water. Let it boil.",
      "Add Knorr Beef Cube. Cover the pot and then adjust the heat to the lowest setting. Continue cooking for 20 minutes. Note: stir the mixture every 5 minutes and add more water as needed.",
      "Put the cooked spaghetti back into the pot. Toss until it gets coated by the sauce.",
      "Season with salt and ground black pepper and then add the cream cheese. Toss.",
      "Top with grated cheddar cheese. Serve warm with garlic bread. Share and enjoy!"
    ],
    "cooking_time": "N/A",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/one-pot-spaghetti/",
    "image_url": "",
    "image_path": "",
    "category": "Other Filipino Dishes"
  },
  {
    "title": "Chicken Fried Rice Recipe",
    "ingredients": [
      "▢ 3 cups cooked white rice",
      "▢ 2 eggs beaten",
      "▢ 6 ounces chicken breast boneless",
      "▢ 1 ½ cups frozen mixed vegetables carrots, green peas, and corn",
      "▢ 1 onion minced",
      "▢ 2 cloves garlic minced",
      "▢ 3 tablespoons cooking oil",
      "▢ Salt and ground black pepper to taste",
      "▢ 1 tablespoon oyster sauce",
      "▢ 3 tablespoons soy sauce",
      "▢ 1/2 teaspoon sesame oil"
    ],
    "instructions": [
      "Cut the chicken into small pieces. Arrange in a bowl and combine with the sauce ingredients. Mix well. Set aside.",
      "Heat the oil in a pan. Fry the beaten eggs until done. Remove the cooked eggs from the pan. Chop it into pieces, and then set it aside.",
      "Using the remaining oil (add more if needed), saute the garlic and onion.",
      "Add the marinated chicken once the onion softens. Stir-fry for 2 to 3 minutes.",
      "Add the vegetables. Continue stir-frying for 2 minutes.",
      "Add the rice. Toss until all the ingredients are well blended. Continue cooking for 3 minutes.",
      "Season with salt and ground black pepper.",
      "Transfer to a serving plate. Serve immediately."
    ],
    "cooking_time": "25 minutes",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/chicken-fried-rice-recipe/",
    "image_url": "",
    "image_path": "",
    "category": "Chicken Dishes"
  },
  {
    "title": "Garlic Mushroom",
    "ingredients": [
      "▢ 8 ounces mushrooms",
      "▢ 1 teaspoon Knorr Liquid Seasoning",
      "▢ 5 cloves garlic",
      "▢ 1 teaspoon thyme",
      "▢ 2 teaspoons parsley chopped",
      "▢ 3 ounces dry white wine",
      "▢ 3 tablespoons butter",
      "▢ 1 tablespoon olive oil",
      "▢ 1 onion minced",
      "▢ Salt and ground black pepper to taste"
    ],
    "instructions": [
      "Melt butter in a pan and then add the olive oil.",
      "Once the butter is completely melted and the bubbling subsides, add the  garlic. Saute until the garlic turns light brown.",
      "Add the onion. Cook until it softens",
      "Add the mushrooms. Cook for 1 minute while stirring.",
      "Add Knorr liquid seasoning and pour the white wine into the pan. Add thyme. Cook until the wine reduces to a quarter.",
      "Season with salt and pepper. Top with chopped parsley.",
      "Serve. Share and enjoy!"
    ],
    "cooking_time": "N/A",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/garlic-mushroom/",
    "image_url": "",
    "image_path": "",
    "category": "Other Filipino Dishes"
  },
  {
    "title": "Fish in Coconut Milk with Pineapple (Filipino Fish Stew)",
    "ingredients": [
      "▢ 1 whole fish cleaned",
      "▢ 40 grams Knorr Ginataang Gulay Mix",
      "▢ 3 thumbs  ginger",
      "▢ 1 cup pineapple chunks",
      "▢ 3 bell peppers sliced",
      "▢ 1 bunch  baby bok choy",
      "▢ 1 onion chopped",
      "▢ 5 cloves garlic minced",
      "▢ 2 teaspoons salt for rubbing on the fish",
      "▢ 1 ½ cups water",
      "▢ Fish sauce and ground black pepper to taste",
      "▢ 1 cup cooking oil"
    ],
    "instructions": [
      "Rub salt on the fish. Let it stay for 10 minutes.",
      "Pour 1 cup cooking oil in a pan and heat it. Once the oil temperature reaches 350F, fry the fish until it turns golden brown in color. Turn it over and do the same process on the other side. Remove the fish and put it over a wire rack or a plate lined with paper towel.",
      "Meanwhile, scoop around 3 tablespoons of oil used to fry the fish and heat it on a clean pan. Sauté the garlic until it starts to brown. Add the onion and ginger. Continue sautéing until the onion softens.",
      "Combine Knorr Ginataang Gulay Mix with 1 ½ cups water. Stir until well blended and then pour the mixture into the pan. Let it boil.",
      "Reduce the heat to medium setting and then add the pineapple and fried fish. Cover pan and continue cooking for 3 minutes.",
      "Remove the cover. Add the bell peppers and baby bok choy. Continue cooking for 3 minutes.",
      "Season with fish sauce and ground black pepper.",
      "Transfer to a serving bowl. Serve hot with rice.",
      "Share and enjoy!"
    ],
    "cooking_time": "N/A",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/fish-in-coconut-milk-with-pineapple-filipino-fish-stew/",
    "image_url": "",
    "image_path": "",
    "category": "Vegetable Dishes"
  },
  {
    "title": "Garlic Tokwa and Kangkong in Oyster Sauce",
    "ingredients": [
      "▢ 1 bunch water spinach kangkong",
      "▢ 12 ounces tofu extra firm",
      "▢ 1 head  garlic",
      "▢ 1 onion chopped",
      "▢ 1 ½ cups cooking oil",
      "▢ 3 tablespoons oyster sauce",
      "▢ 2 teaspoons Knorr Liquid Seasoning",
      "▢ 1 tablespoon soy sauce",
      "▢ 1 ½ tablespoons cornstarch",
      "▢ ½ cup water"
    ],
    "instructions": [
      "Crush and chop the garlic. Put it on a small pan and then add ½ cup cooking oil. Turn on the heat and adjust it to medium setting. Once the oil starts to bubble, adjust the heat to the lowest setting. Continue cooking the garlic while stirring until it turns golden brown in color.",
      "Separate the garlic from the garlic oil using a kitchen sieve. Set aside.",
      "Heat the remaining 1 cup of oil on a deep small cooking pot. Add the garlic oil (leaving around 3 tablespoons for later). Fry the tofu until it turns golden brown. Remove the tofu from the pot and let it cool down before dicing it. Set aside.",
      "Combine all the sauce ingredients in a bowl. Stir until well blended. Set aside.",
      "Heat the remaining 3 tablespoons of garlic oil in a clean pan. Sauté the onions until it softens.",
      "Add the fried tofu and continue to saute for 30 seconds.",
      "Add the chopped water spinach (kangkong). Saute for 1 minute.",
      "Pour the sauce mixture into the pot. Stir and cook until the sauce thickens.",
      "Add half of the browned garlic and season with salt and ground black pepper as needed.",
      "Transfer to a serving plate. Top with the remaining garlic. Serve with white rice.",
      "Share and enjoy!"
    ],
    "cooking_time": "N/A",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/garlic-tokwa-and-kangkong-in-oyster-sauce/",
    "image_url": "",
    "image_path": "",
    "category": "Vegetable Dishes"
  },
  {
    "title": "Peach Mango Pie (Air Fryer)",
    "ingredients": [
      "▢ 12 slices loaf bread",
      "▢ 1 cup Good Life breadcrumbs",
      "▢ 2 tablespoons all-purpose flour",
      "▢ 2 eggs beaten",
      "▢ 15 ounces mango diced",
      "▢ 15 ounces peach diced",
      "▢ 10 tbsp granulated white sugar",
      "▢ 1 tablespoon cornstarch",
      "▢ 1 teaspoon lemon juice",
      "▢ A pinch of salt",
      "▢ ½ teaspoon vanilla extract",
      "▢ 3 tablespoons water"
    ],
    "instructions": [
      "Make the filling by combining mangoes, peaches, sugar, vanilla extract, lemon juice, and salt in a bowl. Mix well.",
      "Pour the mixture in a pan. Cook for 5 minutes.",
      "Combine cornstarch and water to create a slurry. Mix well. Pour the mixture into the pan. Stir and continue cooking until the mixture thickens. Remove from the pan and let it cool down.",
      "Lay each slice of loaf on a chopping board. Slice-out the dark edges. Dust flour on your rolling pin and then flatten each bread slices.",
      "Scoop around 2 ½ tablespoons of filling mixture and put it on the center of the flattened bread. Make bread pockets by covering the filling. Do this by folding the bread symmetrically. Brush beaten egg on the sides and secure it by pressing the edges against each other. Do this step until all the filling are consumed.",
      "Dredge the bread pockets in all-purpose flour. Dip in beaten egg. Roll it in Good Life Breadcrumbs. Spray cooking oil on both sides and then arrange in a clean plate. Let it stay for at least 5 minutes.",
      "Air fry in 370F until the breadcrumbs turns golden brown. Flip the peach mango pie and do the same on the opposite side. Serve. Share and enjoy!"
    ],
    "cooking_time": "N/A",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/peach-mango-pie-air-fryer/",
    "image_url": "",
    "image_path": "",
    "category": "Other Filipino Dishes"
  },
  {
    "title": "Japanese Curry Recipe (Battleship Curry)",
    "ingredients": [
      "▢ 2 lbs. beef thinly sliced",
      "▢ 1 Knorr beef cube",
      "▢ 2 potatoes diced",
      "▢ 2 carrots diced",
      "▢ 4 tablespoons curry powder",
      "▢ 3 tablespoons tomato ketchup",
      "▢ 3 tablespoons Worcestershire sauce",
      "▢ 3 teaspoons honey",
      "▢ 2 yellow onions chopped",
      "▢ 3 cloves garlic sliced",
      "▢ 3 cups water",
      "▢ 1 tablespoon cornstarch",
      "▢ ½ cup coffee",
      "▢ 2 tablespoons cooking oil",
      "▢ 1 tablespoon butter",
      "▢ ¼ cup grated cheddar cheese",
      "▢ Salt and ground black pepper to taste"
    ],
    "instructions": [
      "Season beef with salt and pepper. Set aside.",
      "Heat oil in a cooking pot. Add the butter and let it melt.",
      "Put the beef slices and stir-fry until it turns light brown in color.",
      "Add onion and garlic. Sauté for 1 minute.",
      "Add the carrot and cook it for 2 minutes while stirring occasionally.",
      "Pour the water into the cooking pot. Let it boil.",
      "Add the Knorr Beef Cube, Curry Powder, Ketchup. Worcestershire sauce, and honey. Cover and Simmer for 15 minutes.",
      "Add the potato and continue to simmer for 12 minutes.",
      "Combine cornstarch with 3 tablespoons of water. Stir and pour into the pot. Stir.",
      "Add cheese and coffee.",
      "Season with salt and ground black pepper as needed."
    ],
    "cooking_time": "N/A",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/japanese-curry-recipe-battleship-curry/",
    "image_url": "",
    "image_path": "",
    "category": "Other Filipino Dishes"
  },
  {
    "title": "Sotanghon with Sayote and Giniling",
    "ingredients": [
      "▢ 4 ounces sotanghon",
      "▢ 4 ounces ground pork",
      "▢ 2 chayote sliced",
      "▢ 1 onion minced",
      "▢ 5 cloves garlic",
      "▢ 1 teaspoon annatto seeds",
      "▢ 8 cups water",
      "▢ 3 stalks  green onion",
      "▢ Fish sauce and ground black pepper to taste",
      "▢ 4 tablespoons cooking oil"
    ],
    "instructions": [
      "Make the annatto oil by combining 4 tablespoons of cooking oil and 1 teaspoon annatto seeds in a pan. Start heating the pan while gently stirring the oil. Turn the heat off once the oil shimmers. Continue to stir until the oil turns orangey. Remove the annatto seeds.",
      "Using the annatto oil, sauté garlic until it browns.",
      "Add the onion and the bottom part of the green onions. Continue to sauté until it softens.",
      "Add the ground pork. Sauté until it browns.",
      "Add 2 teaspoons fish sauce. Stir.",
      "Pour 2 cups water. Cover the pot and let it boil. Reduce the heat to low setting. Boil the pork for 2 minutes.",
      "Add the remaining water and let it boil.",
      "Stir-in the chayote, and sotanghon noodles. Cook for 8 minutes.",
      "Season with fish sauce and ground black pepper.",
      "Transfer to a serving bowl and garnish with chopped green onion.",
      "Serve hot. Share and enjoy!"
    ],
    "cooking_time": "N/A",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/sotanghon-with-sayote-and-giniling/",
    "image_url": "",
    "image_path": "",
    "category": "Noodles"
  },
  {
    "title": "Eggplant with Ground Pork in Oyster Sauce",
    "ingredients": [
      "▢ 2 Chinese eggplants sliced",
      "▢ 4 ounces ground pork",
      "▢ 1 red bell pepper",
      "▢ 1 onion minced",
      "▢ 3 cloves garlic minced",
      "▢ 1 thumb  ginger",
      "▢ ½ teaspoon Sesame oil",
      "▢ 1 tablespoon soy sauce",
      "▢ 1 teaspoon brown sugar",
      "▢ 1 red bell pepper",
      "▢ 5 tablespoons cooking oil",
      "▢ 2 tablespoons oyster sauce",
      "▢ 3 stalks  green onion",
      "▢ ½ cup water",
      "▢ Salt and ground black pepper to taste"
    ],
    "instructions": [
      "Heat 3 tablespoons of cooking oil in a pan. Fry both sides of the sliced eggplants until it softens. Transfer the eggplants on a clean plate. Set aside.",
      "Add the remaining cooking oil and sesame oil. Saute the onion, garlic, and ginger.",
      "Add the ground pork once the onion softens. Saute it until the color turns light brown.",
      "Add soy sauce, oyster sauce, sugar, and water. Continue cooking until the liquid evaporates.",
      "Add the bell pepper and then put the eggplants back into the pan. Stir fry for 3 minutes.",
      "Season with salt and ground black pepper.",
      "Serve hot over rice. Share and enjoy!"
    ],
    "cooking_time": "N/A",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/eggplant-with-ground-pork-in-oyster-sauce/",
    "image_url": "",
    "image_path": "",
    "category": "Pork Dishes"
  },
  {
    "title": "Chicken Afritada sa Gata",
    "ingredients": [
      "▢ 4 lbs. chicken sliced into serving pieces",
      "▢ 40 grams Knorr Ginataang Gulay Recipe Mix",
      "▢ 1 Knorr Chicken Cube",
      "▢ 3 potatoes",
      "▢ 4 carrots",
      "▢ 3 bell peppers",
      "▢ ¾ cup green peas",
      "▢ 1 onion chopped",
      "▢ 6 cloves garlic",
      "▢ 8 ounces tomato sauce",
      "▢ 8 hotdogs",
      "▢ 2 cups water",
      "▢ 3 tablespoons cooking oil",
      "▢ Salt and ground black pepper to taste"
    ],
    "instructions": [
      "Heat oil in a pan. Saute garlic and onion.",
      "Add the chicken. Saute until it turns light brown in color.",
      "Add tomato sauce, hotdogs, and water. Let it boil.",
      "Combine Knorrr Ginataang Gulay Recipe Mix with 2 cups water. Mix well and then pour it into the pan. Cover and cook for 45 minutes using low heat.",
      "Add Knorr Chicken Cube, potatoes, and carrots. Cook for 8 minutes.",
      "Add the green peas and bell peppers. Cook for 3 minutes.",
      "Season with salt and ground black pepper.",
      "Serve with rice. Share and enjoy!"
    ],
    "cooking_time": "N/A",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/chicken-afritada-sa-gata/",
    "image_url": "",
    "image_path": "",
    "category": "Chicken Dishes"
  },
  {
    "title": "Easy Pata Tim (Ham Hock Recipe)",
    "ingredients": [
      "▢ 4 lbs pork leg",
      "▢ 1 Knorr Pork Cube",
      "▢ 1 bunch  baby bok choy",
      "▢ 10 Shiitake mushroom",
      "▢ 1 carrot sliced crosswise",
      "▢ 4 tablespoons brown sugar",
      "▢ 1 teaspoon sesame oil",
      "▢ 4 tablespoons soy sauce",
      "▢ 1 tablespoon cornstarch",
      "▢ 1 star anise",
      "▢ 2 bay leaves",
      "▢ 2 teaspoons whole peppercorn",
      "▢ 3 cloves garlic minced",
      "▢ 1 onion chopped",
      "▢ 8 cups water",
      "▢ 3 tablespoons cooking oil"
    ],
    "instructions": [
      "Boil 5 cups of water. Add bay leaves and pata. Cook for 10 minutes. Drain the water and set the pata aside.",
      "Heat cooking oil and sesame oil and then sauté onion and garlic.",
      "Once the onion softens, add the boiled pata. Sauté for 1 minute.",
      "Add soy sauce and pour 3 cups of water into the cooking pot. Let it boil.",
      "Add Knorr Pork Cube and star anise. Pressure-cook for 20 minutes",
      "Add sugar, Shitake mushroom and carrot. Cook for 3 minutes.",
      "Add the bok choy. Continue cooking for 1 minute.",
      "Combine cornstarch and 1/4 cup water. Stir and pour the mixture into the cooking pot. Continue cooking until the sauce thickens.",
      "Season with salt and ground black pepper as needed.",
      "Serve. Share and enjoy!"
    ],
    "cooking_time": "N/A",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/easy-pata-tim-ham-hock-recipe/",
    "image_url": "",
    "image_path": "",
    "category": "Pork Dishes"
  },
  {
    "title": "Monggo Pinakbet",
    "ingredients": [
      "▢ 12 ounces mung beans",
      "▢ 1 Knorr Pork Cube",
      "▢ 3 tablespoons shrimp paste",
      "▢ 12 string beans cut into 2-inch pieces",
      "▢ 1 Chinese eggplant sliced lengthwise",
      "▢ 1 bitter melon cored and sliced",
      "▢ 10 ounces Calabaza squash cubed",
      "▢ 8 pieces okra",
      "▢ 2 tomatoes cubed",
      "▢ 2 thumbs ginger crushed",
      "▢ 5 cloves garlic chopped",
      "▢ 1 onion  chopped",
      "▢ 3 cups water",
      "▢ Salt and ground black pepper to taste"
    ],
    "instructions": [
      "Soak the mung beans in water overnight. Drain the water and set the mung beans aside.",
      "Heat 2 tablespoons of cooking oil in a pan. Saute half of the total amount of garlic, onion, and tomatoes. Once the onion and tomato soften, add the mung beans. Saute for 2 minutes.",
      "Pour the water into the pot. Let boil.",
      "Add the Knorr Pork Cube. Stir. Cover the pot and boil the mung beans using low to medium heat for 45 minutes. Note: Add water as needed. Set this aside.",
      "On a separate pan, sauté the remaining garlic, onion, and tomato. Add the ginger. Continue sautéing until the onion and tomato softens.",
      "Add the sliced pork. Saute until the color of the pork turns light brown.",
      "Pour ¾ cup water. Let it boil. Cover the pot and continue boiling the pork until the water evaporates completely.",
      "Add the shrimp paste. Saute for 1 minute.",
      "Add calabaza squash. Cook for 2 minutes.",
      "Add eggplant, bitter melon, okra, and string beans. Saute for 2 minutes.",
      "Add ½ cup water. Let it boil.",
      "Pour the cooked mung beans into the pot. Stir and continue cooking for 3 to minutes.",
      "Season with salt and ground black pepper.",
      "Transfer to a serving bowl. Serve with rice.",
      "Share and enjoy!"
    ],
    "cooking_time": "N/A",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/monggo-pinakbet/",
    "image_url": "",
    "image_path": "",
    "category": "Vegetable Dishes"
  }
]