[
  {
    "title": "Creamy Mushroom Chicken",
    "ingredients": [
      "▢ 1 ½ lbs. chicken cut into serving pieces",
      "▢ 1 Knorr Chicken Cube",
      "▢ 1 cup all-purpose cream",
      "▢ 1 carrot sliced",
      "▢ 12 long green beans",
      "▢ 10 ounces button mushroom canned",
      "▢ 1 onion chopped",
      "▢ 5 cloves garlic chopped",
      "▢ 1 tablespoon roasted garlic",
      "▢ ½ teaspoon salt",
      "▢ ¼ teaspoon ground black pepper",
      "▢ 2 tablespoons butter unsalted",
      "▢ 1 ¼ cups water",
      "▢ 4 tablespoons cooking oil"
    ],
    "instructions": [
      "Rub salt and ground black pepper all over the chicken pieces. Let it stay for 5 minutes.",
      "Heat 2 tablespoons oil in a pan. Sauté carrot and long green beans for 2 minutes. Season with salt. Remove from the pan and set aside.",
      "Add remaining oil in the pan. Once the oil gets hot, pan fry the chicken for 1 to 2 minutes per side. Remove the chicken and place in a clean plate. Set aside.",
      "Melt the butter in the pan. Sauté the garlic until it starts to turn light brown.",
      "Add the onion. Continue cooking until the onion softens.",
      "Put the chicken back into the pan. Sauté for 2 minutes.",
      "Pour the water in the pan and let it boil.",
      "Add the Knorr Chicken cube. Cover the pan and continue cooking for 15 minutes.",
      "Pour the all-purpose cream, add the mushroom, and roasted garlic. Cook for 1 minute.",
      "Add the carrot and long green beans. Season with salt and ground black pepper as needed.",
      "Transfer to a serving plate. Serve warm with rice.",
      "Share and enjoy!"
    ],
    "cooking_time": "N/A",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/creamy-mushroom-chicken/",
    "image_url": "",
    "image_path": "",
    "category": "Chicken Dishes"
  },
  {
    "title": "Cassava Cake Recipe Creamy and Cheesy Version",
    "ingredients": [
      "▢ 2 lbs. cassava grated",
      "▢ 2 cups coconut cream",
      "▢ 12 ounces evaporated milk",
      "▢ 3 eggs",
      "▢ 3 tablespoons butter melted",
      "▢ 1/2 cup quick-melt cheese shredded",
      "▢ 14 ounces condensed milk",
      "▢ 1 cup coconut cream",
      "▢ 7 ounces condensed milk",
      "▢ 1 cup quick-melt cheese shredded",
      "▢ 4 tablespoons butter melted"
    ],
    "instructions": [
      "Preheat oven to 350F.",
      "Combine the wet ingredients in a mixing bowl starting by cracking the eggs. Beat until smooth. Pour the evaporated milk, condensed milk, butter, and coconut milk. Whisk everything together until the mixture smoothens.",
      "Add the grated cassava and ½ cup cheese in the bowl where the wet ingredients are at. Mix well.",
      "Transfer the mixture into a greased baking pan. Bake for 1 hour.",
      "Prepare the topping my mixing all the toping ingredients in a clean bowl. Mix everything together. Set aside.",
      "Pour the topping mixture over the baked cassava. Put the baking pan back in the oven. Continue baking for 350F until the topping thickens. Note: You will notice that it will burn a bit, that is normal.",
      "Remove the baking pan from the oven. Let the cassava cake cool down.",
      "Slice the cake into serving pieces. Serve for dessert."
    ],
    "cooking_time": "N/A",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/cassava-cake-recipe-creamy-and-cheesy-version/",
    "image_url": "",
    "image_path": "",
    "category": "Other Filipino Dishes"
  },
  {
    "title": "Filipino style Beef steak",
    "ingredients": [
      "▢ 2 lbs. beef (note 1)",
      "▢ 1 Knorr Beef Cube",
      "▢ 2 onions (note 2)",
      "▢ 4 cloves garlic (note 3)",
      "▢ 1 teaspoon peppercorns (note 4)",
      "▢ 2 teaspoons cornstarch",
      "▢ 1 ½ teaspoons brown sugar",
      "▢ 6 tablespoons soy sauce",
      "▢ ½ lemon",
      "▢ 2 ½ cups water",
      "▢ 3 tablespoons cooking oil"
    ],
    "instructions": [
      "Combine beef, soy sauce, juice from ½ lemon, and ½ teaspoon cracked peppercorn in a bowl. Mix well. Refrigerate for at least 1 hour.",
      "Heat cooking oil in a pan. Fry each side of the marinated beef for 1 minute. Remove and set aside.",
      "Using the remaining oil (you can add more if needed), sauté half of the onion and add the garlic.",
      "Put the beef in the pan once the onion softens. Sauté for 1 minute.",
      "Pour 1 ½ cups of water into the pan. Cover and let the liquid boil.",
      "Add Knorr Beef Cube. Cover the pan and then adjust the heat to a low setting. Cook for up to 40 minutes.  Note: add more water as needed.",
      "Add remaining onion and season with cracked peppercorn and add brown sugar.",
      "Make the sauce thicker by pouring-in the slurry. Do this by mixing cornstarch with 3 tablespoons of water.",
      "Once the sauce gets thick enough, you may turn the heat off and transfer your Filipino Style Beef Steak to a serving bowl.",
      "Serve with warm rice. Share and enjoy!"
    ],
    "cooking_time": "N/A",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/filipino-style-beef-steak/",
    "image_url": "",
    "image_path": "",
    "category": "Other Filipino Dishes"
  },
  {
    "title": "Chicken Mechado",
    "ingredients": [
      "▢ 2 lbs. chicken cut into serving pieces",
      "▢ 1 Knorr Chicken Cube",
      "▢ 2 potatoes sliced",
      "▢ 3 tablespoons soy sauce",
      "▢ 1 lemon",
      "▢ 8 ounces tomato sauce",
      "▢ 1 bell pepper optional",
      "▢ 1 cup water",
      "▢ 3 laurel leaves",
      "▢ 1 onion chopped",
      "▢ 3 cloves garlic chopped",
      "▢ ½ teaspoon sugar",
      "▢ Salt and ground black pepper to taste",
      "▢ 4 tablespoons cooking oil"
    ],
    "instructions": [
      "Heat oil in a pan. Fry the potatoes for 3 minutes per side. Remove from the pan. Set aside.",
      "Sauté onion and garlic until the former softens.",
      "Add chicken pieces. Sauté for 3 to 4 minutes.",
      "Add the soy sauce. Cook for 1 minute.",
      "Add tomato sauce and water. Let it boil.",
      "Add Knorr Chicken Cube and laurel leaves. Cover the pan. Adjust the heat to the lowest setting. Continue cooking for 40 minutes.",
      "Add lemon zest and bell pepper. Cook for 3 minutes.",
      "Put the sugar and fried potato in the pot. Cook for 2 minutes.",
      "Season with salt and ground black pepper.",
      "Serve warm with rice. Share and enjoy!"
    ],
    "cooking_time": "N/A",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/chicken-mechado/",
    "image_url": "",
    "image_path": "",
    "category": "Main Dishes"
  },
  {
    "title": "Igado Recipe",
    "ingredients": [
      "▢ 1/2 lbs. pork tenderloin sliced into 2-inch strips",
      "▢ 1/2 lb. pork liver sliced into 2-inch strips",
      "▢ 1/2 lb. pork kidney",
      "▢ 1 Knorr Pork Cube",
      "▢ 1 red bell pepper cut into strips",
      "▢ 1/2 cup green peas",
      "▢ 1 carrot julienne",
      "▢ 3 laurel leaves",
      "▢ 1 onion minced",
      "▢ 5 cloves garlic minced",
      "▢ 6 tablespoons soy sauce",
      "▢ 5 tablespoons white vinegar",
      "▢ 1 1/4 cup water",
      "▢ 4 tablespoons cooking oil",
      "▢ Salt and pepper to taste"
    ],
    "instructions": [
      "Boil the kidney with 4 thumbs of ginger for at least 30 minutes. Let it cool down and slice into 2-inch strips. Set aside.",
      "Heat 2 tablespoons of cooking oil in a pan. Sauté the pork liver for 2 minutes. Remove from the pan and set aside.",
      "Pour the remaining oil in the pan. Once hot, sauté garlic and onion until the latter softens.",
      "Add the pork kidney. Cook for 1 minute.",
      "Add the pork tenderloin. Sauté until the outer layer turns light brown.",
      "Pour the soy sauce and vinegar into the pan. Let the liquid boil. Stir.",
      "Add the laurel leaves and pour water. Let boil. Reduce the heat between low to medium setting. Continue cooking for 40 minutes.",
      "Add Knorr Pork Cube. Cook for 8 minutes.",
      "Add the liver back into the pan. Stir and continue cooking for 3 minutes.",
      "Put the bell pepper, carrot, and green peas.",
      "Season with salt and ground black pepper. Cook for 2 minutes.Transfer to a serving bowl. Serve hot with rice.",
      "Share and enjoy!"
    ],
    "cooking_time": "55 minutes",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/ilocano-pork-igado-recipe/",
    "image_url": "",
    "image_path": "",
    "category": "Pork Dishes"
  },
  {
    "title": "Lemon Garlic Shrimp Pasta",
    "ingredients": [
      "▢ 1 lb. shrimp deveined and shells removed",
      "▢ ½ lb fettuccine pasta",
      "▢ 7.6 ounces all-purpose cream",
      "▢ ½ lemon",
      "▢ 5 cloves garlic crushed and chopped",
      "▢ 15 grape tomatoes halved",
      "▢ ¼ cup parmesan cheese",
      "▢ ¼ cup butter",
      "▢ 2 tablespoons parsley chopped",
      "▢ 3 tablespoons olive oil",
      "▢ Salt and ground black pepper to taste"
    ],
    "instructions": [
      "Cook pasta according to package instructions. You can add a teaspoon of salt before boiling. Set aside.",
      "Heat a pan. Pour-in olive oil. Add the shrimp once the oil gets hot. Saute for 2 minutes or until both sides of the shrimp turns orange in color. Remove the shrimp from the pan and transfer to a clean plate. Set aside.",
      "Heat the remaining oil (if applicable. Otherwise add 2 tablespoons of olive oil). Add 2 tablespoons of butter and continue cooking until the butter melts and starts to bubble.",
      "Add garlic. Cook while continuously stirring for 30 seconds.",
      "Add grape tomatoes. Continue sautéing for 1 minute.",
      "Pour the all-purpose cream into the pan and then add ¼ cup of pasta water (this is the water used to cook the fettuccine). Stir and then add the lemon zest. Let the mixture slowly boil (use medium heat setting). Continue cooking for 1 minute. Season with salt and ground black pepper.",
      "Toss the pasta into the pan. Add the shrimp, parsley, and remaining butter. Continue tossing until all ingredients are incorporated. Top with more parmesan cheese if desired.",
      "Serve warm. Share and enjoy!"
    ],
    "cooking_time": "N/A",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/lemon-garlic-shrimp-pasta/",
    "image_url": "",
    "image_path": "",
    "category": "Other Filipino Dishes"
  },
  {
    "title": "Chicken Katsu Curry",
    "ingredients": [
      "▢ 2 lbs boneless chicken breasts",
      "▢ 1 cup Good Life Breadcrumbs",
      "▢ ¾ cup buttermilk",
      "▢ 3 ounces curry sauce mix",
      "▢ 1 potato cubed",
      "▢ 1 carrot cubed",
      "▢ 1 onion wedged",
      "▢ 2 ¼ cups water",
      "▢ ½ teaspoon salt",
      "▢ ½ teaspoon ground black pepper",
      "▢ 1 cup cooking oil"
    ],
    "instructions": [
      "Rub salt and ground black pepper all over the chicken. Arrange it on a wide bowl and pour the buttermilk. Make sure to coat the entire chicken. Cover the bowl and refrigerate for at least 3 hours.",
      "Meanwhile, make the curry sauce by heating 3 tablespoons of cooking oil in a cooking pot. Sauté the onion until it separates into layers. Add carrot and potato. Continue cooking for 1 minute.",
      "Pour water in the cooking pot. Cover and let it boil. Reduce the heat to medium and continue boiling for 10 minutes.",
      "Add the curry sauce mix. Stir until well blended. Turn the heat off and set the sauce aside while keeping it warm.",
      "Start preparing to fry the chicken by heating the oil to 350F in a deep cooking pot.",
      "Separate the chicken breast from the buttermilk letting excess liquid drip. Dredge the chicken breasts in the Good Life Panko Breadcrumbs until all the sides are completely coated.",
      "Deep fry the chicken for 10 to 12 minutes. Remove from the pot and let the excess oil drip.",
      "Arrange on a plate with curry sauce. Serve with warm rice.",
      "Share and enjoy!"
    ],
    "cooking_time": "N/A",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/chicken-katsu-curry/",
    "image_url": "",
    "image_path": "",
    "category": "Chicken Dishes"
  },
  {
    "title": "Chicken Empanada",
    "ingredients": [
      "▢ 1 1/2 lbs chicken breast cut into cubes",
      "▢ 1 Knorr chicken cube",
      "▢ 1 cup potato diced",
      "▢ 1 cup carrot diced",
      "▢ 1 cup green peas",
      "▢ 1/4 cup raisins",
      "▢ 1 onion minced",
      "▢ 1 tablespoon garlic minced",
      "▢ 2 tablespoons oyster sauce",
      "▢ 2 tablespoons soy sauce",
      "▢ 1 teaspoon sugar",
      "▢ Salt and ground black pepper to taste",
      "▢ 2 tablespoon cooking oil",
      "▢ 3 cups flour",
      "▢ 4 tablespoons sugar",
      "▢ 1 cup butter",
      "▢ 1/2 teaspoon baking powder",
      "▢ 6 tablespoon water cold",
      "▢ 1 egg"
    ],
    "instructions": [
      "Start cooking the  filing by heating the cooking oil in a pan.",
      "Once the oil is hot, saute the garlic and onion.",
      "Add the chicken breast then cook until color turns light brown (about 5 minutes)",
      "Add oyster sauce, soy sauce, and Knorr chicken cube. Stir and cover the pot. Cook for 5 minutes.",
      "Put-in carrots and potatoes. Cook for another 5 minutes",
      "Add the green peas, raisins, and sugar then simmer for 3 minutes",
      "Season with salt and ground black pepper. Turn off the heat, drain the excess liquid, and set aside.",
      "Make the dough by combining the dry ingredients in a mixing bowl starting with the all-purpose flour, sugar, baking powder, and salt. Mix well using a wire whisk.",
      "Cut the butter into small thin pieces place in the mixing bowl with the dry ingredients.(the butter should be cold and solid before doing this)",
      "Add water gradually and mix all the ingredients thoroughly until a dough is formed. You may use a pastry blender to ease the process.",
      "Divide the dough into individual pieces by grabbing a piece from the whole mixture and rolling it in your hand until a spherical shape is formed. Do this until all the dough is consumed. Set aside in a cool place for at least 20 minutes",
      "Flatten the spherical dough by pressing it with your palm against a flat surface. Use a rolling pin to flatten it fully while creating a round shape.",
      "Arrange about a quarter to half a cup of filling (the chicken that you cooked in the first few steps) at the middle of the flattened dough. Fold the dough so that opposite ends meet (you should have formed a half moon shaped dough)then press the edges and seal. (refer to the video for the technique)",
      "After all the fillings are consumed, crack the egg and separate the white from the yolk. Beat the egg white lightly and mix a little water.Glaze the crust by brushing the egg wash.",
      "Put a wax paper on top of a baking tray or grease the baking tray then arranged the sealed doughs.",
      "Pre-heat oven at 400 degrees Fahrenheit for 10 minutes. Bake the sealed doughs for 25 minutes at the same temperature.",
      "Remove from the oven.",
      "Serve hot. Share and Enjoy!"
    ],
    "cooking_time": "55 minutes",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/filipino-cuban-spanish-food-chicken-empanada-picadillo-recipe/",
    "image_url": "",
    "image_path": "",
    "category": "Chicken Dishes"
  },
  {
    "title": "Sinigang",
    "ingredients": [
      "▢ 2 lbs. pork belly see notes",
      "▢ 1 lb. young tamarind see notes",
      "▢ 1 bunch  water spinach chopped",
      "▢ 8 pieces string beans cut into 2-inch pieces",
      "▢ 2 pieces eggplants sliced",
      "▢ 1 piece daikon radish see notes",
      "▢ 8 pieces okras",
      "▢ 2 pieces tomatoes sliced into wedges",
      "▢ 2 pieces long green pepper",
      "▢ 1 piece onion sliced into wedges",
      "▢ 2 quarts water",
      "▢ Fish sauce and ground black pepper  to taste"
    ],
    "instructions": [
      "Boil the young tamarind in 2 quarts of water for 40 minutes. Filter the tamarind broth using a kitchen sieve or a strainer. Squeeze the tamarind afterwards to extract its remaining juices.1 lb. young tamarind, 2 quarts water",
      "Pour the tamarind broth into a cooking pot. Let it boil and then add the onion, pork belly, and half the amount of the tomatoes.2 lbs. pork belly, 1 piece onion, 2 pieces tomatoes",
      "Skim-off the floating scums, pour 1 tablespoon fish sauce, cover and continue to simmer for 1 hour.Fish sauce and ground black pepper",
      "Add daikon radish and eggplants. Cook for 5 minutes.1 piece daikon radish, 2 pieces eggplants",
      "Add the long green pepper, string beans, remaining tomatoes, and okra. Cook for 3 minutes.8 pieces string beans, 2 pieces tomatoes, 2 pieces long green pepper, 8 pieces okras",
      "Add the chopped water spinach stalks and season with fish sauce and ground black pepper. Cook for 2 minutes.Fish sauce and ground black pepper",
      "Put the water spinach leaves. Cover and turn the heat off. Let the residual heat cook the leaves for 3 minutes before serving.1 bunch  water spinach",
      "Share and enjoy!"
    ],
    "cooking_time": "N/A",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/pork-sinigang-na-baboy-recipe/",
    "image_url": "",
    "image_path": "",
    "category": "Seafood"
  },
  {
    "title": "Pork Adobo Recipe",
    "ingredients": [
      "▢ 2 lbs pork belly (note 1)",
      "▢ 2 tablespoons garlic (note 2)",
      "▢ 5  dried bay leaves (note 3)",
      "▢ 4 tablespoons vinegar (note 4)",
      "▢ 1/2 cup soy sauce (note 5)",
      "▢ 1 tablespoon peppercorn (note 6)",
      "▢ 2 cups water",
      "▢  Salt to taste"
    ],
    "instructions": [
      "Combine the pork belly, soy sauce, and garlic then marinade for at least 1 hour2 lbs pork belly, 1/2 cup soy sauce, 2 tablespoons garlic",
      "Heat the pot and put-in the marinated pork belly then cook for a few minutes",
      "Pour remaining marinade including garlic.",
      "Add water, whole pepper corn, and dried bay leaves then bring to a boil. Simmer for 40 minutes to 1 hour1 tablespoon peppercorn, 2 cups water, 5 dried bay leaves",
      "Put-in the vinegar and simmer for 12 to 15 minutes4 tablespoons vinegar",
      "Add salt to tasteSalt to taste",
      "Serve hot. Share and enjoy!"
    ],
    "cooking_time": "1 hour",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/filipino-food-pork-adobo-recipe/",
    "image_url": "",
    "image_path": "",
    "category": "Chicken Dishes"
  },
  {
    "title": "Pork Afritada Recipe",
    "ingredients": [
      "▢ 2 lbs pork shoulder cubed",
      "▢ 1  Knorr Pork Cube",
      "▢ 3  hot dogs sliced",
      "▢ 2  carrots sliced into small wedges",
      "▢ 2  potato cube",
      "▢ 8 oz. tomato sauce",
      "▢ 3/4 cup green peas",
      "▢ 1  tomato cubed",
      "▢ 4  dried bay leaves",
      "▢ 1  onion chopped",
      "▢ 6 cloves garlic chopped",
      "▢ 3 cups water",
      "▢ 3 tablespoons cooking oil",
      "▢ Salt and ground black pepper to taste"
    ],
    "instructions": [
      "Heat oil in a cooking pot.",
      "Once the oil gets hot, saute onion and garlic until onion softens.",
      "Add pork Saute until brown.",
      "Pour tomato sauce and water. Stir and let boil.",
      "Add Knorr Pork Cube. Stir. Add dried bay leaves. Cover and cook in medium heat for 30 minutes. Note: Add more water if needed.",
      "Add hotdogs. Cook for 10 minutes.",
      "Add carrot and potato. Cover and cook for 8 minutes.",
      "Add green peas. Cook for 3 to 5 minutes.",
      "Season with salt and ground black pepper.",
      "Transfer to a serving plate. Serve.",
      "Share and enjoy!"
    ],
    "cooking_time": "1 hour",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/pork-afritada-recipe/",
    "image_url": "",
    "image_path": "",
    "category": "Chicken Dishes"
  },
  {
    "title": "Pinoy Chicken Curry Recipe",
    "ingredients": [
      "▢ 2 lbs. chicken cut into serving pieces",
      "▢ 1 tablespoon curry powder",
      "▢ 1 piece potato cubed",
      "▢ 4 cloves garlic minced",
      "▢ 2 stalks celery sliced",
      "▢ 1 piece red bell pepper sliced",
      "▢ 2 pieces long green pepper",
      "▢ 1 piece  onion chopped",
      "▢ 2 thumbs ginger cut into strips",
      "▢ 2 cups coconut milk",
      "▢ 1/2 cup all-purpose cream optional",
      "▢ 1 cup water",
      "▢ fish sauce and ground black pepper to taste"
    ],
    "instructions": [
      "Heat oil in a pan. Fry potato for 1 minute per side. Remove from the pan. Set aside.",
      "Using the remaining oil, saute garlic, onion, celery, and ginger until onion softens.",
      "Add the chicken pieces. Saute until the outer part of the chicken turns light brown.",
      "Add 1 tablespoon fish sauce. Continue sautéing for 1 minute.",
      "Pour-in coconut milk and water. Let boil.",
      "Add curry powder. Stir until the powder is completely diluted. Cover the pot and continue cooking between low to medium heat until the liquid reduces to half.",
      "Add the red bell pepper and pan fried-potato. Cook for 5 minutes.",
      "Season with fish sauce and ground black pepper as needed. You can also add all-purpose cream if desired.",
      "Transfer to a serving bowl. Serve and enjoy!"
    ],
    "cooking_time": "1 hour",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/chicken-curry-pinoy-style/",
    "image_url": "",
    "image_path": "",
    "category": "Chicken Dishes"
  }
]