[
  {
    "title": "Pork Ribs Binagoongan",
    "ingredients": [
      "▢ 2 lbs. pork spareribs",
      "▢ 1 piece Knorr Pork Cube",
      "▢ 3 ½ tablespoons bagoong alamang",
      "▢ 3 cloves garlic chopped",
      "▢ 1 piece onion chopped",
      "▢ 1 piece tomato diced",
      "▢ 2 tablespoons white vinegar",
      "▢ 1 piece Chinese eggplant sliced into serving pieces",
      "▢ 2 cups water",
      "▢ 1 teaspoon granulated white sugar",
      "▢ ¼ teaspoon ground black pepper",
      "▢ ¼ cup green onion chopped",
      "▢ 5 tablespoons cooking oil"
    ],
    "instructions": [
      "Heat 3 tablespoons of cooking oil in a pan. Fry eggplants for 3 minutes or until its texture softens. Remove from the pan. Set aside. Note: Make sure to flip it every minute to cook all sides evenly.",
      "Add remaining oil. Sauté onion, garlic, and tomato until the onion softens.",
      "Add pork ribs. Continue cooking until the color of the ribs turn light brown.",
      "Add bagoong alamang. Cook for 3 minutes while stirring.",
      "Pour-in vinegar. Let boil. Stir and add water. Let it boil.",
      "Add Knorr Pork Cube. Cover the pan and adjust heat to the lowest setting. Cook until the meat gets tender. Note: Add more water if needed.",
      "Season with sugar and ground black pepper.",
      "Add fried eggplants. Cook for 1 ½ minutes.",
      "Finish by adding chopped green onions.",
      "Serve with warm rice! Share and enjoy."
    ],
    "cooking_time": "N/A",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/pork-ribs-binagoongan/",
    "image_url": "",
    "image_path": "",
    "category": "Pork Dishes"
  },
  {
    "title": "Yema Recipe",
    "ingredients": [
      "▢ 28 ounces condensed milk equivalent to 2 cans",
      "▢ 3 tablespoons peanuts roasted"
    ],
    "instructions": [
      "Chop the peanuts. Set aside.",
      "Pour condensed milk on a cooking pot. Let boil. Stir constantly while boiling for 10 minutes.",
      "Lower the heat. Add chopped peanuts. Continue cooking while stirring for another 10 minutes or until consistency becomes paste-like.",
      "Transfer yema mixture to a bowl.",
      "Start wrapping the yema candies individually on a pre-cut cellophane. (Note: The dimensions of my cellophane were 4x4 inches. You can decrease the dimension for smaller candies.)",
      "Let it cool down before eating. Share and enjoy!"
    ],
    "cooking_time": "N/A",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/yema-recipe/",
    "image_url": "",
    "image_path": "",
    "category": "Other Filipino Dishes"
  },
  {
    "title": "Crispy Eggplant Fries",
    "ingredients": [
      "▢ 1 piece eggplant sliced",
      "▢ 1/2 cup all-purpose flour",
      "▢ 1/2 cup Panko breadcrumbs",
      "▢ 1 piece egg",
      "▢ 1/2 teaspoon salt",
      "▢ 1 1/2 cups cooking oil",
      "▢ 1/4 cup mayonnaise",
      "▢ 3 tablespoons banana ketchup",
      "▢ 1/2 teaspoon tabasco sauce",
      "▢ Onion powder to taste",
      "▢ Garlic powder to taste",
      "▢ Salt to taste"
    ],
    "instructions": [
      "Slice eggplant into thick strips. Place everything in a bowl.",
      "Crack eggs on a clean bowl. Whisk until smooth. Arrange flour and breadcrumbs on separate bowls each. Set aside.",
      "Heat oil in a cooking pot. Dredge a strip of eggplant in flour. Dip in beaten egg, and then roll over Panko breadcrumbs.",
      "Fry in medium heat until the color of the crumbs turns golden brown. Note: perform this step until all eggplant slices are consumed. Place on a clean plate lined with paper towel.",
      "Make the dipping sauce by combining all sauce ingredients. Mix well.",
      "Arrange talong fries on a serving plate and serve with dipping sauce.",
      "Serve as an appetizer. Share and enjoy!"
    ],
    "cooking_time": "N/A",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/crispy-eggplant-fries/",
    "image_url": "",
    "image_path": "",
    "category": "Other Filipino Dishes"
  },
  {
    "title": "Pork Menudo sa Gata Recipe",
    "ingredients": [
      "▢ 1 ½ lbs. pork shoulder cut into cubes",
      "▢ 1 piece Knorr Pork Cube",
      "▢ 4 ounces pork liver cubed",
      "▢ 2 pieces potato cubed",
      "▢ 1 piece carrot cubed",
      "▢ 4 pieces dried bay leaves",
      "▢ 2 cups coconut milk",
      "▢ 8 ounces tomato sauce",
      "▢ 1 piece onion chopped",
      "▢ 3 cloves garlic minced",
      "▢ 3 tablespoons cooking oil",
      "▢ 3 tablespoons soy sauce",
      "▢ Salt and ground black pepper to taste"
    ],
    "instructions": [
      "Heat oil in a wok. Sauté garlic and onion until the onion softens.",
      "Add pork. Continue sautéing until the outer part turns light brown.",
      "Add soy sauce. Cook for 1 minute.",
      "Pour tomato sauce and coconut milk. Let boil.",
      "Add Knorr Pork Cube. Stir and then add dried bay leaves. Cover the wok. Adjust heat to a low setting. Cover the wok and continue cooking until the pork tenderizes.  Note: add water if the sauce starts to dry-up while the pork is not tender yet.",
      "Add pork liver. Cook for 8 minutes.",
      "Add potato and carrot. Cook for 10 minutes.",
      "Season with salt and ground black pepper. Serve with warm rice.",
      "Share and enjoy!"
    ],
    "cooking_time": "N/A",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/pork-menudo-sa-gata-recipe/",
    "image_url": "",
    "image_path": "",
    "category": "Main Dishes"
  },
  {
    "title": "Filipino Vinegar Dipping Sauce",
    "ingredients": [
      "▢ 1 1/2 cups coconut vinegar",
      "▢ 2 tablespoons soy sauce",
      "▢ 1 1/2 teaspoons sugar",
      "▢ 4 cloves garlic chopped",
      "▢ 1 piece onion chopped",
      "▢ 1/4 teaspoon ground black pepper",
      "▢ 5 pieces Thai chili pepper chopped",
      "▢ 1 piece siling pansigang sliced",
      "▢ 2 tablespoons green onion chopped",
      "▢ Salt to taste",
      "▢ 1 1/2 cups coconut vinegar",
      "▢ 8 Thai chili pepper",
      "▢ 1/2 piece bell pepper",
      "▢ 2 cloves garlic",
      "▢ 1 teaspoon whole peppercorn",
      "▢ 2 thumbs ginger",
      "▢ Salt to taste",
      "▢ 1 cup coconut vinegar",
      "▢ 1/2 cup Thai chili pepper",
      "▢ 4 thumbs ginger Julienne",
      "▢ 1 head garlic crushed"
    ],
    "instructions": [
      "Make the Sinamak dipping sauce by combining all the “sinamak” ingredients in a mason jar. Let it stay for at least 3 days before using.",
      "Make the Tokwat Baboy Style Vinegar dipping sauce by heating the vinegar in a saucepan. Add salt and sugar. Stir until the granules dissolve completely. Turn the heat off. Let the mixture cooldown before transferring to a mason jar. Put the remaining ingredients into the jar. Cover and shake well. You may use this immediately. Note: Store inside the fridge to maintain freshness.",
      "Make the Panlasang Pinoy Spicy Vinegar version by heating the vinegar in a saucepan. Add salt . Stir until the salt dissolves completely. Let it cool down. Pour vinegar in a food processor along with all the Panlasang Pinoy Spicy Vinegar ingredients. Process for 2 minutes. Transfer to a mason jar. This can be used immediately as a dipping sauce."
    ],
    "cooking_time": "N/A",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/filipino-vinegar-dipping-sauce/",
    "image_url": "",
    "image_path": "",
    "category": "Pork Dishes"
  },
  {
    "title": "Mutya ng Cavite Recipe",
    "ingredients": [
      "▢ 10 pieces shrimp",
      "▢ 4 pieces crab cut in half",
      "▢ 1 piece Knorr Shrimp Cube",
      "▢ 4 ounces squid sliced",
      "▢ 8 ounces fish fillet",
      "▢ 1 lb. mussels cleaned",
      "▢ 1 piece carrot sliced thinly",
      "▢ 1 piece red bell pepper sliced into squares",
      "▢ 1 piece green bell pepper sliced into squares",
      "▢ 1 piece onion chopped",
      "▢ 1 stalk  celery sliced",
      "▢ Salt and ground black pepper to taste",
      "▢ 3 tablespoons butter",
      "▢ 3 tablespoons all-purpose flour",
      "▢ 1 ½ cups evaporated milk",
      "▢ 1 ½ cups water"
    ],
    "instructions": [
      "Boil water in a wok or pan. Add crab. Continue boiling for 8 minutes. Transfer the crab and the stock to a clean bowl. Set aside.",
      "Make the roux by melting butter in a wok. Add flour. Constantly stir while cooking for 2 minutes. Pour evaporated milk into the wok. Stir until mixture thickens. Pour the crab stock and stir until the texture of the mixture becomes smooth.",
      "Add Knorr Shrimp Cube. Stir.",
      "Add Crab, mussels, fish, onion, carrot, and celery. Cook for 3 to 5 minutes.",
      "Put the bell pepper, shrimp, and squid into the wok. Stir and cook until the color of the shrimp turns orange.",
      "Season with salt and ground black pepper.",
      "Transfer to a serving bowl. Serve warm. Share and enjoy!"
    ],
    "cooking_time": "N/A",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/mutya-ng-cavite-recipe/",
    "image_url": "",
    "image_path": "",
    "category": "Seafood"
  },
  {
    "title": "Beef Pares sa Kanto",
    "ingredients": [
      "▢ 3 lbs. beef chuck cut into cubes",
      "▢ 1 piece Knorr Beef Cube",
      "▢ 3 pieces star anise",
      "▢ 1 piece onion chopped",
      "▢ 4 cloves garlic chopped",
      "▢ 3 thumbs  ginger minced",
      "▢ 1/4 cup soy sauce",
      "▢ 3 tablespoons brown sugar",
      "▢ 2 tablespoons cooking oil",
      "▢ 1 tablespoon onion powder",
      "▢ 1/4 teaspoon ground black pepper",
      "▢ 3 quarts water",
      "▢ 4 tablespoons cornstarch",
      "▢ Salt to taste",
      "▢ 3 1/2 cups leftover white rice",
      "▢ 5 cloves garlic",
      "▢ 3 tablespoons cooking oil",
      "▢ Salt to taste"
    ],
    "instructions": [
      "Make the beef pares by heating oil in a cooking pot. Add beef fat. Saute for 2 minutes.",
      "Add onion, garlic, and ginger. Saute until the onion gets tender.",
      "Add beef. Cook until color turns medium brown (this usually takes 5 minutes).",
      "Pour-in water. Let boil.",
      "Add star anise and Knorr Beef Cube. Cover the pot and adjust the heat to low. Cook for 2 to 2 1/2 hours or until beef gets very tender.",
      "Season with soy sauce, onion powder, ground black pepper, brown sugar, and salt. Stir.",
      "Make the garlic fried rice by heating oil in a pan. Add crushed garlic. Saute until garlic turns golden brown. Add leftover rice. Stir until all ingredients are well blended. Season with salt. Stir and cook for 3 to 5 minutes. Set aside.",
      "Arrange beef pares in a bowl and top with chopped green onions.",
      "Arrange garlic fried rice in another bowl and top with chopped green onions too.",
      "Serve hot! Share and enjoy!"
    ],
    "cooking_time": "N/A",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/beef-pares-sa-kanto/",
    "image_url": "",
    "image_path": "",
    "category": "Other Filipino Dishes"
  },
  {
    "title": "How to Cook Beef Stroganoff",
    "ingredients": [
      "▢ 1 lb. beef sirloin sliced into thin pieces",
      "▢ 1 piece onion sliced",
      "▢ 8 ounces button mushroom",
      "▢ ½ cup sour cream",
      "▢ 3 tablespoons cooking oil",
      "▢ Salt and ground black pepper to taste",
      "▢ 1 lb. egg noodles cooked according to package instructions",
      "▢ 2 tablespoons all-purpose flour",
      "▢ 2 tablespoons butter",
      "▢ 1 piece Knorr Beef Cube",
      "▢ 2 cups water"
    ],
    "instructions": [
      "Make the roux by melting butter in a saucepan. Add flour and Knorr Beef Cubes. Continuously stir while cooking for 3 to 5 minutes. Pour water into the saucepan. Stir until all ingredients are well blended. Turn the heat off. Set roux aside.",
      "On a clean pan, heat oil. Saute onion and mushroom until the onion softens.",
      "Add beef. Saute for 3 minutes or until light brown.",
      "Pour-in roux. Stir. Continue cooking in medium heat for 3 minutes. Stir the mixture once in a while.",
      "Adjust heat to low. Add sour cream and season with salt and ground black pepper.",
      "Top over egg noodles. You can also have this with rice or pasta."
    ],
    "cooking_time": "N/A",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/how-to-cook-beef-stroganoff/",
    "image_url": "",
    "image_path": "",
    "category": "Other Filipino Dishes"
  },
  {
    "title": "Making McDonalds Style Chicken Nuggets at home",
    "ingredients": [
      "▢ 1 lb. chicken breast boneless",
      "▢ 1 piece Knorr Chicken Cube",
      "▢ 1 teaspoon granulated white sugar",
      "▢ 1/2 teaspoon salt",
      "▢ 3/4 cup cornstarch",
      "▢ 1 cup water",
      "▢ 1 piece egg",
      "▢ 3/4 cup all-purpose flour",
      "▢ 1/4 cup cornstarch",
      "▢ 1 teaspoon ground white pepper",
      "▢ 1 teaspoon onion powder",
      "▢ ½ cup tomato ketchup",
      "▢ 2 tablespoons brown sugar",
      "▢ 2 tablespoons Worcestershire sauce",
      "▢ 1 tablespoon white vinegar",
      "▢ 1 teaspoon garlic powder",
      "▢ ¼ teaspoon salt"
    ],
    "instructions": [
      "Make the sauce by combining all barbecue sauce ingredients in a saucepan. Heat and let it simmer for 2 minutes. Stir and turn off the heat. Let it cool down before serving.",
      "Prepare the chicken nuggets. Cut chicken into cubes. Place in a food processor.",
      "Add Knorr Chicken Cube, sugar, and salt. Process until the texture becomes paste-like.",
      "Combine batter ingredients in a bowl. Mix well. Set aside.",
      "Heat oil to 350F.",
      "Scoop around 1 tablespoon of chicken mixture. Mold into a nugget shaped figure. You may also flatten it by covering with parchment paper and slice into individual pieces.",
      "Dredge in cornstarch and dip in batter. Let excess liquid drip.",
      "Deep-fry until the color turns golden brown. Remove from the cooking pot and place on a plate lined with paper towels.",
      "Serve with barbecue sauce. Share and enjoy!"
    ],
    "cooking_time": "N/A",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/making-mcdonalds-style-chicken-nuggets-at-home/",
    "image_url": "",
    "image_path": "",
    "category": "Chicken Dishes"
  },
  {
    "title": "How to Make Crispy Fried Chicken (Spicy Version)",
    "ingredients": [
      "▢ 2 lbs. chicken cut into serving pieces",
      "▢ 1 cup all-purpose flour",
      "▢ ¼ cup cornstarch",
      "▢ 1 teaspoon garlic powder",
      "▢ 1 teaspoon onion powder",
      "▢ ½ teaspoon ground white pepper",
      "▢ ½ teaspoon baking powder",
      "▢ 1 ½ tablespoons cayenne pepper powder",
      "▢ 2 pieces eggs",
      "▢ ½ cup water",
      "▢ 3 cups cooking oil",
      "▢ 2 cups water",
      "▢ 3 tablespoons salt",
      "▢ 3 sprigs  rosemary",
      "▢ 1 ½ cups ice cube"
    ],
    "instructions": [
      "Make the brine by boiling 2 cups water. Add salt. Stir until diluted. Add rosemary. Boil for 1 minute. Turn the heat off. Add ice cubes.",
      "Arrange chicken in a large bowl. Pour-in brine solution. Cover the bowl. Refrigerate for 8 hours.",
      "Drain the brine solution and rinse the chicken by washing with water. Pat dry using a paper towel. Set aside.",
      "Make the breading by sifting the following ingredients in a large bowl: flour, cornstarch, baking powder, garlic powder, ground white pepper, onion powder, and cayenne pepper powder. Mix well using a wire whisk. Set aside.",
      "Make the batter by whisking 2 pieces of eggs on a separate bowl. Add ½ cup water. Continue whisking until well blended.",
      "Scoop around 35% of the breading mixture to the bowl where the eggs are. Whisk until the texture becomes smooth. Set aside.",
      "Dredge the chicken pieces in the breading mixture. Dip in batter and dredge once again on the breading. Arrange on a clean plate. Set aside. We are now ready to fry.",
      "Heat 3 cups of oil in a cooking pot. Once the temperature reaches 350F, deep fry the chicken pieces for 12 to 15 minutes or until the internal temperature reaches 165F. Note: it is best to fry in batches of 2 to 3 pieces at a time.",
      "Remove the fried chicken from the pot and place on a wire rack. Let excess oil drip.",
      "Transfer to a serving plate. Serve! Share and enjoy!"
    ],
    "cooking_time": "N/A",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/how-to-make-crispy-fried-chicken-spicy-version/",
    "image_url": "",
    "image_path": "",
    "category": "Chicken Dishes"
  },
  {
    "title": "Pata Pochero",
    "ingredients": [
      "▢ 2 ½ lbs pork pata boiled for 15 minutes",
      "▢ 1 piece Chorizo de Bilbao",
      "▢ 2 pieces saba banana sliced",
      "▢ 2 pieces potato quartered",
      "▢ ½ piece cabbage quartered",
      "▢ 10 pieces long green beans",
      "▢ 1 ¼ cups garbanzos",
      "▢ 1 piece onion chopped",
      "▢ 1 piece tomato diced",
      "▢ 5 cloves garlic chopped",
      "▢ 8 ounces tomato sauce",
      "▢ 4 cups water",
      "▢ Patis and ground black pepper",
      "▢ 3 tablespoons cooking oil"
    ],
    "instructions": [
      "Heat oil in a wok. Sauté onion for 30 seconds. Add garlic. Sauté for 20 seconds, and then add tomato. Sauté until the onion softens.",
      "Add chorizo. Cook for 2 minutes.",
      "Add pata (pork leg), fish sauce, tomato sauce, and water. Let boil. Cook for 1 to 1 ½ hours between low to medium heat. Note: add water as needed.",
      "Add banana, potato, and garbanzos. Cook for 5 to 8 minutes.",
      "Season with salt and ground black pepper.",
      "Put the cabbage and long green beans into the wok. Cover and cook for 3 to 5 minutes.",
      "Add bok choy. Cook for 3 minutes.",
      "Transfer to a serving bowl. Serve with warm rice.",
      "Share and enjoy!"
    ],
    "cooking_time": "N/A",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/pata-pochero/",
    "image_url": "",
    "image_path": "",
    "category": "Pork Dishes"
  },
  {
    "title": "Pancit Batil Patung Recipe",
    "ingredients": [
      "▢ 6 oz. minced beef or carabeef",
      "▢ 12 oz. fresh Miki noodles",
      "▢ 3 to 4 oz. pork liver sliced",
      "▢ 1 medium red onion cubed",
      "▢ 1 1/2 cup mung bean sprouts",
      "▢ 3/4 cups chopped green onions",
      "▢ 1 cup shredded cabbage",
      "▢ 1 cup carrot julienne",
      "▢ 3 tablepespoons soy sauce",
      "▢ 1 egg",
      "▢ 1/4 teaspoon ground black pepper",
      "▢ 6 oz. lechon carajay chopped",
      "▢ 3 tablespoons cooking oil",
      "▢ 1 lb. beef bones with meat",
      "▢ 1 beef cube",
      "▢ 1 egg",
      "▢ 6 to 8 cups water",
      "▢ 1 stalk celery chopped",
      "▢ 1 medium carrot cubed",
      "▢ 1 small onion cubed"
    ],
    "instructions": [
      "Prepare the stock (or batil) by boiling water in a cooking pot. Add the beef bones. Let boil for 5 minutes.",
      "Hold the chopped celery, carrot, and onion together using a cheese cloth and secure using a kithen thread. This will be the mirepoix. Add the mirepoix in the cooking pot and let boil.",
      "Add the beef cube. Continue to boil in low heat for 3 hours or until the beef gets tender. You may add more water if needed. Once the stock is ready, set aside.",
      "Heat the cooking oil in a wide pan or wok. Saute the onion until soft.",
      "Add the minced beef. Saute for 3 to 5 minutes.",
      "Stir-in the sliced liver. Saute for 3 minutes.",
      "Add the mung bean sprouts, green onion, cabbage, and carrots. Continue to saute for 2 to 3 minutes.",
      "Scoop-in 4 to 5 cups of beef stock. Let boil.",
      "Push the meat and vegetables on one side of the pan. Arrange the Miki noodles on the other side. Toss the noodles while cooking. Add soy sauce and ground black pepper. cook for 2 to 3 minutes.",
      "Push the noodles on one side to create an opening. Crack one egg and gently let it slide into the broth. Poach until cooked. Remove the poached egg and set aside.",
      "Remove the noodles from the pan and arrange in a plate.",
      "Scoop out the remaining stock and place in a small sauce pan. Turn off the heat and transfer the cooked meat and vegetables in a clean plate. Set aside.",
      "Meanwhile, heat the saucepan with the stock from the pan. Once it starts to boil, crack a piece of egg and add it to the pot. Quickly stir and continue to cook while constantly stirring for 1 to 2 minutes or until an egg drop soup consistency is formed. Transfer to a bowl.",
      "Start to assemble the Pancit Batil Patung by topping the miki noodles with poached egg. Add the sautéed meat and vegetables over the egg and top with lechon carajay.",
      "Serve with a bowl of batil on the side along with a dip that consists of chopped onion, soy sauce, and vinegar.",
      "Share and enjoy!"
    ],
    "cooking_time": "1 hour",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/pancit-batil-patung-recipe/",
    "image_url": "",
    "image_path": "",
    "category": "Pork Dishes"
  }
]