[
  {
    "title": "Kinamatisang Baka",
    "ingredients": [
      "▢ 4 lbs. beef neck bone",
      "▢ 1 piece Knorr beef cube",
      "▢ 6 cups water",
      "▢ 6 pieces tomato cubed",
      "▢ 1 piece onion cubed",
      "▢ 5 cloves garlic chopped",
      "▢ 12 pieces sitaw sliced in 2-inch pieces",
      "▢ 3 cups sweet potato leaves",
      "▢ 3 tablespoons cooking oil",
      "▢ Patis and ground black pepper to taste"
    ],
    "instructions": [
      "Pour water in a cooking pot. Add beef. Let boil. Continue boiling for 60 to 890 minutes or until the meat tenderizes.",
      "Remove the beef from the pot. Set aside.",
      "Heat oil in a pan. Saute onion and garlic. Add tomato. Cook until onion and tomato softens.",
      "Put the beef neck bones into the pot. Saute for 2 minutes.",
      "Pour-in beef stock (water used to tenderize beef). Let boil.",
      "Add Knorr Beef Cube. Stir. Cook for 2 minutes.",
      "Season with patis and ground black pepper.",
      "Add sitaw. Cook for 5 minutes.",
      "Add sweet potato leaves (dahon ng kamote). Cover and cook for 2 minutes.",
      "Transfer to a serving bowl. Serve hot with rice."
    ],
    "cooking_time": "N/A",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/kinamatisang-baka/",
    "image_url": "",
    "image_path": "",
    "category": "Other Filipino Dishes"
  },
  {
    "title": "Beef Asado Recipe",
    "ingredients": [
      "▢ 3 1/2 lbs. beef chuck",
      "▢ 1 piece Knorr Beef Cube",
      "▢ 8 ounces tomato sauce",
      "▢ 3 cups water",
      "▢ 6 tablespoons soy sauce",
      "▢ 1 1/2 tablespoons white vinegar",
      "▢ 2 teaspoons whole peppercorn crushed",
      "▢ 4 pieces bay leaves dried",
      "▢ 1/2 piece lemon",
      "▢ 2 tablespoons tomato paste",
      "▢ 3 tablespoons butter",
      "▢ 1/2 cup cooking oil",
      "▢ 1 piece onion chopped",
      "▢ 4 cloves garlic chopped"
    ],
    "instructions": [
      "Combine beef, crushed peppercorn, soy sauce, vinegar, dried bay leaves, lemon, and tomato sauce. Mix well. Marinate beef or at least 30 minutes.",
      "Put the marinated beef in a cooking pot along with remaining marinade. Add water. Let boil.",
      "Add Knorr Beef Cube. Stir. Cover the pot and cook for 40 minutes in low heat.",
      "Turn the beef over. Add tomato paste. Continue cooking until beef tenderizes. Set aside.",
      "Heat oil in pan. Fry the potato until it browns. Turn over and continue frying the opposite side. Remove from the pan and place on a clean plate. Do the same with the carrots.",
      "Save 3 tablespoons of cooking oil from the pan where the potato was fried. Saute onion and garlic until onion softens.",
      "Pour-in the sauce from the beef stew. Let boil. Add the beef. Cook for 2 minutes.",
      "Add butter and let it melt. Continue cooking until the sauce reduces to half.",
      "Remove the beef from the pan. Slice into serving pieces. Arrange on a serving plate with fried potato and carrot. Top with remaining sauce.",
      "Serve warm with rice. Share and enjoy!"
    ],
    "cooking_time": "N/A",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/beef-asado/",
    "image_url": "",
    "image_path": "",
    "category": "Main Dishes"
  },
  {
    "title": "Killer Chicken Adobo",
    "ingredients": [
      "▢ 2 1/2 lbs. chicken cut into serving pieces",
      "▢ 1 piece Knorr Chicken cube",
      "▢ 2 cups lemon lime soda",
      "▢ 1/4 cup soy sauce",
      "▢ 1/2 cup white vinegar",
      "▢ 5 pieces dried bay leaves",
      "▢ 1 head garlic",
      "▢ 2 teaspoons whole peppercorn",
      "▢ 3 tablespoons cooking oil"
    ],
    "instructions": [
      "Combine chicken, soy sauce, and 1 cup lemon lime soda. Mix. Marinate for at least 30 minutes.",
      "Heat oil in a pan. Pan-fry marinated chicken for 1 minute per side. Remove from the pan. Set aside.",
      "Using the remaining oil, sauté garlic until it browns. Put the pan-fried chicken back into the pan. Add remaining marinade, lemon lime soda, whole peppercorn, and dried bay leaves. Let boil.",
      "Pour-in vinegar. Let the mixture boil. Stir.",
      "Add Knorr Chicken Cube. Cover and reduce heat between low to medium. Cook for 20 minutes.",
      "Remove the cover of the pan. Adjust heat to medium. Continue cooking while stirring every few minutes until the sauce evaporates.",
      "Transfer to a serving plate. Serve. Share and enjoy!"
    ],
    "cooking_time": "N/A",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/killer-chicken-adobo/",
    "image_url": "",
    "image_path": "",
    "category": "Chicken Dishes"
  },
  {
    "title": "Beef Nachos with Cheese Sauce Homemade",
    "ingredients": [
      "▢ 1 lb ground beef",
      "▢ 18 ounces tortilla chips",
      "▢ 1 teaspoon cumin",
      "▢ 2 teaspoons chili powder",
      "▢ 1 teaspoon garlic powder",
      "▢ 1 teaspoon onion powder",
      "▢ Salt and pepper to taste",
      "▢ 1 piece tomato chopped",
      "▢ 1 piece Serrano pepper sliced",
      "▢ 3 tablespoons cooking oil",
      "▢ 3 tablespoons butter",
      "▢ 3 tablespoons all-purpose flour",
      "▢ 2 cups fresh milk",
      "▢ 8 ounces quick melt cheese"
    ],
    "instructions": [
      "Prepare the beef by heating oil in a pan. Add beef. Cook until it turns brown while constantly stirring. Add chili powder, cumin, garlic powder, onion powder, salt, and pepper. Stir until blended. Continue cooking for 2 minutes. Set aside.",
      "Make the cheese sauce by melting butter in a cooking pot. Add flour. Continuously stir for 3 minutes. Pour-in milk. Stir until the mixture smoothens. Add cheese. Cook while stirring until the cheese melts and the mixture becomes smooth.",
      "Assemble the beef nachos by placing the tortilla chips on a serving plate. Top with beef and cheese sauce.",
      "Add chopped tomato and some sliced Jalapeno or Serrano pepper on top. Serve. Share and enjoy!"
    ],
    "cooking_time": "N/A",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/beef-nachos-with-cheese-sauce-homemade/",
    "image_url": "",
    "image_path": "",
    "category": "Other Filipino Dishes"
  },
  {
    "title": "Beef Papaitan",
    "ingredients": [
      "▢ 1 lb beef heart cubed",
      "▢ 1 lb beef small intestine cleaned",
      "▢ 1 lb beef tripe cleaned",
      "▢ 1/2 lb beef liver cubed",
      "▢ 1 lb beef kidney cubed",
      "▢ 22 grams Knorr Sinigang sa Sampaloc Mix",
      "▢ 1 piece onion chopped",
      "▢ 3 thumbs ginger minced",
      "▢ 5 cloves garlic crushed",
      "▢ 3 piece long green pepper sliced",
      "▢ 8 cups water",
      "▢ beef bile to taste",
      "▢ Salt and pepper to taste",
      "▢ 3 tablespoons cooking oil"
    ],
    "instructions": [
      "Wash beef tripe and small intestine. Boil with ginger and dried bay leaves for 45 minutes. Remove from the pot and let it cool down. Slice into bite-size pieces.",
      "Heat oil in a pan. Sauté onion, garlic, and ginger until onion softens.",
      "Add beef heart and kidney. Sauté until it turns light brown.",
      "Put the tripe and small intestines into the pot. Cook for 2 minutes.",
      "Pour water into the pot. Let is boil. Adjust heat to low. Continue boiling until beef heart and kidney tenderizes.",
      "Add beef liver and bile. Stir. Cook for 15 minutes in medium heat.",
      "Add Knorr Sinigang sa Sampaloc Recipe Mix.",
      "Put long green peppers into the pot and season with salt and ground black pepper. Stir. Cook for 2 minutes.",
      "Transfer to a serving bowl. Serve hot."
    ],
    "cooking_time": "N/A",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/beef-papaitan-pinapaitang-baka/",
    "image_url": "",
    "image_path": "",
    "category": "Seafood"
  },
  {
    "title": "Eggplant and Sardine Omelet | Tortang Talong with Sardinas",
    "ingredients": [
      "▢ 2 pieces eggplant",
      "▢ 5.5 oz. canned sardines in tomato sauce",
      "▢ 3 pieces egg",
      "▢ 1 piece tomato chopped",
      "▢ 1 piece onion chopped",
      "▢ 5 cloves garlic chopped",
      "▢ 1/2 cup green onion chopped",
      "▢ 1/4 lemon  or 1 piece calamansi",
      "▢ 1/2 cup cooking oil",
      "▢ Salt and ground black pepper to taste"
    ],
    "instructions": [
      "Prepare the sardine topping by heating oil in a pan. Sauté garlic, onion, and tomato until the last 2 ingredients softens. Add the canned sardines and a quarter of the sauce from the can. Cook for 2 minutes. Season with salt and ground black pepper. Squeeze a piece of calamansi or a quarter lemon and add some chopped green onions. Stir. Remove from the pan. Set aside.",
      "Crack the eggs into bowl. Whisk until smooth and well-blended. Set aside.",
      "Prepare the eggplant by grilling until it softens. Make sure to flip it once in a while until steam comes out from the cracks of the skin. Remove from the grill. Let It cool down. Peel the skin off.",
      "Lay a piece of eggplant on a plate. Using a fork, flatten the eggplant by sliding the fork downwards.",
      "Heat remaining oil in a clean pan.",
      "While the oil is heating-up, dip a piece of eggplant into the whisked/beaten eggs. Lay it flat on the pan. Scoop a portion of the sautéed sardines and place over the eggplant. Top with chopped green onions. Pour some beaten egg over the toppings. Continue cooking until the bottom turns golden brown.",
      "Gently flip the eggplant. Continue cooking until the bottom part is completely cooked. Remove from the pan and arrange on a serving plate. Make sure that the part with sardines is facing upwards.",
      "Serve with rice or your favorite side dish. Share and enjoy!"
    ],
    "cooking_time": "N/A",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/eggplant-and-sardine-omelet-tortang-talong-with-sardinas/",
    "image_url": "",
    "image_path": "",
    "category": "Other Filipino Dishes"
  },
  {
    "title": "Creamy Lengua with Corn",
    "ingredients": [
      "▢ 3 lbs. ox tongue",
      "▢ 1 piece Knorr Beef Cube",
      "▢ 15 ounces whole kernel corn",
      "▢ 10 ounces cream of mushroom",
      "▢ 7 ounces all-purpose cream",
      "▢ 1 piece onion chopped",
      "▢ 7 cloves garlic crushed and minced",
      "▢ 3 tablespoons butter",
      "▢ 1 1/2 cups water",
      "▢ Salt and ground black pepper to taste"
    ],
    "instructions": [
      "Combine ox tongue, 5 pieces dried bay leaves, 1 tablespoon whole peppercorn, and 6 cups water in a pressure cooker. Pressure cook for 45 minutes. Discard the water and let the ox tongue cooldown. Peel-off the outer layer. Slice tongue into serving pieces. Set aside.",
      "Melt butter in a pan. As the butter melts, add garlic. Continue to cook between low to medium heat until the garlic starts to brown.",
      "Add onion. Cook until tender.",
      "Put the ox tongue into the pan. Sauté for 2 minutes while continuously stirring.",
      "Pour water into the pan. Let boil.",
      "Add Knorr Beef Cube. Stir.",
      "Add whole kernel corn. Stir and cover the pan. Cook for 20 minutes.",
      "Pour cream of mushroom soup and all-pupose cream. Stir. Cook for 10 minutes.",
      "Season with salt and pepper. Serve. Share and enjoy!"
    ],
    "cooking_time": "N/A",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/creamy-lengua-with-corn/",
    "image_url": "",
    "image_path": "",
    "category": "Soups and Stews"
  },
  {
    "title": "Sweet and Sour Tilapia",
    "ingredients": [
      "▢ 2 pieces tilapia cleaned",
      "▢ 2 tablespoons Knorr Liquid Seasoning",
      "▢ 1 piece red bell pepper julienne",
      "▢ 1 piece green bell pepper julienne",
      "▢ 1 piece carrot julienne",
      "▢ 5 cloves garlic crushed",
      "▢ 1 piece onion sliced",
      "▢ 2 thumbs ginger julienne",
      "▢ 2 tablespoons cornstarch",
      "▢ 2 cups water",
      "▢ 5 1/2 tablespoons white vinegar",
      "▢ 8 tablespoons tomato ketchup",
      "▢ 7 tablespoons white sugar",
      "▢ 1 ¼ cup cooking oil",
      "▢ Salt and ground black pepper to taste"
    ],
    "instructions": [
      "Apply Knorr Liquid Seasoning all over the tilapia. Let it stand for 10 minutes so that the fish can absorb the flavor of the seasoning.",
      "Heat around 1 cup of cooking oil in a pan. Once the oil gets hot, fry the fish until the color turns golden brown. Flip to fry the opposite side. Remove from the pan. Place on a clean plate. Set aside.",
      "Make the sauce by heating 3 tablespoons of cooking oil in a cooking pot. Saute onion and garlic for 10 seconds. Add ginger. Saute for 12 seconds.",
      "Pour white vinegar and water. Let boil.",
      "Add tomato ketchup. Stir until it completely dilutes in the mixture.",
      "Add sugar. Stir until the sugar gets fully incorporated.",
      "Put carrots and bell peppers. Cook for 3 minutes.",
      "Combine cornstarch and 3 tablespoons water. Mix well. Pour into the cooking pot. Stir until sauce thickens.",
      "Season with salt and ground black pepper. Add a piece of tilapia and cook for 3 minutes.",
      "Transfer to a serving plate. Serve with rice. Share and enjoy!"
    ],
    "cooking_time": "N/A",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/sweet-and-sour-tilapia/",
    "image_url": "",
    "image_path": "",
    "category": "Seafood"
  },
  {
    "title": "Sweet Pata Asado",
    "ingredients": [
      "▢ 3 lbs. pork pata sliced",
      "▢ 1 piece Knorr Pork Cube",
      "▢ 3 pieces star anise",
      "▢ 3 tablespoons brown sugar",
      "▢ 1/4 cup soy sauce",
      "▢ 1 piece onion chopped",
      "▢ 4 cloves garlic crushed",
      "▢ 1 tablespoon cornstarch",
      "▢ 6 cups water",
      "▢ 3 tablespoons cooking oil",
      "▢ Salt and ground white pepper to taste"
    ],
    "instructions": [
      "Prepare the pata by boiling. Pour water in a pot. Arrange pata slices. Cover and let boil. Continue boiling for 15 minutes while scraping scums and impurities. Discard water afterwards and wash the pork pata once it cools down. Set aside.",
      "Start cooking Sweet Pata Asado by heating oil in a pan. Sauté onion and garlic until onion softens.",
      "Add pata slices. Sautee for 1 minute.",
      "Pour soy sauce and water into the pot. Add star anise. Let boil.",
      "Add Knorr Pork Cube. Stir and cover. Set the heat between low and medium. Continue boiling until pata tenderizes. Note: make sure to stir once in a while to cook the meat evenly. Note: add more water as needed.",
      "Add sugar. Stir and cook for 3 minutes.",
      "Season with ground white pepper and salt.",
      "Combine cornstarch with 3 tablespoons water. Mix well. Pour mixture into the pot. Stir and cook until sauce thickens.",
      "Transfer to a serving bowl. Serve. Share and enjoy!"
    ],
    "cooking_time": "N/A",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/sweet-pata-asado/",
    "image_url": "",
    "image_path": "",
    "category": "Main Dishes"
  },
  {
    "title": "Lumpiang Ubod",
    "ingredients": [
      "▢ 1 lb. hearts of palm ubod",
      "▢ 1 piece Knorr Shrimp Cube",
      "▢ 4 ounces pork thinly sliced",
      "▢ 12 pieces shrimp deveined",
      "▢ 1 carrot julienne",
      "▢ 2 tablespoons parsley chopped",
      "▢ 1 piece onion chopped",
      "▢ 4 cloves garlic crushed",
      "▢ 3 tablespoons cooking oil",
      "▢ Fish sauce and ground black pepper to taste",
      "▢ 8 pieces lettuce leaves",
      "▢ 1/2 cup roasted peanut crushed",
      "▢ 1 cup water",
      "▢ 1 cup all-purpose flour",
      "▢ 2 pieces eggs",
      "▢ 2 tablespoons canola oil",
      "▢ 1 1/2 cups water",
      "▢ 1/4 cup cooking oil or cooking oil spray",
      "▢ 6 tablespoons brown sugar",
      "▢ 1 1/2 tablespoons soy sauce",
      "▢ 1 1/2 cups water",
      "▢ 6 cloves garlic crushed",
      "▢ 1 tablespoon cornstarch"
    ],
    "instructions": [
      "Make the lumpia filling. Start by heating 3 tablespoons oil in a pan. Saute onion and garlic until the onion softens.1 piece onion, 3 tablespoons cooking oil, 4 cloves garlic",
      "Add pork and saute until light brown. Pour 1 ½ cup water into the pan. Let boil.4 ounces pork, 1 cup water",
      "Add Knorr Shrimp Cube. Stir. Continue boiling in medium heat until the liquid evaporates.1 piece Knorr Shrimp Cube",
      "Add hearts of palm (ubod). Cook for 5 minutes. Toss every few seconds.1 lb. hearts of palm",
      "Add carrots. Cook for 3 minutes.1 carrot",
      "Put the shrimp into the pan. Toss and continue cooking until shrimp turns orange.12 pieces shrimp",
      "Add chopped parsley and season with ground black pepper and fish sauce. Set aside.2 tablespoons parsley, Fish sauce and ground black pepper to taste",
      "Make the sauce by pouring water in a saucepan. Let it boil.1 1/2 cups water",
      "Add brown sugar and soy sauce. Stir until completely diluted.1 1/2 tablespoons soy sauce, 6 tablespoons brown sugar",
      "Put the garlic in the saucepan. Cook for 20 seconds.6 cloves garlic",
      "Combine cornstarch with 3 tablespoons water. Stir until blended. Pour the mixture into the pan. Continuously stir while cooking until mixture thickens. Set aside.1 tablespoon cornstarch",
      "Make the fresh lumpia wrapper by beating eggs in a bowl.2 pieces eggs",
      "Stir-in cooking oil and add water. Gradually add all-purpose flour. Continue stirring until all ingredients are well blended. Note: you can let the mixture pass through a strainer to filter lumps.1 cup all-purpose flour, 2 tablespoons canola oil, 1 1/2 cups water",
      "Cook the wrapper by heating a non-stick pan. Grease it with oil. Pour wrapper mixture into the pan enough to cover the area. Continue cooking using medium heat until the wrapper can freely slide on the pan when you shake it. Transfer the wrapper to a clean plate. Note: do the same step until the mixture is fully consumed.1/4 cup cooking oil or cooking oil spray",
      "Assemble the lumpiang ubod by laying a piece of wrapper flat on a plate. Place a piece of lettuce leaf  over the wrapper. Scoop a good amount of filling (hearts of palm) over the lettuce. Gently wrap.8 pieces lettuce leaves",
      "Arrange the wrapped lumpia on a serving plate. Pour sauce over it and finish by topping it with crushed peanuts.1/2 cup roasted peanut",
      "Serve. Share and enjoy!"
    ],
    "cooking_time": "N/A",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/lumpiang-ubod/",
    "image_url": "",
    "image_path": "",
    "category": "Vegetable Dishes"
  },
  {
    "title": "Spare Ribs Hamonado",
    "ingredients": [
      "▢ 2 lbs spare ribs cut into serving pieces",
      "▢ 20 oz. pineapple chunks in can",
      "▢ 2 cups beef broth",
      "▢ 1 piece onion",
      "▢ 5 cloves garlic crushed",
      "▢ 3 tablespoons soy sauce",
      "▢ 2 1/2 tablespoons brown sugar",
      "▢ 3 tablespoons cooking oil",
      "▢ Salt and ground black pepper to taste"
    ],
    "instructions": [
      "Separate pineapple juice from the chunks. Combine juice with spare ribs in a bowl. Marinate for at least 1 hour. Remove the juice afterwards and set aside.",
      "Heat oil in a pan. Saute onion and garlic until onion softens.",
      "Add marinated ribs. Saute until color turns light brown.",
      "Pour-in pineapple juice. Add soy sauce and beef broth. Stir. Let the mixture boil.",
      "Put the pineapple chunks into the pan. Cover and adjust the heat between low to medium. Cook for 1 hour.",
      "Add brown sugar and season with ground black pepper and salt. Continue cooking until sauce reduces to half.",
      "Transfer to a serving bowl. Serve with rice. Share and enjoy!"
    ],
    "cooking_time": "N/A",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/spare-ribs-hamonado/",
    "image_url": "",
    "image_path": "",
    "category": "Other Filipino Dishes"
  },
  {
    "title": "Pesang Isda with Ginisang Miso",
    "ingredients": [
      "▢ 1 piece fish cleaned",
      "▢ 7 pieces Napa cabbage leaves",
      "▢ 1 bunch bok choy",
      "▢ 1/2 cup green onion cut in 2 inch pieces",
      "▢ 1 teaspoon whole peppercorn",
      "▢ 4 thumbs ginger crushed",
      "▢ 1 piece onion wedged",
      "▢ 3 cups rice washing",
      "▢ 2 cups water",
      "▢ 3 tablespoons cooking oil",
      "▢ Fish sauce patis to taste",
      "▢ 1 cup yellow miso",
      "▢ 6 ounces firm tofu crumbled",
      "▢ 2 pieces tomato cubed",
      "▢ 1 piece onion chopped",
      "▢ 4 cloves garlic chopped",
      "▢ 1/2 cup water",
      "▢ 3 tablespoons cooking oil",
      "▢ Soy sauce and ground black pepper to taste"
    ],
    "instructions": [
      "Prepare Ginisang Miso by heating oil in a pan. Add onion. Saute for 20 seconds.",
      "Add garlic. Continue cooking for 10 seconds. Put the tomato in the pan and then saute until both tomato and onion softens.",
      "Add crumbled tofu. Stir and cook until all ingredients are well blended.",
      "Put the Miso in the pan. Saute for 2 minutes.",
      "Add soy sauce, ground black pepper, and water. Stir. Cook for 1 minute. Transfer to a serving bowl. Set aside.",
      "Start making Pesang Isda by frying the fish. Heat oil in a wok. Fry one side of the fish until it turns golden brown in color. Turn it over and do the same on the opposite side. Remove from the pan and place on a clean plate. Set aside.",
      "On a clean pan, heat oil. Saute onion and ginger. Cook until the layers of the onion separate. Add garlic. Continue cooking for 30 seconds.",
      "Pour rice washing and add whole peppercorn. Boil for 2 minutes.",
      "Add fried fish. Cook one side for 3 minutes. Turn it over and boil the opposite side for 5 minutes.",
      "Season with fish sauce and add remaining vegetables. Continue cooking for 2 minutes.",
      "Serve with Ginisang Miso. Share and enjoy!"
    ],
    "cooking_time": "N/A",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/pesang-isda-with-ginisang-miso/",
    "image_url": "",
    "image_path": "",
    "category": "Vegetable Dishes"
  }
]