[
  {
    "title": "Breakfast Sausage Hash",
    "ingredients": [
      "▢ 1 package 1 lb. frozen shredded potatoes, thawed",
      "▢ 6 pieces sausage links",
      "▢ 3 tablespoons butter",
      "▢ 1 tablespoon canola oil",
      "▢ 10 oz. salsa con queso use your favorite brand",
      "▢ 1 cup shredded cheddar cheese",
      "▢ 1 tablespoon hot sauce Cayenne pepper sauce",
      "▢ 3 tablespoons chopped green onions",
      "▢ 1 1/2 cups beef broth",
      "▢ 1/2 teaspoon salt",
      "▢ 1/2 teaspoon onion powder"
    ],
    "instructions": [
      "Heat a pan, pour-in the beef broth, bring to a boil. Add the sausage links and butter. Parboil the sausage links until the beef broth evaporates.",
      "Once the broth completely evaporates, continue to fry the sausage links using the remaining butter in low to medium heat for 5 minutes.",
      "Remove the sausage links from the pan, let it cool down. Slice into thin pieces.",
      "Combine the remaining butter and add the canola oil, apply heat. Once the mixture heats-up, put the sliced sausages in. Cook for 1 minute.",
      "Add the shredded potatoes. Stir and cook for 5 to 7 minutes.",
      "Transfer the cooked potato and sausage in a mixing bowl. Add the salsa con queso, shredded cheese, hot sauce, salt, and onion powder. Fold until the ingredients are well blended.",
      "Preheat oven to 400F. Arrange the mixture in a baking plate. Top with chopped green onions Bake for 35 minutes.",
      "Remove from the oven. Serve for breakfast.",
      "Share and enjoy!"
    ],
    "cooking_time": "1 hour",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/breakfast-sausage-hash/",
    "image_url": "",
    "image_path": "",
    "category": "Other Filipino Dishes"
  },
  {
    "title": "Baked Garlic Milkfish",
    "ingredients": [
      "▢ 1 large milkfish deboned",
      "▢ 1/2 cup chopped parsley",
      "▢ 1 head garlic crushed",
      "▢ 3 tablespoons olive oil",
      "▢ 1 teaspoon coarse sea salt",
      "▢ 1/4 teaspoon ground black pepper"
    ],
    "instructions": [
      "Combine the chopped parsley and crushed garlic in a mortar. Pound the mixture using a pestle.",
      "Add salt, ground black pepper, and olive oil. Grind the ingredients using the pestle.",
      "Arrange the milkfish in a plate in a position wherein the open cavity faces upwards. Rub the garlic and parsley mixture over the milkfish. Let it stay for 3 hours.",
      "Cut the head and tail off the milkfish. Slice into serving pieces. Arrange in a baking tray lined with aluminum foil.",
      "Preheat the oven to 370F. Once the oven gets hot, bake the milkfish for 45 minutes or until the top turns light brown.",
      "Remove from the oven and transfer to a serving plate. Serve.",
      "Share and enjoy!"
    ],
    "cooking_time": "3 hours",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/baked-garlic-milkfish/",
    "image_url": "",
    "image_path": "",
    "category": "Seafood"
  },
  {
    "title": "Ginisang Ampalaya with Shrimp (Sauteed Bitter Gourd)",
    "ingredients": [
      "▢ 1 piece ampalaya bitter gourd, cut in half lengthwise, cored, and sliced into thin pieces",
      "▢ 8 to 10 pieces shrimp",
      "▢ 2 pieces eggs beaten",
      "▢ 1 piece  tomato cut into cubes",
      "▢ 1 piece  onion sliced",
      "▢ 4 cloves garlic crushed and chopped",
      "▢ 3 tablespoons cooking oil",
      "▢ Salt and pepper to taste"
    ],
    "instructions": [
      "Combine ampalaya and 1 tablespoon salt. Mix well. Let it stay for 15 minutes. Rinse with water.",
      "Heat the cooking oil in a pan.",
      "Once the oil gets hot, add the garlic. Saute until the color turns light brown.",
      "Add the onion and tomato. Sauce until the texture turns soft.",
      "Add the shrimp. Stir and cook for 2 minutes.",
      "Stir-in the ampalaya. Cook for 3 to 5 minutes. Add salt and pepper to taste.",
      "Make extra room in the pan by pushing the mixture on the side. Pour the beaten eggs in the pan. Continue to cook the eggs while trying to stir around.",
      "Mix the cooked egg with the rest of the ingredients. Cook for a minute.",
      "Transfer to a serving plate. Serve.",
      "Share and enjoy!"
    ],
    "cooking_time": "35 minutes",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/ginisang-ampalaya-with-shrimp-sauteed-bitter-gourd/",
    "image_url": "",
    "image_path": "",
    "category": "Vegetable Dishes"
  },
  {
    "title": "Crispy Pata Sisig Recipe",
    "ingredients": [
      "▢ 1 lb. leftover crispy pata meat bone removed",
      "▢ 8 pieces spicy red chilies",
      "▢ 3 tablespoons vinegar",
      "▢ 1/2 teaspoon granulated white sugar",
      "▢ 1 1/2 teaspoons onion powder",
      "▢ 1/4 teaspoon ground black pepper",
      "▢ 1/2 teaspoon salt",
      "▢ 1 large sweet onion chopped",
      "▢ 1/2 cup chopped chicken liver",
      "▢ 3 tablespoons margarine or butter"
    ],
    "instructions": [
      "Combine the vinegar and sugar. Mix well. Arrange the pork in a bowl then pour the mixture. Let its stay for 30 minutes.",
      "Arrange the pork and chillies (with vinegar) in a food processor. Pulse until the meat and chillies are minced uniformly.",
      "Transfer the minced pork and chillies in a bowl. Set aside.",
      "Meanwhile, melt the butter or margarine in a pan. Saute the onion. Once the onion gets soft, add the chopped chicken liver. Cook for 2 minutes.",
      "Add the minced pork and chili, onion powder, ground black pepper, and salt. Cook while stirring for 8 to 10 minutes.",
      "Transfer to a serving plate. Serve.",
      "Share and enjoy!"
    ],
    "cooking_time": "50 minutes",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/crispy-pata-sisig-recipe/",
    "image_url": "",
    "image_path": "",
    "category": "Pork Dishes"
  },
  {
    "title": "Simple Recipe for Chicken Noodle Soup",
    "ingredients": [
      "▢ 1/2 roasted or rotisserie chicken",
      "▢ 2 tablespoons chopped parsley",
      "▢ 1 small sweet onion chopped",
      "▢ 1 medium carrot sliced",
      "▢ 2 cups egg white dumpling noodles flat",
      "▢ 4 cups chicken broth",
      "▢ 2 cups water",
      "▢ salt and pepper to taste"
    ],
    "instructions": [
      "Shred the meat from the chicken. Chop into smaller pieces. Set aside.",
      "Combine chicken broth and water in a cooking pot. Bring to a boil.",
      "Once the liquid starts to boil, add carrots, onion, and parsley. Cover and cook for 5 minutes.",
      "Add the chicken. Stir, cover, and cook in low to medium heat for 18 to 20 minutes.",
      "Add the flat dumpling noodles. Stir and cook for 3 minutes.",
      "Add salt and pepper to taste.",
      "Transfer to a serving bowl. Serve.",
      "Share and enjoy!"
    ],
    "cooking_time": "29 minutes",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/simple-recipe-for-chicken-noodle-soup/",
    "image_url": "",
    "image_path": "",
    "category": "Chicken Dishes"
  },
  {
    "title": "Sweet and Sour Pompano",
    "ingredients": [
      "▢ 1 large pompano innards and gills removed",
      "▢ 2 tablespoons coarse sea salt",
      "▢ 1 1/2 cups cooking oil",
      "▢ 1 1/2 to2 cups sweet and sour sauce use half the amount of this sweet and sour sauce recipe"
    ],
    "instructions": [
      "Wash the fish thoroughly in running water. Let the liquid drip.",
      "Make incisions on both sides of the fish. This will let the fish absorb the seasonings and will help it cook quicker.",
      "Rub the salt all over the fish. You can add more salt to rub in the cavity of the fish. Let it stay for 15 minutes.",
      "Meanwhile, heat the cooking oil in a wide frying pan.",
      "Once the oil gets hot, carefully lay the fish on the frying pan. Watch out for splattering oil. Fry for 8 to 10 minutes in medium heat or until the fish turns golden brown. Turn the fish over to fry the other side. Cook the opposite side for 8 minutes. If you want to prevent the oil from splattering, try this fried pompano recipe.",
      "Remove the fried fish from the frying pan and arrange in a serving plate.",
      "Top the fish with sweet and sour sauce.",
      "Serve with warm rice. Share and enjoy!"
    ],
    "cooking_time": "33 minutes",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/sweet-and-sour-pompano/",
    "image_url": "",
    "image_path": "",
    "category": "Seafood"
  },
  {
    "title": "Apple Snails in Coconut Milk (Ginataang Kuhol)",
    "ingredients": [
      "▢ 1 lb. Apple snails kohol, shell removed",
      "▢ 1 large bunch fresh spinach",
      "▢ 2 cups coconut milk",
      "▢ 6 pieces red chillies",
      "▢ 1 medium onion sliced",
      "▢ 4 cloves garlic crushed and chopped",
      "▢ 2 thumbs ginger sliced",
      "▢ 1/4 cup shrimp paste",
      "▢ 1/4 teaspoon ground black pepper",
      "▢ 3 tablespoons cooking oil"
    ],
    "instructions": [
      "Heat the cooking oil in a cooking pot.",
      "Once the oil gets hot, saute the garlic and onion. Add the ginger and continue to cook for 1 to 2 minutes.",
      "Put the apple snails in the cooking pot. Stir and cook for 2 minutes.",
      "Add the shrimp paste and chillies. Stir.",
      "Pour-in the coconut milk. Let boil. Cover and simmer for 30 minutes.",
      "Add the ground black pepper and spinach. Stir and cook for 5 minutes without covering.",
      "Transfer to a serving bowl. Serve for pulutan or as a main dish with warm white rice. Share and enjoy!"
    ],
    "cooking_time": "45 minutes",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/apple-snails-in-coconut-milk-ginataang-kuhol/",
    "image_url": "",
    "image_path": "",
    "category": "Other Filipino Dishes"
  },
  {
    "title": "Hashbrown Casserole",
    "ingredients": [
      "▢ 1 lb. package shredded hashbrown potato",
      "▢ 5 oz. half a can cream of chicken",
      "▢ 1 cup shredded sharp cheddar cheese",
      "▢ 1/4 cup melted butter",
      "▢ 1 tablespoon cooking oil",
      "▢ 1 1/2 cup sour cream",
      "▢ 1 medium yellow onion chopped",
      "▢ 1/2 teaspoon salt",
      "▢ A dash of ground black pepper"
    ],
    "instructions": [
      "Preheat oven to 350F.",
      "Heat the cooking oil in a pan. Once the oil gets hot, add the onion. Continue to cook the onion in medium heat while stirring until caramelized.",
      "Meanwhile, combine shredded hash brown, cream of chicken, butter, cheese, salt, and pepper.",
      "",
      "Add sour cream and caramelized onion.",
      "Mix well then arrange in a baking pan.",
      "Bake for 35 minutes.",
      "Remove from the oven and it cool down. Serve. Share and enjoy!"
    ],
    "cooking_time": "45 minutes",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/hashbrown-casserole/",
    "image_url": "",
    "image_path": "",
    "category": "Chicken Dishes"
  },
  {
    "title": "Huevos Rancheros",
    "ingredients": [
      "▢ 1 can 14.5 oz. fire roasted tomato",
      "▢ 1/4 cup Chipotle Pepper in Adobo Sauce chopped",
      "▢ 1/4 cup Cilantro",
      "▢ 6 small flour tortillas",
      "▢ 1 medium Spanish onion diced",
      "▢ 3 eggs",
      "▢ 1 banana pepper chopped",
      "▢ Salt and pepper to taste",
      "▢ 3 tablespoons cooking oil"
    ],
    "instructions": [
      "Prepare the salsa by heating 2 tablespoons of cooking oil in a pan. Saute the onion until it becomes soft. Add the diced tomatoes, add the chipotle pepper, and banana pepper. Cook for 3 to 5 minutes. Add salt and pepper to taste.",
      "Cook the eggs. I prefer either sunny side up or ever easy. Set Aside.",
      "Heat a clean frying pan. Once the pan starts to heat-up, lay a corn tortilla flat over the pan and continue to heat up (using medium heat) for 2 minutes per side.",
      "Arrange the warm tortillas on a serving plate. Top with fried egg and salsa. Garnish with cilantro.",
      "Serve. Share and enjoy!"
    ],
    "cooking_time": "15 minutes",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/huevos-rancheros/",
    "image_url": "",
    "image_path": "",
    "category": "Chicken Dishes"
  },
  {
    "title": "Beef and Mushroom Braised Stew",
    "ingredients": [
      "▢ 2 lbs. beef sirloin or chuck cut into cubes",
      "▢ 1 1/2 teaspoons sea salt",
      "▢ 1/4 teaspoon ground black pepper",
      "▢ 1/4 cup butter",
      "▢ 2 lbs. chopped white mushrooms",
      "▢ 1 medium yellow onion chopped",
      "▢ 5 cloves garlic crushed",
      "▢ 1/4 cup tomato paste",
      "▢ 1 can 10 oz. cream of mushroom",
      "▢ 4 cups beef broth",
      "▢ 2 teaspoons dried parsley flakes",
      "▢ 1/2 teaspoon dried oregano"
    ],
    "instructions": [
      "Rub salt and ground black pepper on the beef. Let it stay for 10 minutes.",
      "Melt 1 tablespoon butter in a Dutch oven or cooking pot. Put the beef in and cook for 3 to 5 minutes or until the color turns light brown.",
      "Remove the beef. Set Aside. Melt the remaining butter in the same cooking pot.",
      "Once the butter melts, saute the mushrooms, onions, and garlic. Continue to cook until the mushrooms become soft.",
      "Add the beef. Cook for 2 minutes.",
      "Add the tomato paste, parsley, oregano, and beef broth. Stir and let boil. Cover and simmer 60 min.",
      "Add the cream of mushroom. Stir and cook for 2 to 3 minutes.",
      "Turn the heat off. Transfer to a serving plate. Share and enjoy!"
    ],
    "cooking_time": "1 hour",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/beef-and-mushroom-braised-stew/",
    "image_url": "",
    "image_path": "",
    "category": "Other Filipino Dishes"
  },
  {
    "title": "Oven Baked Crispy Pata Recipe",
    "ingredients": [
      "▢ 1 piece 3 to 4 lbs. pig leg",
      "▢ 1 teaspoon whole cloves",
      "▢ 12 pieces dried bay leaves",
      "▢ 2 pieces cinnamon sticks",
      "▢ 6 cloves garlic crushed",
      "▢ 1 tablespoon onion powder",
      "▢ 4 tablespoons cooking oil or cooking oil spray",
      "▢ 8 cups water"
    ],
    "instructions": [
      "Preheat oven to 350F.",
      "Meanwhile, arrange the pork leg in a baking tray lined with aluminum foil. Coat the leg with cooking oil either by rubbing with cooking oil or using the cooking oil spray such as Pam.",
      "Bake in the oven for 30 minutes.",
      "Remove the pork from the oven. Let it cool down.",
      "Arrange the pork (pig leg) in a wide cooking pot or Dutch oven. Pour-in water. Let boil.",
      "Once the water starts to boil, add the onion powder, garlic, bay leaves, cinnamon sticks, and cloves. Cover and simmer for 45 minutes.",
      "Remove the pork from the cooking pot. Let the liquid drip while the meat cools down. Make incisions on the pig leg so that seasonings (such as salt and pepper) can easily penetrate and gets absorbed. It will also help the inner part of the leg cook faster.",
      "Arrange the pig leg on the same baking tray. rub salt and pepper all over the leg. Spray with cooking oil all over.",
      "Bake in the oven at 350F for 150 to 180 minutes."
    ],
    "cooking_time": "4 hours",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/oven-baked-crispy-pata-recipe/",
    "image_url": "",
    "image_path": "",
    "category": "Pork Dishes"
  },
  {
    "title": "Sweet and Sour Chicken Nuggets",
    "ingredients": [
      "▢ 1/2 lb. chicken nuggets cooked",
      "▢ 1 1/2 cup sweet and sour sauce use half of the amount in the recipe link",
      "▢ 1 tablespoon chopped curly parsley for garnish"
    ],
    "instructions": [
      "Make the chicken nuggets by following the recipe on the link in the ingredients section. Set Aside.",
      "Make the sweet and sour sauce by following the sweet and sour sauce recipe link in the ingredients section. Make half amount of what is written in the recipe.",
      "Arrange the chicken nuggets in a serving plate. Pour the sweet and sour sauce over the chicken nuggets. Garnish with chopped parsley.",
      "Serve. Share and enjoy!"
    ],
    "cooking_time": "50 minutes",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/sweet-and-sour-chicken-nuggets/",
    "image_url": "",
    "image_path": "",
    "category": "Chicken Dishes"
  }
]