[
  {
    "title": "Sushi Bake Recipe",
    "ingredients": [
      "▢ 4 cups cooked white rice",
      "▢ 3 tablespoons rice vinegar",
      "▢ 2 teaspoons granulated sugar",
      "▢ 1 teaspoon salt",
      "▢ 1/2 cup cream cheese softened",
      "▢ 2 tablespoons sour cream. optional",
      "▢ 1/2 cup Lady’s Choice Mayonnaise",
      "▢ 6 ounces Kani (imitation crab meat) chopped",
      "▢ 1/4 cup cucumber diced into small pieces",
      "▢ 5 Tablespoons Furikake",
      "▢ 3 tablespoons masago fish roe, optional",
      "▢ 5 Tablespoons Lady’s Choice Mayonnaise",
      "▢ 1 Tablespoons Sriracha sauce",
      "▢ 1 avocado sliced"
    ],
    "instructions": [
      "Preheat the oven to 400F.",
      "Combine rice vinegar, sugar, and salt in a bowl. Pop in the microwave for 15 seconds. Stir until the vinegar completely dilutes.",
      "Put the cooked rice in a large bowl. Combine with the vinegar mixture. Gently toss until the rice gets coated completely.",
      "Spread the rice mixture evenly in a baking dish. Lightly top with furikake. Set aside.",
      "Make the creamy topping by combining all the cream topping ingredients in a bowl. Mix well. Spread over the rice.",
      "Top with remaining furikake. Bake for 18 minutes.",
      "Make the sriracha mayo topping by combining 5 Tablespoons of Lady’s Choice Mayonnaise with 1 Tablespoon sriracha sauce. Mix well and then transfer into a condiment squeeze bottle. Set aside.",
      "Remove the sushi bake from the oven. Top it with masago and avocado slices. Drizzle sriracha mayonnaise on top.",
      "Slice a portion of the sushi bake and place over a small piece of Nori sheet. Serve. Share and enjoy!"
    ],
    "cooking_time": "N/A",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/sushi-bake-recipe/",
    "image_url": "",
    "image_path": "",
    "category": "Seafood"
  },
  {
    "title": "Chicknigang Recipe",
    "ingredients": [
      "▢ 3 cloves garlic chopped",
      "▢ 1 onion chopped",
      "▢ 1 thumb  ginger crushed",
      "▢ 2 lbs. chicken cut into serving pieces",
      "▢ 1 quart water",
      "▢ 1 cup daikon radish labanos, wedged",
      "▢ 22 grams Knorr Sinigang sa Sampaloc Mix",
      "▢ 2 tomatoes halved",
      "▢ 2 long green pepper",
      "▢ 5 okras",
      "▢ 12 string beans cut into 2-inch pieces",
      "▢ 1 cup spinach",
      "▢ 1/2 teaspoon ground black pepper",
      "▢ 2 teaspoons fish sauce",
      "▢ 3 tablespoons cooking oil"
    ],
    "instructions": [
      "Heat cooking oil in a pot. Saute garlic, onion, and ginger.",
      "Add the chicken once the onion softens. Cook one side for 2 minutes. Turn it over and do the same on the opposite side.",
      "Pour water. Let boil.",
      "Add daikon radish and Knorr Sinigang sa Sampaloc Mix. Cover the pot and continue cooking using low to medium heat for 35 minutes.",
      "Add tomato, long green pepper, okra, and string beans. Cook for 8 to 12 minutes.",
      "Season with ground black pepper and fish sauce.",
      "Add spinach. Cook for 1 minute.",
      "Transfer to a serving bowl.",
      "Serve hot. Share and enjoy!"
    ],
    "cooking_time": "N/A",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/chicknigang-recipe/",
    "image_url": "",
    "image_path": "",
    "category": "Seafood"
  },
  {
    "title": "Tochong Bangus Recipe",
    "ingredients": [
      "▢ 1 bangus cleaned and sliced diagonally into pieces",
      "▢ 6 ounces tofu fried",
      "▢ 3 ounces tahure fermented bean curd, mashed",
      "▢ 2 Tablespoons tausi salted black beans",
      "▢ 4  tomatoes diced",
      "▢ 1 thumb ginger Julienne",
      "▢ 1 onion chopped",
      "▢ 3 cloves garlic crushed",
      "▢ 2 teaspoons white vinegar",
      "▢ 1 cup water",
      "▢ 1 cup cooking oil",
      "▢ 1 teaspoon sugar optional",
      "▢ Salt and ground black pepper to taste"
    ],
    "instructions": [
      "Rub salt all over the fish. Let it stay for 10 minutes.",
      "Heat oil in a pan. Fry both sides of the fish until the color turns light to medium brown. Remove fish from the pan and place on a clean plate. Set aside.",
      "Make the tocho sauce by heating 3 Tablespoons of cooking oil in a clean pan. Sauté garlic, onion, ginger, and tomato.",
      "Once the onion softens, add vinegar, tahure and tausi. Cook for 30 seconds.",
      "Pour water into the pan. Let boil. Cook in a low heat setting for 3 minutes.",
      "Add fried fish and fried tofu in the pan. Cover and continue cooking for 8 to 10 minutes. Note: add water as needed.",
      "Season with salt, ground black pepper, and sugar. Serve with warm rice. Share and enjoy!"
    ],
    "cooking_time": "N/A",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/tochong-bangus-recipe/",
    "image_url": "",
    "image_path": "",
    "category": "Seafood"
  },
  {
    "title": "Arroz Caldo Recipe",
    "ingredients": [
      "▢ 1 ½ lbs chicken cut into serving pieces",
      "▢ 1 ½ cups rice uncooked",
      "▢ 34 ounces water about 1 liter",
      "▢ 2 Tablespoons fish sauce",
      "▢ 1 teaspoon garlic",
      "▢ 1/4 teaspoon ground black pepper",
      "▢ 1 cup onion minced",
      "▢ 4 eggs hard boiled",
      "▢ 1 cup scallions green onions, minced",
      "▢ 2 knobs ginger julienned",
      "▢ 3 tbsp safflower kasubha",
      "▢ 1 chicken cube bouillon",
      "▢ 1 lemon or 4 pieces calamansi",
      "▢ 2 Tablespoon cooking oil"
    ],
    "instructions": [
      "In a pot, heat the cooking oil then saute the garlic, onion, and ginger",
      "Dash-in some ground black pepper",
      "Add the chicken cube and cook until the cube melts",
      "Put-in the chicken and cook until outer layer color turns golden brown",
      "Add the fish sauce and uncooked rice then mix and cook for a few minutes",
      "Pour-in the water and bring to a boil",
      "Stir occasionally and simmer until the rice is fully cooked (about 30 to 40 minutes)",
      "Put-in the hard boiled eggs",
      "Add the safflower for additional color and aroma",
      "Serve hot with garlic, minced scallions, and lemon. Share and Enjoy!"
    ],
    "cooking_time": "55 minutes",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/arroz-caldo/",
    "image_url": "",
    "image_path": "",
    "category": "Rice Dishes"
  },
  {
    "title": "Pinapaitan sa Ampalaya",
    "ingredients": [
      "▢ 2 bitter melons",
      "▢ 10 ounces beef tripe boiled and chopped",
      "▢ 10 ounces beef heart boiled and chopped",
      "▢ 4 ounces pork liver sliced",
      "▢ 12 ounces beef small intestine boiled and chopped",
      "▢ 5 chili pepper",
      "▢ 5 kamias bilimbi",
      "▢ 1 onion minced",
      "▢ 3 thumbs ginger minced",
      "▢ 5 cloves garlic minced",
      "▢ 5 tablespoons white vinegar",
      "▢ 6 cups water",
      "▢ 3 tablespoons cooking oil",
      "▢ Fish sauce and ground black pepper to taste"
    ],
    "instructions": [
      "Prepare the bitter melons by removing the seeds. Chop the veggies into small pieces. Note: you can also use a food processor for best results.",
      "Boil water in a cooking pot. Add chopped bitter melons. Boil for 3 minutes. Set aside.",
      "Heat oil in a clean wok or pan. Sauté garlic, onion, and ginger.",
      "Once the onion softens, add the beef tripe, beef heart, and small intestine. Cook for 5 to 7 minutes.",
      "Add liver. Cook for 1 minute.",
      "Pour vinegar into the wok. Let the mixture boil.",
      "Pour the water used to boil the bitter melons while straining. Cover and let the liquid boil. Set the heat to low. Continue boiling until all the ingredients gets tender.",
      "Add kamias and chili peppers. Cook for 15 minutes.",
      "Season with fish sauce and ground black pepper. Serve hot. Share and enjoy!"
    ],
    "cooking_time": "N/A",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/pinapaitan-sa-ampalaya/",
    "image_url": "",
    "image_path": "",
    "category": "Pork Dishes"
  },
  {
    "title": "Crispy Bagnet",
    "ingredients": [
      "▢ 3 lbs. pork belly",
      "▢ 2 tablespoons white vinegar",
      "▢ 2 tablespoons salt",
      "▢ 2 bunches  lemongrass",
      "▢ 1 tablespoon whole peppercorn",
      "▢ 1 onion",
      "▢ 8 cups water",
      "▢ 6 cloves garlic",
      "▢ 3 laurel leaves",
      "▢ 6 cups cooking oil"
    ],
    "instructions": [
      "Preheat oven to 175F.",
      "Pour water into a pressure cooker. Add lemongrass, salt, whole peppercorn, and onion. Let boil.",
      "Add pork belly. Boil for 3 minutes. Cover the pressure cooker. Cook for 15 minutes.",
      "Let the pressure out completely Put the pork belly on a clean plate and let it cool-down for 10 minutes. Season the meat part with salt and ground black pepper. Turn it upside down and season the skin part with salt.",
      "Wrap the sides of the pork with an aluminum foil and then rub vinegar on the skin part.",
      "Bake it for 2 ½ hours to dehydrate the skin.",
      "Remove the pork from the oven. Set aside.",
      "Heat oil in a wide wok. Once the oil gets hot, add garlic and laurel leaves. Cook until the garlic floats. Remove the garlic and leaves afterwards using a strainer.",
      "Arrange a slab of pork belly over a skimmer. Pour hot oil over it using a ladle. Do this step until a crackling texture is formed on the skin. Perform the same steps until all the pork are done.",
      "Arrange on a serving plate. Serve with your favorite dipping sauce. Share and enjoy!"
    ],
    "cooking_time": "N/A",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/crispy-bagnet/",
    "image_url": "",
    "image_path": "",
    "category": "Pork Dishes"
  },
  {
    "title": "Homemade Lechon Paksiw Sauce",
    "ingredients": [
      "▢ 2 ½ lbs. roasted pork preferably leftovers",
      "▢ 3 laurel leaves",
      "▢ Salt to taste",
      "▢ 5 ounces pork liver sliced",
      "▢ 1 Knorr Pork cube",
      "▢ 5 tablespoons white vinegar",
      "▢ 7 tablespoons dark brown sugar",
      "▢ ½ teaspoon ground black pepper",
      "▢ 1 onion chopped",
      "▢ 1 head garlic crushed",
      "▢ 2 ½ cups water",
      "▢ 1 tablespoon soy sauce",
      "▢ 3 Tablespoons breadcrumbs",
      "▢ 3 tablespoons cooking oil"
    ],
    "instructions": [
      "Heat oil in a pan. Add the pork liver. Fry until color turns brown.",
      "Remove the liver from the pot and place inside the blender. Add water. Puree the mixture. Set aside.",
      "Using the remaining oil, sauté garlic and onion until the latter softens.",
      "Pour the liver puree. Let boil.",
      "Add Knorr Pork Cube, soy sauce, vinegar, and ground black pepper. Let the mixture boil. Stir.",
      "Add brown sugar and breadcrumbs. Turn the heat off and pour the entire mixture back into the blender. Puree for 1 minute.",
      "Pour the puree back into the cooking pot. Let it boil.",
      "Add laurel leaves and roasted pork. Cover the pan. Continue cooking in a low heat setting for 40 minutes.",
      "Season with salt as needed.",
      "Transfer to a serving bowl. Serve warm. Share and enjoy with rice."
    ],
    "cooking_time": "N/A",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/homemade-lechon-paksiw-sauce/",
    "image_url": "",
    "image_path": "",
    "category": "Pork Dishes"
  },
  {
    "title": "Coconut Shrimp",
    "ingredients": [
      "▢ 1 lb. large shrimp cleaned and shell removed",
      "▢ 1 cup bread crumbs",
      "▢ 1 cup sweetened desiccated coconut",
      "▢ Salt and ground black pepper to taste",
      "▢ ½ cup all-purpose flour",
      "▢ 1 cup cooking oil",
      "▢ 1 egg",
      "▢ 1 cup all-purpose flour",
      "▢ 1 cup fresh milk",
      "▢ 1 teaspoon baking powder",
      "▢ ½ teaspoon salt",
      "▢ 2 teaspoons minced garlic",
      "▢ ¾ cup rice vinegar",
      "▢ ¾ cup sugar",
      "▢ 1 piece Thai chili pepper",
      "▢ ¾ cup water",
      "▢ 1 teaspoon ketchup",
      "▢ 2 teaspoons cornstarch",
      "▢ Salt to taste"
    ],
    "instructions": [
      "Make the Sweet chili sauce by combining Good Life Minced Garlic, Thai chili pepper, and water in a food processor or blender. Blitz for 10 seconds. Set aside.",
      "Pour vinegar in a saucepan. Let boil.",
      "Pour the garlic, chili, and water mixture. Stir and cook for 2 minutes.",
      "Add sugar. Stir until sugar dilutes completely. Season with salt and add ketchup.",
      "Combine cornstarch and 1 ½ tablespoons of water. Stir until a slurry is formed. Pour the slurry into the saucepan. Stir right away. Continue cooking in medium heat while stirring until the sauce thickens to your desired consistency. Set the sauce aside.",
      "Prepare the shrimp by seasoning with salt and ground black pepper. Let it stay for 5 minutes.",
      "Make the batter by combining all batter ingredients in a bowl. Stir until the mixture smoothens. Set aside.",
      "Combine Good Life Bread Crumbs and desiccated coconut in a bowl. Mix well. Set aside.",
      "Dredge shrimp in flour one piece at a time. Dip it in the batter afterwards. Let the excess batter drip. Roll it next in bread crumb and desiccated coconut mixture. Arrange the coated shrimp on a clean plate. Note: Make sure that both sides get coated completely. Perform this step until all the shrimp are coated.",
      "Heat oil in a pan. Fry the coconut shrimp by batch. You can flip the shrimp multiple times while frying until both sides turn golden brown in color.",
      "Place the coconut shrimp on a plate lined with a paper towel after frying.",
      "Arrange on a serving plate and serve with sweet chili sauce.",
      "Share and enjoy!"
    ],
    "cooking_time": "N/A",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/coconut-shrimp/",
    "image_url": "",
    "image_path": "",
    "category": "Other Filipino Dishes"
  },
  {
    "title": "Creamy Pasta Carbonara",
    "ingredients": [
      "▢ 1 lb. fettuccine",
      "▢ 5 strips  bacon chopped",
      "▢ 68 grams Knorr Cream of Mushroom",
      "▢ 1 cup heavy cream",
      "▢ 2 tablespoons Parmesan cheese",
      "▢ 4.5 ounces button mushroom sliced",
      "▢ 2 cups water",
      "▢ 1 tablespoon butter"
    ],
    "instructions": [
      "Cook fettuccine according to package instructions. Set aside.",
      "Make the creamy pasta sauce by mixing Knorr Cream of Mushroom and water. Stir until completely diluted. Set aside.",
      "Heat a pan and add chopped bacon. Cook until the bacon becomes crispy.",
      "Add butter. Let it melt and then add mushrooms. Cook for 1 minute.",
      "Pour cream of mushroom mixture into the pan. Stir and continue cooking until the sauce thickens.",
      "Add heavy cream and Parmesan cheese. Stir.",
      "Combine the cooked fettuccine with the pasta sauce. Toss until the pasta gets coated completely.",
      "Transfer to a serving plate. Serve and enjoy!"
    ],
    "cooking_time": "N/A",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/creamy-pasta-carbonara/",
    "image_url": "",
    "image_path": "",
    "category": "Other Filipino Dishes"
  },
  {
    "title": "Improved KFC Fried Chicken Recipe",
    "ingredients": [
      "▢ 3 lbs chicken cut into pieces",
      "▢ 4 cups cooking oil",
      "▢ 2 cups buttermilk",
      "▢ 2 tablespoons Knorr Liquid Seasoning",
      "▢ 2 cups all-purpose flour",
      "▢ ½ teaspoon salt",
      "▢ ½ teaspoon thyme",
      "▢ ½ teaspoon basil",
      "▢ 1/3 teaspoon oregano",
      "▢ 1 teaspoon celery salt",
      "▢ 1 teaspoon ground black pepper",
      "▢ 1 teaspoon dried mustard",
      "▢ 4 teaspoons paprika",
      "▢ 2 teaspoons garlic salt",
      "▢ 1 teaspoon ground ginger",
      "▢ 3 teaspoons white pepper"
    ],
    "instructions": [
      "Combine Knorr Liquid Seasoning and buttermilk in a large bowl. Mix well.",
      "Add chicken pieces. Marinate for at least 3 hours.",
      "Combine the breading ingredients in a separate bowl. Mix well.",
      "Remove the chicken from the marinade bowl letting excess liquid drip. Dredge the chicken pieces into the breading mixture making sure that each piece is completely coated. Let it stay for at least 5 minutes.",
      "Heat cooking oil in a deep cooking pot (Note: I cooked mine using a pressure cooker. This is called pressure frying). Deep fry the chicken pieces until the internal temperature reads 165F. Note: You may decide to pressure fry the chicken but be extra careful. If doing so, make sure that the oil is more than 350F before adding the chicken. Deep fry for 1 minute uncovered before sealing the pressure cooker. Pressure-cook at not more than 350F between 7 to 8 minutes only (do not cook it longer). Release the pressure from the cooker and remove the chicken.",
      "Arrange the fried chicken on a wire rack for the oil to drip. Serve with chicken gravy and your favorite sides. Share and enjoy!"
    ],
    "cooking_time": "N/A",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/improved-kfc-fried-chicken-recipe/",
    "image_url": "",
    "image_path": "",
    "category": "Chicken Dishes"
  },
  {
    "title": "Hardinera (Jardinera) Recipe",
    "ingredients": [
      "▢ 2 tablespoons cooking oil",
      "▢ 1 medium sized onion diced",
      "▢ 3 cloves garlic minced",
      "▢ 1 lb pork diced",
      "▢ 1 cup water",
      "▢ 1/2 cup tomato sauce",
      "▢ 1/4 cup sweet pickle relish",
      "▢ 1/2 cup beef franks or hotdogs diced",
      "▢ 1/4 cup raisins",
      "▢ 1/2 teaspoon salt",
      "▢ 1/2 teaspoon ground black pepper",
      "▢ 1/2 beef cube",
      "▢ 1/2 cup pineapple chunks",
      "▢ 1/4 cup roasted sweet pepper",
      "▢ 1/4 cup liver spread",
      "▢ 1/4 cup cheese grated",
      "▢ 1/2 cup bread crumbs",
      "▢ 2 eggs hard boiled, sliced or wedged",
      "▢ 2 eggs raw"
    ],
    "instructions": [
      "In a cooking pot, add cooking oil and sauté garlic and onions.",
      "Add the diced pork and cook for 3 to 5 minutes.",
      "Put-in the beef cube, water, and tomato sauce then bring to a boil. Simmer until the pork is tender and the liquid completely evaporates. Set aside and let cool.",
      "In a large mixing bowl, combine the cooked pork, salt, ground black pepper, beef franks, bread crumbs, liver spread, sweet pickle relish, pineapple chunks, raisins, and cheese.",
      "Mix all the ingredients until everything is well incorporated.",
      "Grease a llanera and arrange the sliced eggs and roasted sweet pepper.",
      "Pour close to half of the beaten egg mixture and ensure that the eggs are well distributed on the llanera.",
      "Scoop the pork mixture in to the llanera until it occupies at least 3/4 of the total volume.",
      "Cover the whole llanera with aluminum foil.",
      "Pour at least 6 cups of water in the steamer. Arrange the containers in the steamer and steam for 50 minutes.",
      "Remove the steamed mixture from the llanera and transfer to a serving plate.",
      "Serve either hot or cold. Share and enjoy!"
    ],
    "cooking_time": "1 hour",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/hardinera/",
    "image_url": "",
    "image_path": "",
    "category": "Pork Dishes"
  },
  {
    "title": "Beef Caldereta Recipe",
    "ingredients": [
      "▢ 4 lbs beef short ribs",
      "▢ 1 Knorr Beef Cube",
      "▢ 14 ounces tomato sauce",
      "▢ 1 cup red wine",
      "▢ 2 large potato cubed",
      "▢ 1 large carrot cubed",
      "▢ 1 cup manzanilla olives",
      "▢ 2 bell pepper sliced",
      "▢ 4 sprigs thyme",
      "▢ 2 large onion chopped",
      "▢ 1 head garlic chopped",
      "▢ 3 tablespoons soy sauce",
      "▢ ½ cup liver spread",
      "▢ 1 cup water",
      "▢ ¼ cup extra virgin olive oil",
      "▢ Salt and ground black pepper to taste"
    ],
    "instructions": [
      "Heat oil in a pot. Fry the carrots for 2 minutes. Make sure that all sides are cooked equally. Remove from the pot. Set aside.",
      "Fry the potato until the color of the outer part turns light brown. Remove from the pot and set aside.",
      "Using the remaining oil, sauté garlic, onion, and thyme. Continue sautéing until the onion caramelizes.",
      "Add beef short ribs. Cook until the color of the outer part turns light brown.",
      "Pour tomato sauce and red wine. Add Knorr Beef Cube.",
      "Add soy sauce and water. Cover the pot. Continue cooking the stew in low heat setting until the beef tenderizes completely.",
      "Add liver spread and bell pepper. Cook for 3 minutes.",
      "Add carrot and potato. Cook for 3 minutes.",
      "Add cheddar cheese and then season with salt and ground black pepper.",
      "Transfer to a serving plate. Serve. Share and enjoy!"
    ],
    "cooking_time": "N/A",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/beef-caldereta-recipe/",
    "image_url": "",
    "image_path": "",
    "category": "Other Filipino Dishes"
  }
]