[
  {
    "title": "Poached Tilapia in Sour Broth",
    "ingredients": [
      "▢ 4 tilapia fillet",
      "▢ 2 ripe plum tomato wedged",
      "▢ 1 bunch scallions chopped",
      "▢ 4 cups water",
      "▢ 4 pieces unripe tamarind or kamias",
      "▢ 3 pieces log green pepper",
      "▢ Salt to taste"
    ],
    "instructions": [
      "Pour water in a cooking pot. Bring to a simmer.",
      "Add the tomato, tamarind, and scallions. Cover and continue to simmer for 35 minutes.",
      "Squeeze the tamarind and discard the pulp.",
      "Remove the tomato and scallions. Set aside.",
      "Add the tilapia fillet. Poach the fish for 6 to 8 minutes.",
      "Add the green pepper and some salt to taste.Simmer for 3 minutes.",
      "Arrange the fish in a serving bowl. Add the tomato and scallions.",
      "Serve. Share and enjoy!"
    ],
    "cooking_time": "50 minutes",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/poached-tilapia-in-sour-broth/",
    "image_url": "",
    "image_path": "",
    "category": "Seafood"
  },
  {
    "title": "Sauteed Chayote with Pork and Tomato",
    "ingredients": [
      "▢ 2 chayote peeled and sliced",
      "▢ 3 ounces pork sliced into thin pieces",
      "▢ 1 medium plum tomato cubed",
      "▢ 1 medium yellow onion sliced",
      "▢ 3 cloves garlic crushed",
      "▢ 1 1/2 cup chicken broth or beef broth",
      "▢ 3 tablespoons cooking oil",
      "▢ Salt and pepper to taste"
    ],
    "instructions": [
      "Heat the oil in a cooking pot.",
      "Saute garlic, onion, and tomato",
      "Once the onion gets soft, add the pork slices. Continue to cook for 3 to 4 minutes.",
      "Pour 1/2 cup chicken broth. Let boil. Continue to cook until the liquid evaporates (this will help tenderize the pork).",
      "Add the chayote. Saute for 3 minutes.",
      "Pour the remaining broth. Continue to cook until the liquid reduces based on your preference.",
      "Add salt and ground black pepper to taste.",
      "Transfer to a serving plate. Serve.",
      "Share and enjoy!"
    ],
    "cooking_time": "25 minutes",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/sauteed-chayote-with-pork-and-tomato/",
    "image_url": "",
    "image_path": "",
    "category": "Pork Dishes"
  },
  {
    "title": "Filipino Beef Morcon with Garlic Fried Rice and Eggs",
    "ingredients": [
      "▢ 1 lb. leftover classic beef morcon view recipe",
      "▢ 3 cups garlic fried rice view recipe",
      "▢ 6 fried eggs cooked the way you want (see ways on how to cook eggs)"
    ],
    "instructions": [
      "Prepare your meal by slicing the leftover morcon. Note: you may also cook the morcon from scratch using the recipe above if there are no leftovers.",
      "Prepare the garlic fried rice. The link for the recipe can be found in the ingredient section above. Once the rice is cooked, set it aside.",
      "Fry the eggs based on how you want it. Sunny-side-up is a good way to cook it.",
      "Arrange a cup of garlic fried rice in the middle of a plate. Add 2 pieces of fried eggs on the side and arrange the beef morcon on the other side.",
      "Serve hot for breakfast. Share and enjoy!"
    ],
    "cooking_time": "25 minutes",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/filipino-beef-morcon-with-garlic-fried-rice-and-eggs/",
    "image_url": "",
    "image_path": "",
    "category": "Other Filipino Dishes"
  },
  {
    "title": "Dinaldalem Recipe (Igado – Liver and Pork Adobo)",
    "ingredients": [
      "▢ ½ lb. pork shoulder sliced into thin strips",
      "▢ ¾ lb. pig’s liver sliced into strips",
      "▢ 1 16 oz. can chickpeas (garbanzos)",
      "▢ 4 pieces dried bay leaves",
      "▢ 1 medium bell pepper sliced into strips",
      "▢ 1 medium onion diced",
      "▢ 4 cloves garlic crushed",
      "▢ 4 tablespoons soy sauce",
      "▢ 3 tablespoons white vinegar",
      "▢ ¼ teaspoon ground black pepper",
      "▢ 1 teaspoon granulated white sugar",
      "▢ 1 ½ cups water",
      "▢ 1 teaspoon garlic powder",
      "▢ 6 tablespoons cooking oil",
      "▢ Salt to taste"
    ],
    "instructions": [
      "Heat 3 tablespoons of oil in a wok or pan. Stir-fry the liver for 2 to 3 minutes. Add the garlic powder. Continue to cook until the liquid from the liver completely evaporates. Set aside.",
      "Heat the remaining oil in a pot.",
      "Once hot, sauté the garlic and onion until soft.",
      "Add the ground black pepper. Stir.",
      "Add the sliced pork shoulder. Cook until light to medium brown.",
      "Put the dried bay leaves in the pot. Cook while stirring for 3 to 5 minutes.",
      "Pour the soy sauce and water in the pot. Stir and let boil.",
      "Cover and cook in low heat for 30 to 45 minutes or until pork gets tender.",
      "Stir-in the liver",
      "Pour the vinegar in the pot. Wait for the liquid to boil again. Stir.",
      "Add the garbanzos and red bell pepper. Stir and cover. Cook in medium heat for 5 minutes.",
      "Add salt and sugar. Stir.",
      "Transfer to a serving bowl. Serve.",
      "Share and enjoy!"
    ],
    "cooking_time": "1 hour",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/dinaldalem-recipe-igado-liver-and-pork-adobo/",
    "image_url": "",
    "image_path": "",
    "category": "Chicken Dishes"
  },
  {
    "title": "Lengua Estofado Recipe",
    "ingredients": [
      "▢ 2 lbs. beef lengua boiled until tender and sliced",
      "▢ ½ cup all-purpose flour",
      "▢ 1 14 oz. can diced tomato",
      "▢ 1 Knorr Beef Cube",
      "▢ ¾ cup white wine",
      "▢ 1 medium yellow onion minced",
      "▢ 3 cloves garlic crushed and minced",
      "▢ 2 tablespoons brown sugar",
      "▢ 2 tablespoons soy sauce",
      "▢ 1 tablespoon vinegar",
      "▢ 5 pieces bay leaves",
      "▢ ½ cup sliced button mushrooms",
      "▢ 1 cup pitted olives",
      "▢ ¼ cup sliced black olives",
      "▢ 1 cup water",
      "▢ Salt and ground black pepper to taste",
      "▢ ¼ cup cooking oil"
    ],
    "instructions": [
      "Heat oil in a wide cooking pot",
      "Dredge the slice lengua in flour (shake away the excess flour) and then pan-fry in medium heat for 1 minute per side. Set aside.",
      "Add onion and garlic on the pot. Continue to cook until the onion gets tender.",
      "Pour the can of diced tomato and white wine. Stir.",
      "Add the pan fried beef lengua.",
      "Stir-in soy sauce and water. Add the Knorr Beef Cube. Let boil.",
      "Add the bay leaves. Cover and cook in low heat until the sauce reduces to half.",
      "Add the vinegar. Allow the sauce to re-boil.",
      "Add sugar, green olives, black olives, and mushrooms. Stir. Cook for 5 to 8 minutes.",
      "Sprinkle some salt and ground black pepper to taste.",
      "Transfer to a serving plate. Serve.",
      "Share and enjoy!"
    ],
    "cooking_time": "1 hour",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/lengua-estofado-recipe/",
    "image_url": "",
    "image_path": "",
    "category": "Other Filipino Dishes"
  },
  {
    "title": "Pinoy Style Carbonara Recipe",
    "ingredients": [
      "▢ 1 lb. spaghetti",
      "▢ ½ lb. bacon chopped",
      "▢ ½ lb. ground beef",
      "▢ 3 tablespoons butter",
      "▢ ¾ cup sliced button mushrooms",
      "▢ 1 cup beef broth",
      "▢ 2 ½ cups heavy whipping cream",
      "▢ ½ cup Parmesan Cheese",
      "▢ 2 egg yolks",
      "▢ 1 small yellow onion minced",
      "▢ 3 cloves garlic minced",
      "▢ Salt and pepper to taste"
    ],
    "instructions": [
      "Cook the spaghetti according to package instructions. Set aside.",
      "Heat a cooking pot. Sear the bacon. Continue to cook until the fat comes out and the bacon becomes crispy.",
      "Remove the bacon from the pot including half of the bacon fat. Set the bacon aside. We will add it later. As for the bacon fat, you can keep it in a sealed container for later use or you may discard it.",
      "Heat the remaining bacon fat in the pot. Add the ground beef and cook until it browns.",
      "Add the onion and garlic. Stir and cook until the onion becomes tender.",
      "Pour the beef broth. Let boil. Continue to cook until the liquid evaporates completely.",
      "Add the mushrooms. Stir.",
      "Slide-in the butter and then continue to cook until it melts.",
      "Pour 2 ¼ cups of heavy whipping cream. Stir and let boil. Set the heat to medium.",
      "Add Parmesan cheese, salt and ground black pepper.",
      "In a bowl, beat the egg yolks and then add the remaining ¼ cup heavy whipping cream. Continue to beat until all the ingredients are well blended.",
      "Pour the egg yolk mixture on the pot. Continuously stir until the texture of the white sauce becomes thick.",
      "Arrange a serving of spaghetti in a bowl and pour-in some carbonara sauce. Mix well.",
      "Twirl the spaghetti carbonara using a fork and then transfer to a pasta bowl. Top with bacon and Parmesan cheese.",
      "Serve. Share and enjoy!"
    ],
    "cooking_time": "50 minutes",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/pinoy-style-carbonara/",
    "image_url": "",
    "image_path": "",
    "category": "Other Filipino Dishes"
  },
  {
    "title": "Pork Tenderloin Salpicao",
    "ingredients": [
      "▢ 1 lb. pork tenderloin",
      "▢ 5 to 7 cloves garlic crushed",
      "▢ ¼ cup extra virgin olive oil",
      "▢ 1/2 teaspoon salt",
      "▢ ¼ teaspoon ground black pepper",
      "▢ 2 tablespoons unsalted butter",
      "▢ 5 tablespoons Worcestershire sauce",
      "▢ 2 tablespoons oyster sauce"
    ],
    "instructions": [
      "Slice the pork tenderloin into cubes. Set aside.",
      "Combine olive oil, salt, and ground black pepper. Stir and then add the crushed garlic. Mix well.",
      "Put the cubed pork in a bowl and pour the olive oil mixture, but strain the garlic using a fork or spoon (we will cook the garlic separately). Fold the pork and make sure that all are coated with olive oil. Let it stay for 20 to 30 minutes. This will let the pork absorb the oil along with the flavors infused in it.",
      "Heat a pan. Once hot, add the garlic with the remaining oil. Cook until it turns brown. You may add up to 1 teaspoon of oil if needed (do this only if you think that more oil is needed to cook the garlic). Transfer the browned garlic in a bowl.",
      "Continue to heat the pan with the remaining oil. Add the oil-marinated pork (including the oil). Stir-fry (in high heat) until the pork turns brown.",
      "Add half of the browned garlic. Stir. Add the Worcestershire sauce and oyster sauce. Continue to cook in high heat until the sauce completely evaporates.",
      "Add the butter. Continue to cook until it melts.",
      "Transfer to a serving plate. Top with remaining garlic.",
      "Serve. Share and enjoy!"
    ],
    "cooking_time": "50 minutes",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/pork-tenderloin-salpicao/",
    "image_url": "",
    "image_path": "",
    "category": "Pork Dishes"
  },
  {
    "title": "Adobong Okra with Pork Recipe",
    "ingredients": [
      "▢ 12 pieces okra",
      "▢ ½ lb. pork belly. sliced into small pieces",
      "▢ 4 tablespoons soy sauce",
      "▢ 2 tablespoons white vinegar",
      "▢ 3 cloves garlic crushed",
      "▢ 1 cup water",
      "▢ ½ teaspoon sugar",
      "▢ 3 tablespoons cooking oil",
      "▢ Salt and ground black pepper to taste"
    ],
    "instructions": [
      "Heat oil in a pan.",
      "Add the garlic. Cook in medium heat until the garlic turns medium brown.",
      "Add the pork belly pieces. Cook for 2 minutes.",
      "Pour the soy sauce and water. Cover. Cook the pork in low heat for 30 minutes or until the pork becomes tender. You can add more water if the liquid starts to dry out.",
      "Pour the vinegar. Let the liquid re-boil.",
      "Put the okra in the pan. Stir. Cover and cook for 5 minutes.",
      "Add the sugar. Sprinkle some salt and pepper. Stir.",
      "Transfer to a serving bowl. Serve.",
      "Share and enjoy!"
    ],
    "cooking_time": "50 minutes",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/adobong-okra-with-pork-recipe/",
    "image_url": "",
    "image_path": "",
    "category": "Chicken Dishes"
  },
  {
    "title": "Mini Turon Recipe (Banana Lumpia with Caramel)",
    "ingredients": [
      "▢ 3 pieces Saba banana quartered",
      "▢ 12 pieces lumpia wrapper",
      "▢ 1/2 cup ripe jackfruit sliced into strips",
      "▢ ½ cup brown sugar",
      "▢ 1 cup vanilla ice cream optional",
      "▢ 1 cup canola oil",
      "▢ 1 cup brown sugar",
      "▢ 1 cup water"
    ],
    "instructions": [
      "Prepare the simple syrup by boiling the water in a pot. Add the brown sugar. Stir until sugar is completely diluted. Continue to cook in low heat until the liquid reduces in half. Set aside.1 cup water, 1 cup brown sugar",
      "Prepare the mini turon by arranging a piece of sliced banana over a lumpia wrapper. Put a strip of jackfruit on the side and spread a teaspoon or two of brown sugar. Secure the wrap by folding both sides inwards and then roll until the contents are completely wrapped. Seal the end of the wrapper by rubbing a bit of water using your fingers, and then press it gently against the turon.3 pieces Saba banana, 12 pieces lumpia wrapper, 1/2 cup ripe jackfruit sliced into strips, ½ cup brown sugar",
      "Start to heat the oil in a pan.1 cup canola oil",
      "Meanwhile, brush some simple syrup all over each piece of turon. You can also dip the turon in syrup.",
      "Fry one side in low to medium heat for 3 minutes. Turn over to fry the other side for the same time or until the mini turon pieces are golden brown and crispy.",
      "Arrange in a plate. Serve with scoops of vanilla ice cream.1 cup vanilla ice cream",
      "Share and enjoy!"
    ],
    "cooking_time": "17 minutes",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/mini-turon-recipe-banana-lumpia-with-caramel/",
    "image_url": "",
    "image_path": "",
    "category": "Vegetable Dishes"
  },
  {
    "title": "How To Cook Beef Kaldereta",
    "ingredients": [
      "▢ 2 lbs. beef chuck sliced into cubes",
      "▢ 2 medium carrots sliced",
      "▢ 1 large potato sliced into cubes",
      "▢ 1 small green bell pepper sliced",
      "▢ 1 small red bell pepper sliced",
      "▢ 1 Knorr Beef Cube",
      "▢ 1 can 8 oz. tomato sauce",
      "▢ 5 tablespoons liver spread",
      "▢ 3 cloves garlic crushed",
      "▢ 1 medium yellow onion chopped",
      "▢ ¼ teaspoon red pepper flakes",
      "▢ Salt and ground black pepper to taste",
      "▢ 1 ½ cups water",
      "▢ 6 tablespoons cooking oil"
    ],
    "instructions": [
      "Heat a pan or wok and then pour 3 tablespoons cooking oil. Stir-fry the bell peppers for 3 minutes. Remove the bell peppers and put in a plate. Set aside.",
      "Using the oil in the pan (add more if necessary), pan fry the carrots and potato for 3 to 5 minutes. Put these in a plate and then set aside.",
      "Heat the remaining 3 tablespoons of oil in a clean pot.",
      "Sauté the garlic and onion",
      "Add the beef. Cook until it turns light brown.",
      "Pour –in tomato sauce and water. Let boil.",
      "Add the Knorr Beef Cube. Stir. Cover the pot. Continue to cook in low heat for 60 minutes or until the beef gets tender. Add more water if needed.",
      "Stir-in the liver spread and then add some salt and pepper.",
      "Put the pan-fried potato and carrots in the pot. Stir. Add the bell peppers.",
      "Cover the pot. Continue to cook for 5 minutes.",
      "Add the red pepper flakes. Stir and cook for 3 minutes more.",
      "Transfer to a serving plate. Serve.",
      "Share and enjoy!"
    ],
    "cooking_time": "1 hour",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/how-to-cook-beef-kaldereta/",
    "image_url": "",
    "image_path": "",
    "category": "Main Dishes"
  },
  {
    "title": "Champorado with Tuyo – Chocolate Porridge with Salted Dried Fish",
    "ingredients": [
      "▢ 1 cup glutinous rice",
      "▢ 4 to 5 cups water",
      "▢ ½ cup sugar",
      "▢ 4 pieces pure cocoa tablea",
      "▢ A pinch of salt",
      "▢ 6 to 12 pieces fried salted dried fish tuyo"
    ],
    "instructions": [
      "Pour 4 cups water in a pot. Let boil.",
      "Add the sugar and tablea. Stir and continue to boil until the cocoa tablea dilutes.",
      "Add a pinch of salt and gently pour the glutinous rice in the pot. Stir and let the liquid re-boil.",
      "Continue to cook in low heat until the rice gets soft (the consistency should be similar to a porridge). Make sure to stir the mixture every 2 to 3 minutes to prevent the rice from sticking on the pot. Add the extra cup cup of water (or more) if needed.",
      "Scoop some cooked champorado using a ladle and pour in a bowl. Serve with crispy fried tuyo fish and evaporated milk.",
      "Share and enjoy!"
    ],
    "cooking_time": "40 minutes",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/champorado-with-tuyo-chocolate-porridge-with-salted-dried-fish/",
    "image_url": "",
    "image_path": "",
    "category": "Rice Dishes"
  },
  {
    "title": "Slow Cooked Beefsteak (Bistek Tagalog)",
    "ingredients": [
      "▢ 1 lb. beef sirloin sliced into thin pieces",
      "▢ 3 cloves garlic crushed and minced",
      "▢ 3 tablespoons soy sauce",
      "▢ 1 cup beef broth",
      "▢ 1 medium onion sliced crosswise",
      "▢ 1/8 teaspoon ground black pepper",
      "▢ ¼ teaspoon salt",
      "▢ ½ teaspoon granulated white sugar",
      "▢ Juice from 1 lemon"
    ],
    "instructions": [
      "Put the beef slices in a slow cooker.",
      "Add garlic, soy sauce, and beef broth. Stir. Set the slow cooker to cook for 4 hours.",
      "On the 2nd hour, arrange the onion slices on top. Cover and continue to slow cook.",
      "A few minutes before the slow cooker completes its 4 hour cook time, add the ground black pepper, salt, sugar, and lemon juice. Stir. Cover and cook until the slow cooker completes the cooking time.",
      "Transfer to a serving plate. Serve!",
      "Share and enjoy!"
    ],
    "cooking_time": "4 hours",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/slow-cooked-beefsteak-bistek-tagalog/",
    "image_url": "",
    "image_path": "",
    "category": "Main Dishes"
  }
]