[
  {
    "title": "Sweet and Sour Sauce Recipe",
    "ingredients": [
      "▢ 4 tablespoons brown sugar",
      "▢ 2 1/2 tablespoons tomato ketchup",
      "▢ 1/3 cup rice vinegar or white vinegar",
      "▢ 1/2 teaspoon soy sauce",
      "▢ 2 teaspoon cornstarch dissolved in 5 teaspoons of water"
    ],
    "instructions": [
      "Combine the sugar, ketchup, vinegar, and soy sauce in a bowl.",
      "Mix the combined ingredients using a balloon whisk or fork.",
      "Heat a saucepan then pour-in the sugar-ketchup-vinegar-soy sauce mixture. Stir once in a while and bring to a boil.",
      "Pour-in the cornstarch diluted in water then continue stirring until the texture becomes thick.",
      "Turn of the heat and transfer the sweet and sour sauce to a sauce bowl then serve."
    ],
    "cooking_time": "20 minutes",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/how-to-make-sweet-and-sour-sauce-recipe/",
    "image_url": "",
    "image_path": "",
    "category": "Other Filipino Dishes"
  },
  {
    "title": "Marinated Shrimp with Lemon Dill Sauce",
    "ingredients": [
      "▢ 2 lbs. cooked shrimp head and shell removed and deveined",
      "▢ 1 ½ cups mayonnaise",
      "▢ ½ cup sour cream",
      "▢ 1/3 cup fresh lemon juice",
      "▢ ¼ cup sugar",
      "▢ 1 large red onion sliced thinly",
      "▢ 1/3 cup dill",
      "▢ ¼ tablespoon salt"
    ],
    "instructions": [
      "In a mixing bowl, combine the mayonnaise, sour cream, sugar, lemon juice, salt, dill, and red onions then mix thoroughly.",
      "Add the shrimps then muddle up until the mixture covers the shrimps.",
      "Cover the top of the bowl with cling wrap then refrigerate overnight.",
      "Serve cold as an appetizer. Share and enjoy!"
    ],
    "cooking_time": "15 minutes",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/delicious-seafood-appetizer-dish-marinated-shrimp-with-lemon-dill-sauce-recipe/",
    "image_url": "",
    "image_path": "",
    "category": "Other Filipino Dishes"
  },
  {
    "title": "Deviled Egg with Salmon Recipe",
    "ingredients": [
      "▢ 6 pieces hard boiled eggs cut in half lengthwise with yolk separated from the whites",
      "▢ 5 tablespoons smoked salmon minced",
      "▢ 3 tablespoons green onions minced",
      "▢ 3 tablespoons cream cheese softened",
      "▢ 1 tablespoon sour cream",
      "▢ 1 teaspoon mustard powder",
      "▢ 1/4 teaspoon salt",
      "▢ 1/4 teaspoon paprika",
      "▢ Fresh dill for garnish"
    ],
    "instructions": [
      "In a mixing bowl, mash the boiled egg yolks.",
      "Add-in salt, paprika, mustard powder, minced smoked salmon, cream cheese, sour cream, and minced green onions then mix thoroughly.",
      "Scoop the mixture using a spoon and place it on center of the sliced boiled egg white.",
      "Garnish with salmon and dill then refrigerate for at least 30 minutes.",
      "Serve chilled. Share and enjoy!"
    ],
    "cooking_time": "25 minutes",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/dressed-appetizer-food-deviled-eggs-mimosa-with-salmon-recipe/",
    "image_url": "",
    "image_path": "",
    "category": "Other Filipino Dishes"
  },
  {
    "title": "Custard Cake Recipe",
    "ingredients": [
      "▢ >>Caramel:",
      "▢ 1 cup granulated sugar",
      "▢ >>Custard:",
      "▢ 6 eggs",
      "▢ 1 can condensed milk",
      "▢ 1 cup fresh milk",
      "▢ ¼ cup granulated sugar",
      "▢ >>Cake:",
      "▢ 1 teaspoon baking powder",
      "▢ 1/4 cup milk mixed with 1/4 cup water milk diluted in water",
      "▢ 1 teaspoon finely grated lemon lemon rind",
      "▢ 6 egg yolks",
      "▢ 1/2 cup granulated sugar",
      "▢ 1 1/2 cups cake flour sifted",
      "▢ >>Meringue:",
      "▢ 6 egg whites",
      "▢ 1/2 teaspoon cream of tartar",
      "▢ 1/2 cup granulated sugar"
    ],
    "instructions": [
      "Create the caramel. Heat a 9 x 13 or circular baking pan in the stove top using medium heat. Pour-in the granulated sugar and let stand until the sugar melts (or turns into caramel). You may want to stir the sugar once in a while to make sure that everything is equally distributed within the area of the baking pan. Set aside.",
      "Create the custard. Combine milk, egg yolks, and sugar in a mixing bowl. Stir the ingredients until everything is properly distributed.Pour the custard mixture on the baking pan with caramel. Set aside",
      "Create the cake. In a clean mixing bowl, beat the egg yolks then gradually add the sugar. Continue beating for about 2 minutes. Put-in a small amount of cake flour alternately with the milk diluted in water and mix well. Do this procedure until the cake flour and milk diluted in water are completely used up. Put-in the lemon rind then beat until texture is smooth. Set aside.",
      "Create the meringue. Beat the egg whites using an electric mixer until texture becomes bubbly (use high speed). Add the cream of tartar then continue to beat until texture becomes fluffy (about 3 to 4 minutes in high speed). Gradually add the sugar then continuously beat until meringue is shiny and firm.",
      "Fold the cake mixture into the meringue until well blended",
      "Pour the folded cake and meringue mixture over custard mixture in the baking pan.",
      "Preheat oven to 350 degrees Fahrenheit",
      "Pour about 6 to 8 cups of hot water on a roasting pan (with rack) then place the cake pan on top of the rack.",
      "Place the roasting pan that contains the cake pan with all the mixtures in the oven and bake for about 60 minutes or until the toothpick test indicates that the cake is ready.",
      "Remove cake from the oven and allow the temperature to cool down.",
      "Transfer to a serving tray then refrigerate for at least an hour.",
      "Serve chilled, share and enjoy!"
    ],
    "cooking_time": "1 hour",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/filipino-asian-dessert-food-leche-flancustard-cake-recipe/",
    "image_url": "",
    "image_path": "",
    "category": "Other Filipino Dishes"
  },
  {
    "title": "Fettuccine Alfredo Recipe",
    "ingredients": [
      "▢ 1 lb fettuccine cooked according to package instructions",
      "▢ 1 1/2 cup milk",
      "▢ 1 1/2 cup heavy whipping cream",
      "▢ 1/2 cup Parmesan cheese shredded",
      "▢ 1/2 cup Romano cheese shredded",
      "▢ 6 egg yolks",
      "▢ 4 pieces fried bacon crumbled (optional)",
      "▢ Salt and pepper to taste"
    ],
    "instructions": [
      "Cook the fettuccine according to package instructions",
      "Heat a saucepan or cooking pot and pour-in the milk then bring to a boil",
      "Add the heavy whipping cream and stir then let boil.",
      "Adjust the heat to the lowest possible then add the Parmesan and Romano cheeses. Stir continuously until cheese melts and the texture of the mixture becomes fine.",
      "Whisk the egg yolks in a mixing bowl then add about 5 tablespoons of the milk-cheese mixture. Continue whisking until everything is well distributed.",
      "Add the egg yolk mixture in the saucepan/cooking pot and stir until the texture becomes thick.",
      "Add the cooked fettuccine and toss until the noodles are well covered with sauce.",
      "Add the crumbled fried bacon, salt, and pepper and mix with the other ingredients.",
      "Transfer to a serving plate then serve. Share and enjoy!"
    ],
    "cooking_time": "40 minutes",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/pasta-olive-garden-style-fettuccine-alfredo-bacon-recipe/",
    "image_url": "",
    "image_path": "",
    "category": "Other Filipino Dishes"
  },
  {
    "title": "New York Style Cheesecake",
    "ingredients": [
      "▢ 1/2 cup granulated sugar",
      "▢ 3 packs cream cheese 8 ounces each",
      "▢ 1 1/2 tablespoons all-purpose flour",
      "▢ 1 teaspoon vanilla essence or extract",
      "▢ 1/2 cup sour cream",
      "▢ 2 pieces raw eggs",
      "▢ 1 can cherrie pie filling about 8 ounces",
      "▢ 1 ready made graham pie crust"
    ],
    "instructions": [
      "Beat the cream cheese in a mixing bowl using an electric mixer for about 2 to 3 minutes",
      "Whisk-in the granulated sugar and continue beating until everything is properly distributed.",
      "Add the flour and vanilla essence(or extract) then mix again for about 1 minute.",
      "Put-in the sour cream and continue mixing for another minute.",
      "Gradually add the eggs one at a time while mixing. Continue mixing until all the ingredients are well distributed.",
      "Pour the mixture over the graham pie crust.",
      "Preheat oven at 325 degrees Fahrenheit then bake for 30 to 35 minutes.",
      "Remove from the oven then allow to cool down",
      "Place the cherry pie filling on top of the cheesecake and spread evenly.",
      "Refrigerate for 30 minutes to an hour.",
      "Serve. Share and Enjoy!"
    ],
    "cooking_time": "45 minutes",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/best-dessert-new-york-style-cheesecake-cherry-pie-filling-recipe/",
    "image_url": "",
    "image_path": "",
    "category": "Other Filipino Dishes"
  },
  {
    "title": "Molo Soup",
    "ingredients": [
      "▢ 2 lbs ground pork",
      "▢ 2 lbs chicken",
      "▢ 1 ½ cups water chestnut minced",
      "▢ 6 tablespoons fish sauce",
      "▢ 1 tablespoon salt",
      "▢ 1 cup shrimp sliced, chopped, or minced",
      "▢ ½ cup annatto seeds soaked in ¾ cup water",
      "▢ 1 cup minced onions ¾ cup goes to the filling while ¼ is for sautéing",
      "▢ 2 packs wonton wrapper about 100 counts",
      "▢ ½ cup minced green onions",
      "▢ 4 cloves garlic minced (about 2 tablespoons)",
      "▢ ½ tablespoon ground black pepper",
      "▢ 1 piece raw egg",
      "▢ ¼ cup toasted garlic to garnish please see Arroz Caldo post on how to toast garlic",
      "▢ 4 tablespoons cooking oil",
      "▢ 12 cups water 8 cups to boil chicken, 4 cups to be added to the soup"
    ],
    "instructions": [
      "Pour water in a casserole and bring to a boil.",
      "Put-in the chicken and boil for 40 to 60 minutes or until tender",
      "While waiting for the chicken to be tender, combine the ground pork, water chestnut, green onions, onions, egg, salt, and ground black pepper in a large mixing bowl then mix well until ingredients are well distributed.",
      "Get a piece of wonton wrapper and place in a clean flat surface.",
      "Scoop a tablespoon of the ground pork mixture and place on the middle of the wonton wrapper.",
      "Wrap the ground pork mixture with wonton wrapper (watch the video for more information): Slightly wet the borders of the wonton wrapper with water. Fold the wonton wrapper to secure the filling. The lower left end should meet the upper right end forming a triangle. Press the edges to make it intact and to avoid possibilities of opening). Slightly wet the three pointed sides of the wonton wrapper then fold each of them towards the middle (as if you are trying to connect the pointed end to an imaginary dot in the center of the wrapper).",
      "Continue doing this procedure until all the ground pork mixture is wrapped.",
      "Remove the chicken from the boiling water and let it cool down. Set chicken stock (water used for boiling) aside.",
      "Once the chicken reaches room temperature, manually separate the meat from the bones then chop the separated meat to your desired sized. Set aside.",
      "Heat a clean casserole then pour-in the cooking oil.",
      "Sauté the garlic and onions then add the chopped chicken and cook for 3 to 5 minutes.",
      "Add the fish sauce, annatto water (water from the soaked annatto seeds), and chicken stock then bring to a boil.",
      "Pour-in additional water then bring to a boil once more",
      "Add the shrimps then cook for a minute",
      "Add the wrapped ground pork mixture and cook for 12 to 18 minutes (use low heat)",
      "Put-in some minced green onions and toasted garlic as desired.",
      "Transfer to a serving bowl and serve while hot. Share and enjoy!"
    ],
    "cooking_time": "1 hour",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/asian-filipino-pinoy-food-pansit-molo-soup-recipe/",
    "image_url": "",
    "image_path": "",
    "category": "Rice Dishes"
  },
  {
    "title": "Baked King Crab Legs with Garlic Lemon Butter Sauce",
    "ingredients": [
      "▢ 2 lbs King Crab Legs",
      "▢ 3 tablespoons extra virgin olive oil",
      "▢ 3 cloves garlic slightly crushed",
      "▢ 1 teaspoon parsley minced (optional)",
      "▢ 1/4 cup lemon juice",
      "▢ 3/4 cup butter",
      "▢ a pinch of salt"
    ],
    "instructions": [
      "Heat a saucepan using low heat",
      "Put-in the butter and allow to melt",
      "When the butter is hot enough, add the garlic and cook for a minute (do not brown the garlic)",
      "Pour-in the lemon juice and stir then let stand for 15 to 20 seconds",
      "Pour-in the extra virgin olive oil, parsley, and salt (as needed) then turn off the heat. Set aside.",
      "Cut the crab legs in half (crosswise) to shorten the length of the legs then make a 3 to 4 inches opening in each leg by cutting one side of the shell lengthwise (the meat should still be intact) using a pair of kitchen shears.",
      "Place the crab legs in a baking tray then brush the garlic lemon butter sauce on the side where the openings are located",
      "Pre-heat oven to 300 degrees Fahrenheit then bake the crab legs for 12 to 15 minutes or until the aroma of the crab fills the kitchen",
      "Remove from the oven and allow to cool down then place in a serving plate with the sauce on the side",
      "Serve. Share and enjoy!"
    ],
    "cooking_time": "25 minutes",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/seafood-noche-buena-holiday-christmas-dinner-baked-king-crab-legs-with-garlic-lemon-butter-sauce-recipe/",
    "image_url": "",
    "image_path": "",
    "category": "Other Filipino Dishes"
  },
  {
    "title": "Food for the Gods",
    "ingredients": [
      "▢ 1 1/4 cups all-purpose flour sifted",
      "▢ 1 cup butter about 2 sticks",
      "▢ 1 cup granulated sugar white, sifted",
      "▢ 1 cup brown sugar",
      "▢ 3 pieces raw eggs",
      "▢ 1/2 teaspoon baking soda",
      "▢ 1/2 teaspoon baking powder",
      "▢ 1/4 teaspoon salt",
      "▢ 1 cup dates chopped",
      "▢ 1 cup walnuts chopped"
    ],
    "instructions": [
      "In a mixing bowl, combine the flour, baking soda, baking powder, and salt then mix well.",
      "Cream the butter in a separate mixing bowl and add the sugar (white and brown) while continously mixing until texture becomes fluffy.",
      "Beat-in the eggs on the mixing bowl with butter and sugar then continue mixing until everything is well distributed.",
      "Gradually add the flour-baking soda-baking powder-salt mixture while continously mixing (don't forget to scrape the sides with a silicon spatula).",
      "Put-in the dates and walnuts then mix until well distributed.",
      "Preheat oven to 350 degrees Fahrenheit",
      "Grease the baking pan and pour-in the batter.",
      "Bake for 10 minutes then pull down the temperature to 300 and continue baking for 35 minutes or until done (you may use the toothpick technique)",
      "Remove from the oven and allow to cool down",
      "Slice and wrap individually if desired.",
      "Serve. Share and enjoy!"
    ],
    "cooking_time": "45 minutes",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/delicious-holiday-dessert-date-bar-food-for-the-gods-recipe/",
    "image_url": "",
    "image_path": "",
    "category": "Other Filipino Dishes"
  },
  {
    "title": "Roast Beef",
    "ingredients": [
      "▢ 3 to 4 lbs beef bottom round roast",
      "▢ 4 tablespoons extra virgin olive oil",
      "▢ 4 cloves garlic divided into 3 to 4 parts (lengthwise)",
      "▢ 2 teaspoons salt",
      "▢ 3 teaspoons ground black pepper",
      "▢ 1 cup red wine",
      "▢ 1 piece beef cube",
      "▢ 1 cup water",
      "▢ 2 tbsp cornstarch diluted in 4 tbsp water"
    ],
    "instructions": [
      "Preheat the oven to 375 degrees Fahrenheit.",
      "Make some slit on the meat using a knife and insert each sliced garlic clove",
      "Spread the olive oil on the meat then sprinkle some salt and pepper.",
      "Place the meat on a roasting rack (with dripping tray/pan) and bake for 30 minutes.",
      "Reduce the heat to 250 degrees Fahrenheit then continue baking for 2 to 2.5 hours (or until the inner temperature of the meat reaches 140 degrees Fahrenheit). Note: Do not remove from the oven right away. Let the juices from the meat drip some more so that you will have enough drippings for the gravy.",
      "Remove the roasted meat from the oven and allow it to rest for at least 15 minutes.",
      "Slice the meat into serving pieces and transfer to a serving plate.",
      "We also need to prepare the sauce. The following steps will help you make a good one.",
      "Take the dripping pan out of the oven and place it on the stove then apply heat.",
      "Pour-in the red wine and deglaze the drippings then transfer to a saucepan.",
      "Add water and bring to a boil.",
      "Add the beef cube and cook until well diluted then put-in the cornstarch. Stir continuously.",
      "Transfer the sauce to a serving bowl.",
      "Serve the Roast beef with the sauce on the side.",
      "Share and enjoy!"
    ],
    "cooking_time": "2 hours",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/special-holiday-food-dish-roast-beef-recipe/",
    "image_url": "",
    "image_path": "",
    "category": "Other Filipino Dishes"
  },
  {
    "title": "Vanilla Chiffon Cake",
    "ingredients": [
      "▢ >>Cake:",
      "▢ 2 1/4 cups cake flour",
      "▢ 1 1/2 cups granulated sugar",
      "▢ 1 tablespoon baking powder",
      "▢ 1 teaspoon salt",
      "▢ 3/4 cup cold water",
      "▢ 1/2 cup canola oil",
      "▢ 5 pieces raw eggs separated",
      "▢ 1 tablespoon vanilla extract",
      "▢ 1/2 teaspoon cream of tartar",
      "▢ >>Buttercream Icing:",
      "▢ 1/2 cup vegetable shortening",
      "▢ 1/2 cup butter softened",
      "▢ 1 teaspoon vanilla extract",
      "▢ 4 cups confectioners sugar",
      "▢ 4 tablespoons evaporated milk"
    ],
    "instructions": [
      "Make the Cake by combining flour, 1 cup sugar, baking powder, and salt in a mixing bowl then mix well. Pour-in the cold water, canola oil, egg yolks, and vanilla extract then whisk until the texture becomes smooth. Set aside. Transfer the egg whites in a separate mixing bowl and combine cream of tartar. Beat the egg white and cream of tartar mixture using an electric mixer (high speed) until texture becomes fluffy. Beat-in the remaining 1/2 cup sugar a teaspoonful at a time and continue mixing until everything is properly distributed. At this point, you should have two mixing bowls with different mixtures. Combine the egg white mixture with the egg yolk mixture gradually by folding the egg white mixture in the egg yolk mixture (start with 1/4 of the egg white mixture followed by another 1/4 until everything is fully combined). Grease two 9-10\" round cake pan and pour-in the folded mixture equally. Preheat oven to 325 degrees Fahrenheit and bake both cake pans for 33 minutes.",
      "Make the Icing by combining softened butter and shortening in a mixing bowl then cream using an electric mixer. Beat-in the sugar 1/2 cup at a time then continue mixing until everything is properly distributed. At this point, the mixture should be somewhat dry. Add the evaporated milk then continue mixing until texture becomes smooth. Set aside.",
      "Remove the cake from the oven then allow to cool down.",
      "Separate the cake from the cake pan and trim the edges using a bread knife.",
      "Place one cake on a flat surface then apply the icing on top spreading it evenly until the top part is fully covered.",
      "Put the other cake on top of the first one (the part with icing should be in the middle) then continue to apply icing on the whole cake.",
      "Use you imagination in designing the cake. You may or may not refrigerate this before serving.",
      "Serve. Share and enjoy!"
    ],
    "cooking_time": "43 minutes",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/baking-vanilla-chiffon-cake-buttermilk-icing-recipe/",
    "image_url": "",
    "image_path": "",
    "category": "Other Filipino Dishes"
  },
  {
    "title": "Meatloaf Recipe",
    "ingredients": [
      "▢ 2 lbs. ground beef",
      "▢ 1 cup Italian bread crumbs",
      "▢ 1 cup onion minced",
      "▢ 1 cup celery minced",
      "▢ 2 teaspoons Worcestershire sauce",
      "▢ 1 teaspoon garlic minced",
      "▢ 1 teaspoon salt",
      "▢ 1/2 teaspoon pepper",
      "▢ 6 ounces tomato paste",
      "▢ 1 teaspoon mustard powder",
      "▢ 2 pieces raw eggs",
      "▢ 1 cup tomato ketchup"
    ],
    "instructions": [
      "Combine the ground beef, minced celery, and minced onions in a mixing bowl then mix well.",
      "Add the eggs, minced garlic, bread crumbs, salt, ground black pepper, worcestershire sauce, mustard powder, and tomato paste then mix all the ingredients together",
      "Transfer the mixed ingredients in a loaf pan.",
      "Spread the ketchup evenly on top of the meatloaf",
      "Preheat oven to 350 degrees Fahrenheit and bake for 75 minutes",
      "Remove from the oven and transfer to a serving plate.",
      "Serve. Share and enjoy!"
    ],
    "cooking_time": "1 hour",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/food-meat-holiday-dish-meatloaf-recipe/",
    "image_url": "",
    "image_path": "",
    "category": "Other Filipino Dishes"
  }
]