[
  {
    "title": "Batchoy Tagalog",
    "ingredients": [
      "▢ 1 lb. pork loin",
      "▢ ½ lb. pork spleen \"pali\" ng baboy",
      "▢ ½ lb. pork liver",
      "▢ ½ lb. pork blood coagulated",
      "▢ 2 ounces misua",
      "▢ 3 ounces hot pepper leaves",
      "▢ 1 onion sliced into thin pieces",
      "▢ 5 cloves garlic crushed and peeled",
      "▢ 3 thumbs ginger julienned",
      "▢ 4 grams Maggi Magic Sarap",
      "▢ 6 cups water",
      "▢ 3 tablespoons cooking oil",
      "▢ fish sauce and ground black pepper to taste"
    ],
    "instructions": [
      "Heat 3 tablespoons cooking oil in a cooking pot. Add 5 cloves garlic and sauté until it starts to brown. Next, add 1 onion (sliced)  and 3 thumbs ginger (julienned), continuing to sauté until the onion softens.1 onion, 5 cloves garlic, 3 tablespoons cooking oil, 3 thumbs ginger",
      "Add 1 lb. pork loin, stirring until the outer part turns light brown, which should take around 2 minutes. Pour in 1 tablespoon of fish sauce and stir well.1 lb. pork loin, fish sauce and ground black pepper to taste",
      "Then, pour in 6 cups water and cover the pot. Allow it to boil, then adjust the heat to a simmer. Continue simmering for 30 minutes or until the pork tenderizes completely.6 cups water",
      "Next, adjust the heat setting to medium and add ½ lb. pork liver and ½ lb. pork spleen. Stir well, cover the pot, and boil for 5 minutes.½ lb. pork liver, ½ lb. pork spleen",
      "Reduce the heat to the lowest setting and gently add ½ lb. pork blood, stirring gently. Continue cooking for 10 minutes.½ lb. pork blood",
      "Now, add 2 ounces misua, stirring and cooking for 1 minute until they soften. Sprinkle in 4 grams Maggi Magic Sarap and season with fish sauce and ground black pepper to taste.2 ounces misua, 4 grams Maggi Magic Sarap, fish sauce and ground black pepper to taste",
      "Finally, add 3 ounces hot pepper leaves. Cover the pot, then turn off the heat and let it rest for 2 minutes.3 ounces hot pepper leaves",
      "Transfer to a serving bowl and serve hot with rice. Share and enjoy!"
    ],
    "cooking_time": "N/A",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/batchoy-tagalog/",
    "image_url": "",
    "image_path": "",
    "category": "Soups And Stews"
  },
  {
    "title": "Paksiw Na Baboy",
    "ingredients": [
      "▢ 2 lbs. pork belly sliced into cubes",
      "▢ 1 head  garlic crushed",
      "▢ 4 tablespoons soy sauce",
      "▢ 1 cup water",
      "▢ 6 tablespoons white vinegar",
      "▢ ¼ cup brown sugar",
      "▢ 100 grams banana blossoms",
      "▢ 3 pieces dried bay leaves",
      "▢ 1 tablespoon whole peppercorn",
      "▢ 4 grams Maggi Magic Sarap"
    ],
    "instructions": [
      "Sear the pork until it browns, and enough oil gets extracted.2 lbs. pork belly",
      "Add the garlic. Sauté for 1 minute.1 head  garlic",
      "Pour soy sauce and water. Let it boil.4 tablespoons soy sauce, 1 cup water",
      "Add bay leaves and whole peppercorn. Cover the cooking pot. Adjust to a simmer and continue cooking for 30 minutes.3 pieces dried bay leaves, 1 tablespoon whole peppercorn",
      "Adjust the heat setting between low and medium. Add vinegar. Let it boil. Stir.6 tablespoons white vinegar",
      "Add the banana blossoms. Adjust the heat to the lowest setting. Continue to cook for 30 minutes.100 grams banana blossoms",
      "Add brown sugar and season with Maggi Magic Sarap.¼ cup brown sugar, 4 grams Maggi Magic Sarap",
      "Serve hot. Share and enjoy!"
    ],
    "cooking_time": "1 hour",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/paksiw-na-baboy/",
    "image_url": "",
    "image_path": "",
    "category": "Pork Dishes"
  },
  {
    "title": "Special Chicken Afritada",
    "ingredients": [
      "▢ 1 whole chicken cut into serving pieces",
      "▢ 4 ounces chicken liver",
      "▢ 3 hotdogs  sliced diagonally",
      "▢ 2 potatoes quartered",
      "▢ 2 carrots diced",
      "▢ 2 bell peppers sliced",
      "▢ 1 yellow onion chopped",
      "▢ 5 dried bay leaves",
      "▢ ¾ cups green peas",
      "▢ 5 cloves garlic chopped",
      "▢ 3 tablespoons soy sauce",
      "▢ 8 ounces tomato sauce",
      "▢ 1 piece Maggi Magic Chicken Cube",
      "▢ ½ cup cheddar cheese grated",
      "▢ fish sauce and ground black pepper to taste.",
      "▢ ½ cup cooking oil"
    ],
    "instructions": [
      "Heat the cooking oil in a wok. Pan-fry the potatoes and carrots until they brown a bit (about 3 to 4 minutes). Set aside.2 potatoes, ½ cup cooking oil, 2 carrots",
      "Reduce the oil to 3 tablespoons. Pan-fry the chicken livers for 30 seconds on each side. Remove the liver and set aside.4 ounces chicken liver",
      "Sauté the onion and garlic until the onion softens. Add the chicken pieces and continue sautéing until the outer part turns light brown.1 yellow onion, 5 cloves garlic, 1 whole chicken",
      "Pour the soy sauce into the wok and cook for 30 seconds. Add the hotdogs and cook for 1 minute.3 tablespoons soy sauce, 3 hotdogs",
      "Pour the tomato sauce into the wok, add 1 cup of water, stir, and bring it to a boil.8 ounces tomato sauce",
      "Add the chicken liver and dried bay leaves. Simmer for 30 minutes.5 dried bay leaves",
      "Add the green peas and bell peppers, and cook for 2 minutes. Then, add the fried potatoes and carrots and stir.¾ cups green peas, 2 bell peppers",
      "Season with the Maggi Magic Chicken Cube, stirring and cooking for 1 minute. Adjust seasoning with fish sauce and ground black pepper to taste. Top with grated cheese.1 piece Maggi Magic Chicken Cube, fish sauce and ground black pepper to taste., ½ cup cheddar cheese",
      "Transfer to a serving plate. Serve and enjoy!"
    ],
    "cooking_time": "N/A",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/special-chicken-afritada/",
    "image_url": "",
    "image_path": "",
    "category": "Chicken Dishes"
  },
  {
    "title": "Sotanghon And Egg Noodle Soup",
    "ingredients": [
      "▢ 5 eggs boiled and peeled",
      "▢ 160 grams vermicelli",
      "▢ ¼ head cabbage shredded",
      "▢ 1 ¼ quarts water",
      "▢ 2 ½ teaspoons chicken powder",
      "▢ 1 teaspoon annatto powder",
      "▢ 5 cloves garlic crushed",
      "▢ 1 onion chopped",
      "▢ 2 stalks of spring onion chopped",
      "▢ 1  teaspoon toasted garlic",
      "▢ 3 tablespoons cooking oil",
      "▢ fish sauce and ground black pepper to taste"
    ],
    "instructions": [
      "Heat oil in a cooking pot.3 tablespoons cooking oil",
      "Sauté the garlic until it starts to brown. Add the onion and continue sautéing until it softens.5 cloves garlic, 1 onion",
      "Stir in the annatto powder and 2 teaspoons of fish sauce.1 teaspoon annatto powder, fish sauce and ground black pepper to taste",
      "Pour in the water and bring it to a boil.1 ¼ quarts water",
      "Add the vermicelli and chicken powder. Cover and let it re-boil, then reduce the heat to a simmer and cook for 3 minutes.160 grams vermicelli, 2 ½ teaspoons chicken powder",
      "Toss the noodles, then add the cabbage.¼ head cabbage",
      "Cover and cook for an additional 2 minutes.",
      "Add the boiled eggs and green onions, and season with fish sauce and ground black pepper.5 eggs, fish sauce and ground black pepper to taste, 2 stalks of spring onion",
      "Transfer to a serving plate and top with toasted garlic. Serve hot, share, and enjoy!1  teaspoon toasted garlic"
    ],
    "cooking_time": "25 minutes",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/sotanghon-and-egg-noodle-soup/",
    "image_url": "",
    "image_path": "",
    "category": "Noodles"
  },
  {
    "title": "No Grill Pork Ribs Barbecue",
    "ingredients": [
      "▢ 3 lbs. pork ribs sliced into serving pieces",
      "▢ 2 cups water",
      "▢ 2 tablespoons cooking oil",
      "▢ 3 tablespoons Worcestershire sauce",
      "▢ ½ cup  banana ketchup",
      "▢ 2 teaspoons onion powder",
      "▢ 1 1/2 teaspoons garlic powder",
      "▢ 1 teaspoon liquid smoke optional",
      "▢ 1/2 teaspoon ground black pepper",
      "▢ 1 cup  banana ketchup",
      "▢ 3/4 cup white vinegar",
      "▢ 3/4 cup brown sugar",
      "▢ 2 teaspoons smoked paprika",
      "▢ 1/2 cup water"
    ],
    "instructions": [
      "Arrange the pork ribs in a mixing bowl. Add the marinade ingredients and mix well. Marinate for at least 30 minutes.3 lbs. pork ribs, 3 tablespoons Worcestershire sauce, ½ cup  banana ketchup, 2 teaspoons onion powder, 1 1/2 teaspoons garlic powder, 1 teaspoon liquid smoke, 1/2 teaspoon ground black pepper",
      "Heat cooking oil in a pan. Fry the marinated pork ribs for 1½ minutes per side. Set aside.2 tablespoons cooking oil, 3 lbs. pork ribs",
      "Arrange all the fried ribs back in the pan. Pour in 2 cups of water and let it boil. Adjust the heat to a simmer, cover the pan, and continue cooking until the water evaporates completely. Remove the pork ribs from the pan and set them aside.3 lbs. pork ribs, 2 cups water",
      "Add all the barbecue sauce ingredients to the pan. Turn on the heat and stir. Bring it to a simmer.1 cup  banana ketchup, 3/4 cup white vinegar, 3/4 cup brown sugar, 2 teaspoons smoked paprika, 1/2 cup water",
      "Add the pork ribs back to the pan. Toss until the ribs are completely coated with the barbecue sauce. Continue cooking for 2 minutes.",
      "Transfer the ribs to a serving plate.",
      "Serve and enjoy!"
    ],
    "cooking_time": "1 hour",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/no-grill-pork-ribs-barbecue/",
    "image_url": "",
    "image_path": "",
    "category": "Pork Dishes"
  },
  {
    "title": "Beef Chop Suey",
    "ingredients": [
      "▢ 1 lb. beef top sirloin sliced into thin pieces",
      "▢ 5 cloves garlic minced",
      "▢ 1 yellow onion sliced thinly",
      "▢ 3 stems  green onion cut into 2-inch length",
      "▢ ½ head cabbage sliced into serving pieces",
      "▢ 2 carrots julienne",
      "▢ 1 red bell pepper sliced into thick strips",
      "▢ 2 cups snap peas",
      "▢ 1 tablespoon soy sauce",
      "▢ 3 tablespoons cooking oil",
      "▢ ½ cup beef stock",
      "▢ 8 grams Maggi Magic Sarap",
      "▢ 2 tablespoons soy sauce",
      "▢ 1 ½ tablespoons oyster sauce",
      "▢ ¼ teaspoon baking soda",
      "▢ 2 teaspoons cornstarch",
      "▢ ¼ teaspoon ground black pepper",
      "▢ 1 tablespoon cooking oil"
    ],
    "instructions": [
      "Combine the sliced beef and all the marinade ingredients in a bowl. After that, mix everything well. Set aside for 12 minutes.2 tablespoons soy sauce, 1 ½ tablespoons oyster sauce, ¼ teaspoon baking soda, 2 teaspoons cornstarch, ¼ teaspoon ground black pepper, 1 tablespoon cooking oil, 1 lb. beef top sirloin",
      "Meanwhile, start to partially cook the vegetables. Heat 2 tablespoons of oil in a wide pan. Stir fry the cabbage, snap peas, carrot, and bell pepper for 1 minute. Sprinkle some salt to flavor it and then pour ¼ cup of beef broth. Cover the pan and let the liquid boil. Continue steaming for 1 minute. Then remove the cover of the pan. Let the remaining liquid evaporate. Set the vegetables aside.½ head cabbage, 2 carrots, 1 red bell pepper, 2 cups snap peas, 3 tablespoons cooking oil, 8 grams Maggi Magic Sarap, ½ cup beef stock",
      "Heat the remaining oil on the same pan. Once the oil gets hot, stir-fry the marinated beef until the outside part turns light brown.3 tablespoons cooking oil",
      "Add the minced garlic, white part of the green onion, and sliced onions. Continue to stir-fry until the onion softens.5 cloves garlic, 3 stems  green onion, 1 yellow onion",
      "Add the stir-fried vegetables. Then toss to distribute the ingredients evenly.",
      "Pour 1 tablespoon soy sauce and remaining beef broth. Stir and continue cooking until the sauce thickens.1 tablespoon soy sauce, ½ cup beef stock",
      "Season with Maggi Magic Sarap as needed.8 grams Maggi Magic Sarap",
      "Transfer to a serving plate. Share and enjoy!"
    ],
    "cooking_time": "N/A",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/beef-chop-suey/",
    "image_url": "",
    "image_path": "",
    "category": "Other Filipino Dishes"
  },
  {
    "title": "Mie Goreng",
    "ingredients": [
      "▢ 230 grams Egg Noodles",
      "▢ 4 ounces chicken breast sliced into serving pieces",
      "▢ 3 ounces shrimp deveined and shells removed",
      "▢ 3 eggs beaten",
      "▢ 1 ¼ cup mung bean sprouts",
      "▢ 3 green onions cut into 2-inch pieces",
      "▢ 3 baby bok choy chopped",
      "▢ 5 cloves garlic minced",
      "▢ 1 quart water",
      "▢ 4 tablespoons cooking oil",
      "▢ 3 tablespoons kecap manis",
      "▢ 3 tablespoons soy sauce",
      "▢ 1 tablespoon Oyster Sauce",
      "▢ 2 tablespoons tomato ketchup",
      "▢ 2 teaspoons sambal oelek",
      "▢ 2 teaspoons Sesame Oil"
    ],
    "instructions": [
      "Start by mixing all the sauce ingredients and set aside.3 tablespoons kecap manis, 3 tablespoons soy sauce, 1 tablespoon Oyster Sauce, 2 tablespoons tomato ketchup, 2 teaspoons sambal oelek, 2 teaspoons Sesame Oil",
      "Boil 1 quart of water in a wok. Add Good Life Egg Noodles. Continue boiling while gently stirring for 2 minutes.230 grams Egg Noodles, 1 quart water",
      "Discard the water. Set the noodles aside.",
      "Heat 2 tablespoons of cooking oil. Pour the beaten eggs. Cook the eggs until they become firm. 4 tablespoons cooking oil, 3 eggs",
      "Cut them into pieces using the tip of your spatula or cooking spoon. Set aside.",
      "Heat the remaining oil in the same pan. Add the garlic. Sauté until it starts to brown.5 cloves garlic",
      "Add the sliced chicken. Continue sautéing for 2 minutes.4 ounces chicken breast",
      "Add the shrimp. Stir-fry for 1 minute.3 ounces shrimp",
      "Add the green onions, bok choy, and mung bean sprouts. Cook this for 1 minute.3 green onions, 3 baby bok choy, 1 ¼ cup mung bean sprouts",
      "Stir in the cooked Good Life Egg Noodles. Toss.",
      "Pour the sauce mixture into the wok. Toss again until all the ingredients are well blended.",
      "Transfer to a serving plate. Share and enjoy!"
    ],
    "cooking_time": "N/A",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/mie-goreng/",
    "image_url": "",
    "image_path": "",
    "category": "Chicken Dishes"
  },
  {
    "title": "Batangas Kaldereta",
    "ingredients": [
      "▢ 3 lbs beef chuck sliced into 1 ½ inch cubes",
      "▢ 3 pcs red onions chopped",
      "▢ 8 cloves garlic chopped",
      "▢ 3 oz liver spread",
      "▢ 2 tbsp peanut butter optional",
      "▢ 1/4 cup cheddar cheese shredded",
      "▢ 3 tbsp sweet pickle relish",
      "▢ 1 tsp annatto powder",
      "▢ 1 tbsp  beef powder",
      "▢ 3 pcs Thai chili pepper chopped",
      "▢ 1/4 cup  soy sauce",
      "▢ 3 tbsp Worcestershire sauce",
      "▢ 4 cups water",
      "▢ 3 tbsp margarine",
      "▢ 2 tbsp  breadcrumbs",
      "▢ salt to taste",
      "▢ ground black pepper to taste"
    ],
    "instructions": [
      "Combine the beef and soy sauce in a bowl. Mix well. Marinate for 30 minutes.3 lbs beef chuck, 1/4 cup  soy sauce",
      "Melt the margarine in a pan. Add the annatto powder and stir.1 tsp annatto powder, 3 tbsp margarine",
      "Add the garlic and sauté until it starts to brown. Add the onion and continue to sauté until it becomes soft. 8 cloves garlic, 3 pcs red onions",
      "Add the marinated beef. Sauté until the outer part turns light brown. Make sure to stir frequently while cooking to ensure that all sides are cooked evenly.",
      "Add the Worcestershire sauce and pickle relish. Cook for 2 minutes.3 tbsp Worcestershire sauce, 3 tbsp sweet pickle relish",
      "Pour in the water and let it boil.4 cups water",
      "Add the beef powder. Stir and cover the pan. Simmer until the beef becomes tender. 1 tbsp  beef powder",
      "Add the liver spread, peanut butter (optional), cheese, and chili peppers. Stir until the sauce smoothens. The sauce will thicken partially after a few minutes. 2 tbsp peanut butter, 1/4 cup cheddar cheese, 3 pcs Thai chili pepper, 3 oz liver spread",
      "Continue cooking on low heat for 5 minutes. Make sure to stir occasionally to prevent the sauce and meat from sticking to the bottom of the pan.",
      "Add the breadcrumbs. This ingredient will make the sauce thicker.2 tbsp  breadcrumbs",
      "Season with salt and ground black pepper.ground black pepper to taste, salt to taste",
      "Serve and dig in!"
    ],
    "cooking_time": "N/A",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/batangas-kaldereta/",
    "image_url": "",
    "image_path": "",
    "category": "Main Dishes"
  },
  {
    "title": "Burger Steak Sardinas",
    "ingredients": [
      "▢ 2 cans  sardines in tomato sauce",
      "▢ 1 banana blossoms minced",
      "▢ 1 egg",
      "▢ ½ cup all-purpose flour",
      "▢ 1 teaspoon onion powder",
      "▢ ½ teaspoon garlic powder",
      "▢ ½ teaspoon salt",
      "▢ ¼ teaspoon ground black pepper",
      "▢ ¼ cup cooking oil",
      "▢ 2 tablespoons butter",
      "▢ 5 tablespoons all-purpose flour",
      "▢ 1 cup milk",
      "▢ 1 teaspoon onion powder",
      "▢ Salt and ground black pepper to taste"
    ],
    "instructions": [
      "Arrange the minced banana blossom in a bowl. Add 1 tablespoon of salt. Rub it all over. Wash the salt off and drain the excess water.1 banana blossoms",
      "Separate the sardines from the sauce. Combine the sardines and banana heart. Add 1 egg, ½ teaspoon garlic powder, 1 teaspoon onion powder, ½ teaspoon salt, and ¼ teaspoon ground black pepper. Mix everything together while mashing the sardines in the process.2 cans  sardines in tomato sauce, 1 egg, 1 teaspoon onion powder, ½ teaspoon garlic powder, ½ teaspoon salt, ¼ teaspoon ground black pepper",
      "Gradually add all-purpose flour. Continue mixing until the mixture becomes firm.½ cup all-purpose flour",
      "Scoop around ¼ cup of the mixture and shape it into patties. Set aside.",
      "Make the gravy by melting the butter in a saucepan. Add all-purpose flour. Stir while cooking until lumps form and the mixture turns medium brown in color. Add the sauce from the canned sardines and half of the amount of milk while constantly stirring. Add more milk as needed until your desired consistency is achieved. Season with onion powder, salt, and ground black pepper. Set aside.2 tablespoons butter, 5 tablespoons all-purpose flour, 1 teaspoon onion powder, Salt and ground black pepper to taste, 1 cup milk",
      "Meanwhile, heat 2 tablespoons of cooking oil in a clean pan. Fry the burger patties in medium heat until it browns. Do the same thing on the opposite side.¼ cup cooking oil",
      "Arrange the sardines burger steak on a plate and then top with the gravy.",
      "Serve this with rice. Share and enjoy!"
    ],
    "cooking_time": "N/A",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/burger-steak-sardinas/",
    "image_url": "",
    "image_path": "",
    "category": "Other Filipino Dishes"
  },
  {
    "title": "Kung Pao Chicken Recipe",
    "ingredients": [
      "▢ 1 ½ lbs boneless chicken thigh diced",
      "▢ 1 tablespoon soy sauce",
      "▢ 1 tablespoon Shaoxing cooking wine",
      "▢ 2 teaspoons cornstarch",
      "▢ A pinch of salt",
      "▢ 8 pieces dried chilies",
      "▢ 1 tablespoon ginger  minced",
      "▢ 4 cloves garlic minced",
      "▢ 5 stems  green onions chopped",
      "▢ 1 zucchini diced",
      "▢ 1 red bell pepper  diced",
      "▢ 1/2 roasted peanuts",
      "▢ 3 tablespoons cooking oil",
      "▢ 2 tablespoons soy sauce",
      "▢ 1 tablespoon dark soy sauce",
      "▢ 1 tablespoon rice vinegar",
      "▢ 1 tablespoon honey",
      "▢ 2 tablespoons Shaoxing cooking wine",
      "▢ 1 teaspoons cornstarch",
      "▢ 1/2 cup chicken stock"
    ],
    "instructions": [
      "Combine chicken, 1 tablespoon soy sauce,1 tablespoon Shaoxing rice wine, 2 teaspoons cornstarch, and a pinch of salt in a bowl. Mix well. Set aside.",
      "Combine all the kung pao sauce ingredients in a separate bowl. Mix well. Set aside.",
      "Start to stir fry by heating 3 tablespoons of cooking oil in a wok. Add the dried chilies. Stir fry for 5 seconds.",
      "Add the marinated chicken. Stir fry for 2 minutes.",
      "Add the garlic, white part of the green onion, and ginger. Continue to stir fry for 20 seconds before adding the bell pepper, zucchini, and peanuts, and remaining green onions. Stir fry for 45 seconds to 1 minute.",
      "Pour the sauce into the wok. Stir fry until the chicken is coated evenly. Note: you can add around 1 to 3 tablespoons of water (as needed) while stir frying to prevent the sauce from clumping.",
      "Transfer to a serving plate. Serve with rice.",
      "Share and enjoy!"
    ],
    "cooking_time": "N/A",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/kung-pao-chicken-recipe/",
    "image_url": "",
    "image_path": "",
    "category": "Chicken Dishes"
  },
  {
    "title": "Crispy Garlic Fried Chicken Wings",
    "ingredients": [
      "▢ 2 lbs. chicken wings",
      "▢ 1 egg beaten",
      "▢ 1 tablespoon cornstarch",
      "▢ 2 tablespoons all-purpose flour",
      "▢ 2 cups cooking oil",
      "▢ 2 teaspoons garlic powder",
      "▢ 2 teaspoons onion powder",
      "▢ 1 teaspoon paprika",
      "▢ 1 head garlic crushed",
      "▢ ½ teaspoon ground white pepper",
      "▢ ¾ teaspoon salt",
      "▢ 2 tablespoons soy sauce",
      "▢ ¾ cup mayonnaise",
      "▢ ¾ cup sour cream",
      "▢ 1 teaspoon dill chopped",
      "▢ 1/2 teaspoon parsley chopped",
      "▢ 1/4 teaspoon garlic powder",
      "▢ 1/8 teaspoon onion powder",
      "▢ 1/4 teaspoon kosher salt adjust to taste",
      "▢ 1/8 teaspoon freshly ground black pepper",
      "▢ 1 lime"
    ],
    "instructions": [
      "Combine the chicken with all the marinade ingredients. Mix well. Refrigerate for at least 1 hour.2 lbs. chicken wings, 2 teaspoons garlic powder, 1 teaspoon paprika, 1 head garlic, ½ teaspoon ground white pepper, ¾ teaspoon salt, 2 tablespoons soy sauce, 2 teaspoons onion powder",
      "Meanwhile, make the white sauce by combining all the sauce ingredients in a bowl. Stir to mix everything together. Set aside.¾ cup mayonnaise, ¾ cup sour cream, 1 teaspoon dill, 1/2 teaspoon parsley, 1/4 teaspoon garlic powder, 1/8 teaspoon onion powder, 1/4 teaspoon kosher salt, 1/8 teaspoon freshly ground black pepper, 1 lime",
      "Add beaten egg. Distribute it all over the chicken pieces.1 egg",
      "Gradually add the cornstarch and all-purpose flour. Continue mixing until all the ingredients are well incorporated. Set aside.1 tablespoon cornstarch, 2 tablespoons all-purpose flour",
      "Heat 2 cups of cooking oil in a wok.2 cups cooking oil",
      "Once the temperature reaches 350F, add the chicken wings one piece at a time. Adjust the heat to medium setting. Continue frying for 8 to 10 minutes or until the chicken turns golden brown. Remove from the wok and let the chicken cool down for 10 to 12 minutes.",
      "Put the fried chicken wings back into the wok and continue frying for 1 minute.",
      "Transfer to a serving plate. Serve with white sauce on the side.",
      "Share and enjoy!"
    ],
    "cooking_time": "N/A",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/crispy-garlic-fried-chicken-wings/",
    "image_url": "",
    "image_path": "",
    "category": "Chicken Dishes"
  },
  {
    "title": "Sarciadong Pechay",
    "ingredients": [
      "▢ 3 bunches pechay",
      "▢ 2 eggs beaten",
      "▢ 2 tomatoes",
      "▢ 5 cloves garlic minced",
      "▢ 1 onion minced",
      "▢ 1 cup water",
      "▢ 2 tablespoons cooking oil",
      "▢ Fish sauce and ground black pepper to taste"
    ],
    "instructions": [
      "Heat oil in a pan. Sauté garlic, onion, and tomatoes.",
      "Add the pechay. Sauté for 20 seconds and then pour water. Let it boil.",
      "Gently pour the beaten egg around the pan. Stir and continue cooking until the eggs start to solidify.",
      "Season with fish sauce and ground black pepper. Serve with rice.",
      "Share and enjoy!"
    ],
    "cooking_time": "N/A",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/sarciadong-pechay/",
    "image_url": "",
    "image_path": "",
    "category": "Seafood"
  }
]