[
  {
    "title": "Crispy Baked Yukon Gold Potato Wedges",
    "ingredients": [
      "▢ 2 lbs. Yukon Gold potato sliced into thin wedges",
      "▢ 3 tablespoons olive oil",
      "▢ 3/4 cup regular bread crumbs",
      "▢ 1 1/2 teaspoons dried oregano flakes",
      "▢ 1 teaspoon garlic powder",
      "▢ 1 teaspoon onion powder",
      "▢ 1 teaspoon paprika",
      "▢ 1 teaspoon sea salt"
    ],
    "instructions": [
      "Preheat the oven to 430F.",
      "Arrange the potato wedges in a mixing bowl. Pour the olive oil over the potato. Mix well and ensure that the oil coats every potato wedge.",
      "",
      "On a separate bowl, combine bread crumbs, paprika, salt, garlic and onion powder, and oregano. Mix well.",
      "",
      "Pour the bread crumb mixture over the potato. Shake the bowl and ensure that the potato are covered with the breadcrumb mixture.",
      "",
      "Arrange an aluminum foil over a baking tray. Grease with cooking oil spray. Lay the potato over the foil. Bake for 35 to 40 minutes.",
      "",
      "Remove from the oven and let it cool down. transfer to a serving plate.",
      "",
      "Serve. Share and enjoy!"
    ],
    "cooking_time": "45 minutes",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/crispy-baked-yukon-gold-potato-wedges/",
    "image_url": "",
    "image_path": "",
    "category": "Other Filipino Dishes"
  },
  {
    "title": "Easy Sweet and Sour Sauce",
    "ingredients": [
      "▢ 3 cups water",
      "▢ 1/2 cup brown sugar",
      "▢ 1/2 cup tomato ketchup",
      "▢ 1 1/4 cup chopped fresh pineapple",
      "▢ 1/4 cup white vinegar",
      "▢ 1 small yellow onion sliced",
      "▢ 1 small red bell pepper chopped",
      "▢ 1 small green bell pepper chopped",
      "▢ 1 1/2 tablespoon cornstarch diluted in 2 tablespoons water"
    ],
    "instructions": [
      "Pour water in a saucepan. Bring to a boil.",
      "Add sugar, ketchup, and vinegar. Let the mixture boil once more. Stir using a small ladle.",
      "Add the pineapple, onion, and bell peppers. Cover and simmer for 12 to 15 minutes.",
      "Pour-in the cornstarch diluted in water. Stir.",
      "Once the texture gets thick, turn off the heat. Transfer the sauce to a bowl or gravy boat. You can also let it cool down and secure in ball jars. This can be refrigerated or placed in the freezer for future use.",
      "Enjoy!"
    ],
    "cooking_time": "20 minutes",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/easy-sweet-and-sour-sauce/",
    "image_url": "",
    "image_path": "",
    "category": "Other Filipino Dishes"
  },
  {
    "title": "Basil Pork Recipe",
    "ingredients": [
      "▢ 1 lb. ground pork",
      "▢ 3 tablespoons dark soy sauce",
      "▢ 1 tablespoon minced garlic",
      "▢ 1 tablespoon miced chili peppers birds eye chili",
      "▢ 1 teaspoon granulated white sugar",
      "▢ 1 cup fresh holy basil leaves removed from the stem",
      "▢ 1/2 cup sliced red and green bell peppers combined",
      "▢ 2 1/2 tablespoons fish sauce",
      "▢ 3 tablespoons cooking oil"
    ],
    "instructions": [
      "Heat the cookinf oil in a wok. Once the oil gets hot, add the garlic and chili.Stir and cook until the garlic turns medium brown.",
      "Add the ground pork. Stir-fry for 2 to 5 minutes or until the pork turns light brown.",
      "Pour-in the soy sauce and fish sauce. Continue to stir-fry.",
      "Add the sugar, holy basil, and bell peppers. Stir-fry for 3 to 6 minutes.",
      "Arrange in a plate with rice and fried egg.",
      "Serve. share and enjoy!"
    ],
    "cooking_time": "25 minutes",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/basil-pork-recipe/",
    "image_url": "",
    "image_path": "",
    "category": "Pork Dishes"
  },
  {
    "title": "Pork BBQ Fried Rice",
    "ingredients": [
      "▢ 4 cups leftover white rice preferably refrigerated",
      "▢ ½ lb. char siu pork bbq, sliced",
      "▢ 2 eggs beaten",
      "▢ 3 tablespoons light soy sauce",
      "▢ ¼ teaspoon sesame oil",
      "▢ 1 teaspoon sea salt",
      "▢ ½ teaspoon garlic powder",
      "▢ ½ teaspoon onion powder",
      "▢ ½ cup chopped green onions",
      "▢ 4 tablespoons cooking oil"
    ],
    "instructions": [
      "Put the leftover rice in a large mixing bowl. Make sure that the grains are not sticking to each other.",
      "Add the salt, garlic powder, and onion powder in the mixing bowl. Gently mix all the ingredients using a large spoon until well blended.",
      "Meanwhile, heat half of the cooking oil in a wide pan.",
      "Once the oil gets hot, pour the beaten eggs on the pan. Cook each side for 1 minute. Remove the egg from the pan and place in a plate. Set aside.",
      "Add the remaining cooking oil. Once the oil gets hot, add the sliced char siu (pork bbq) in the pan. Cook for 30 seconds to 1 minute.",
      "Add the rice mixture. Try to fold the rice once in a while using a spatula. Continue to cook for 5 to 8 minutes.",
      "Pour the soy sauce and sesame oil over the rice. Quickly fold the rice to distribute the liquid ingredients evenly. Cook for 3 to 5 minutes.",
      "Put the cooked egg over the rice. Using the tip of a spatula, divide the eggs into multiple pieces by slicing into it. Continue to fold so that the egg gets distributed equally.",
      "Add the green onions. Stir and cook for 2 minutes.",
      "Transfer to a serving plate. Serve!",
      "Share and enjoy!"
    ],
    "cooking_time": "35 minutes",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/pork-bbq-fried-rice/",
    "image_url": "",
    "image_path": "",
    "category": "Pork Dishes"
  },
  {
    "title": "Ground Pork Kaldereta Omelet",
    "ingredients": [
      "▢ 1 ½ cups pork giniling kaldereta",
      "▢ 3 eggs",
      "▢ ¼ teaspoon salt",
      "▢ ½ teaspoon onion powder",
      "▢ A dash of ground black pepper",
      "▢ 4 tablespoons cooking oil"
    ],
    "instructions": [
      "Crack eggs in a bowl. Whisk using a wire whisk of fork.",
      "Add the salt, pepper, and onion powder. Continue to whisk until all the ingredients are well blended.",
      "Add the Pork Giniling Kaldereta. Stir until it is incorporated with the mixture. Set aside",
      "Heat the oil in a frying pan. Once the oil gets hot, scoop half of the mixture and pour it on the pan. Cook in medium heat for 3 minutes.",
      "Using a wide spatula, turn the omelet over. Cook the opposite side for 2 to 3 minutes or until it is done. Do the same steps for the remaining mixture.",
      "Transfer to a serving plate. Serve with Ketchup.",
      "Enjoy with toast for breakfast or with white rice for lunch."
    ],
    "cooking_time": "11 minutes",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/ground-pork-kaldereta-omelet/",
    "image_url": "",
    "image_path": "",
    "category": "Main Dishes"
  },
  {
    "title": "Pinoy Style Fried Chicken",
    "ingredients": [
      "▢ 3 to 4 lbs. chicken cut into serving pieces",
      "▢ 2 1/2 tablespoons coarse sea salt",
      "▢ 1/2 teaspoon ground black pepper",
      "▢ 2 teaspoons garlic powder",
      "▢ 1 teaspoon onion powder",
      "▢ 3/4 cup all-purpose flour",
      "▢ 1 1/2 cooking oil"
    ],
    "instructions": [
      "Combine salt, ground black pepper, garlic powder, and onion powder in a large mixing bowl.",
      "Arrange the chicken slices in the same mixing bowl. Rub the salt mixture all over the chicken ensuring that each piece is well covered. Cover the bowl. Refrigerate for 3 to 5 hours.",
      "Heat the cooking oil in a pan.",
      "Meanwhile, put the flour in a resealable bag. Add 2 to 3 pieces of chicken in the bag. Seal and shake. Make sure that the chicken pieces are covered will flour.",
      "Once the oil gets hot, pan-fry the chicken in medium heat for 5 minutes. Turn the chicken over and fry the other side for 5 minutes.",
      "Turn the chicken over for the second time and fry both sides again for 4 minutes.",
      "Remove the chicken from the pan. Let the excess oil drip, then transfer to a serving plate.",
      "Serve with banana ketchup and white rice.",
      "Share and enjoy!"
    ],
    "cooking_time": "35 minutes",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/pinoy-style-fried-chicken/",
    "image_url": "",
    "image_path": "",
    "category": "Chicken Dishes"
  },
  {
    "title": "Drunken Mussels Recipe",
    "ingredients": [
      "▢ 2 1/2 lbs. mussels cleaned",
      "▢ 2 cups white wine Pinot Grigio",
      "▢ 3 teaspoons minced garlic",
      "▢ 1/4 cup butter",
      "▢ 1/4 teaspoon salt",
      "▢ 1/4 cup chopped parsley",
      "▢ 1 lime wedged"
    ],
    "instructions": [
      "Melt butter in a pan.",
      "Once the butter melts and starts to get hot, add the garlic. Continue to cook in low to medium heat until the garlic turns light brown. Do not cook in high heat because the butter can get burnt.",
      "Pour-in the white wine. Let boil. Continue to cook and liquid evaporate until it reduces to half.",
      "Add the mussels. Stir. Cover and cook for 10 minutes in medium heat.",
      "Add salt and chopped parsley. Stir. Cook for 2 minutes.",
      "Transfer to a serving plate. Serve with lime wedges.",
      "Share and enjoy."
    ],
    "cooking_time": "28 minutes",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/drunken-mussels-recipe/",
    "image_url": "",
    "image_path": "",
    "category": "Other Filipino Dishes"
  },
  {
    "title": "Pork Giniling Kaldereta Recipe",
    "ingredients": [
      "▢ 1 1/2 lbs. ground pork",
      "▢ 1 8 oz. can tomato sauce",
      "▢ 1 small red bell pepper chopped",
      "▢ 1 small green bell pepper chopped",
      "▢ 1/2 cup carrots cubed",
      "▢ 1/4 cup liver spread",
      "▢ 1/4 cup green olives",
      "▢ 1 piece pork cube",
      "▢ 1/2 cup water",
      "▢ 3 tablespoons cooking oil",
      "▢ 1 small yellow onion chopped",
      "▢ 4 cloves garlic crushed and chopped",
      "▢ 1/2 teaspoon crushed red pepper flakes",
      "▢ salt and pepper to taste"
    ],
    "instructions": [
      "Heat oil in a pan or cooking pot.",
      "Once the oil turns hot, saute the garlic and onion.",
      "Let the onion get soft then add the ground pork. Cook while stirring once in a while until the pork turns light to medium brown.",
      "Add the pork cube and liver spread. Stir and cook for 5 minutes.",
      "Pour-in the tomato sauce. Stir. Add water and cover. Simmer for 15 to 20 minutes.",
      "Add crushed red peppers, carrots and olives. Cook for 7 minutes.",
      "Stir-in the bell peppers. Cook for 5 minutes.",
      "Add salt and pepper to taste. Stir and continue to cook until the liquid evaporates.",
      "Transfer to a serving bowl. Serve with white rice.",
      "Share and enjoy!"
    ],
    "cooking_time": "50 minutes",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/pork-giniling-kaldereta-recipe/",
    "image_url": "",
    "image_path": "",
    "category": "Main Dishes"
  },
  {
    "title": "Egg Sandwich Spread Recipe",
    "ingredients": [
      "▢ 6 hard boiled eggs",
      "▢ 1/4 cup mayonnaise",
      "▢ 1/4 cup sweet pickle relish",
      "▢ 1 teaspoon white sugar",
      "▢ 1/2 teaspoon dry mustard powder",
      "▢ 1/2 teaspoon onion powder",
      "▢ 1/2 teaspoon salt",
      "▢ 1/8 teaspoon ground black pepper optional"
    ],
    "instructions": [
      "Place the eggs in a bowl. Mash using a fork.",
      "Add mayonnaise, sugar, mustard powder, onion powder, salt, and pepper. Fold until all the ingredients are well blended.",
      "Add the sweet pickle relish. Fold once more until the pickles blends with the other ingredients.",
      "Transfer in a container. Refrigerate for 1 hour, or you can use it immediately. Spread over your favorite slice of bread.",
      "Share. Share and enjoy!"
    ],
    "cooking_time": "15 minutes",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/egg-sandwich-spread-recipe/",
    "image_url": "",
    "image_path": "",
    "category": "Other Filipino Dishes"
  },
  {
    "title": "Dried Squid in Coconut Milk",
    "ingredients": [
      "▢ 1/2 lb. large dried squid",
      "▢ 2 cups coconut cream",
      "▢ 3 pieces long green chilies sliced",
      "▢ 1 teaspoon minced garlic",
      "▢ 1 tablespoon minced ginger",
      "▢ 1 medium onion minced",
      "▢ 2 tablespoons fish sauce",
      "▢ 1/4 teaspoon ground black pepper",
      "▢ 1 bunch fresh spinach"
    ],
    "instructions": [
      "Heat-up the grill. Once the grill gets hot, grill one side of the squid for 3 minutes. The squid will curl-up, try to straighten the other side (if possible) and grill for 1 to 2 minutes. Set aside.",
      "Arrange the coconut cream, ginger, onion, garlic, green chillies, squid, ground black pepper, and fish sauce in a slow cooker. Set the slow cooker to high, cover and slow cook the squid for 8 hours.",
      "Add the spinach. Cook for 10 to 15 minutes.",
      "Transfer to a serving bowl. Serve. Share and enjoy!"
    ],
    "cooking_time": "13 minutes",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/dried-squid-in-coconut-milk/",
    "image_url": "",
    "image_path": "",
    "category": "Seafood"
  },
  {
    "title": "Oven Roasted BBQ Chicken Recipe",
    "ingredients": [
      "▢ 1 whole chicken cut into quarters",
      "▢ 1/4 cup light soy sauce",
      "▢ 1 teaspoon paprika",
      "▢ 1/2 teaspoon ground black pepper",
      "▢ 1 teaspoon salt",
      "▢ 1 teaspoon garlic powder",
      "▢ 2 tablespoons canola oil",
      "▢ juice from 1 small lemon",
      "▢ 1 1/4 cups barbecue sauce use your preferred brand"
    ],
    "instructions": [
      "Prepare the marinade by combine soy sauce, oil, garlic powder. paprika, lemon, salt, and pepper in a bowl. Stir until all the ingredients are well blended.",
      "Arrange the chicken quarters in a resealable bag. Pour-in the marinade. Let the air out of the bag, seal, and marinate the chicken overnight. Place the bag in the fridge and let it stay for 12 to 16 hours. This will let the chicken absorb the flavor.",
      "Preheat your oven to 375F.",
      "Top a baking tray with aluminum foil and geese it with 1 tablespoon of cooking oil or spray with a cooking oil spray. Arrange the chicken on top of the greased foil. Bake in the oven for 18 minutes.",
      "Baste the chicken with half of the barbecue sauce. Continue to bake for 12 minutes.",
      "Baste the chicken with the remaining half of the bbq sauce. Bake for 8 to 10 minutes or until the chicken is completely cooked. You can also use a meat thermometer to ensure that the chicken is done. The internal temperature of the chicken should be at least 165F.",
      "Remove the oven roasted bbq chicken from the oven. Arrange in a serving plate.",
      "Serve with either of the following: cornbread muffins, cornbread, rice, or potato wedges. Share and enjoy!"
    ],
    "cooking_time": "50 minutes",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/oven-roasted-bbq-chicken-recipe/",
    "image_url": "",
    "image_path": "",
    "category": "Chicken Dishes"
  }
]