[
  {
    "title": "Sizzling Tofu Sisig",
    "ingredients": [
      "▢ 19 oz firm tofu",
      "▢ 1 red onion chopped",
      "▢ 2 tablespoons red bell pepper chopped",
      "▢ 2 tablespoons liver spread",
      "▢ ½ cup green onion chopped",
      "▢ ¼ cup cooking oil",
      "▢ ½ cup Lady’s Choice Mayonnaise",
      "▢ 1 Tablespoon Knorr Liquid Seasoning",
      "▢ ½ teaspoon onion powder",
      "▢ 1 teaspoon lemon juice"
    ],
    "instructions": [
      "Prepare the tofu. Squeeze the liquid out by pressing against a flat surface. Zip it inside a resealable bag and freeze overnight. Thaw the tofu and press again to remove the remaining liquid.",
      "Heat the oil in a pan. Fry the tofu until golden brown and crispy. Do the same step on the opposite side. Remove tofu from the pan and let it cool down. Chop into small pieces.",
      "Make the dressing by combining all the dressing ingredients in a bowl. Mix well. Set aside.",
      "Saute onion until it softens. Add tofu and liver spread. Cook for 1 minute.",
      "Add the bell pepper and dressing mixture. Stir until all ingredients are coated. Set aside.",
      "Heat a metal plate (sizzling plate) and add butter. Transfer the tofu sisig into the metal plate.",
      "Serve as an appetizer or a main dish. Share and enjoy!"
    ],
    "cooking_time": "N/A",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/sizzling-tofu-sisig/",
    "image_url": "",
    "image_path": "",
    "category": "Pork Dishes"
  },
  {
    "title": "Creamy Macaroni Salad",
    "ingredients": [
      "▢ 1 lb. elbow macaroni",
      "▢ 350 ML Lady’s Choice Mayonnaise",
      "▢ 8 ounces ham diced",
      "▢ 8 ounces chicken breast boiled and shredded",
      "▢ ½ cup pineapple chunks",
      "▢ 1 carrot minced",
      "▢ 2 stalks  celery chopped",
      "▢ 2 Tablespoons sweet pickle relish",
      "▢ 1 Tablespoon onion minced",
      "▢ ½ cup cheddar cheese shredded",
      "▢ 1 teaspoon sugar",
      "▢ 1 Tablespoon parsley chopped",
      "▢ Salt and ground black pepper to taste"
    ],
    "instructions": [
      "Cook the macaroni based on package instructions. Set aside.",
      "Make the dressing by combining all the dressing ingredients in a large mixing bowl. Mix well.",
      "Add the cooked macaroni. Toss until the macaroni is coated with the dressing.",
      "Chill by placing the bowl inside the refrigerator for at least 1 hour.",
      "Serve and enjoy with your family."
    ],
    "cooking_time": "N/A",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/creamy-macaroni-salad/",
    "image_url": "",
    "image_path": "",
    "category": "Chicken Dishes"
  },
  {
    "title": "Pan Fried Noodles with Beef and Veggies",
    "ingredients": [
      "▢ 14 ounces egg noodles",
      "▢ ½ lb. beef sliced into thin pieces",
      "▢ ¼ cup green onion chopped",
      "▢ 3 bunches bok choy",
      "▢ ½ cup carrots Julienne",
      "▢ 1 onion sliced",
      "▢ 2 cloves garlic minced",
      "▢ 1 teaspoon minced ginger",
      "▢ 5 tablespoons cooking oil",
      "▢ 3 ½ Tablespoons oyster sauce",
      "▢ 2 teaspoons sesame oil",
      "▢ 1 teaspoon sugar",
      "▢ 2 Tablespoons soy sauce",
      "▢ 3 Tablespoons Shaoxing cooking wine",
      "▢ 1 ½ cups water",
      "▢ 3 teaspoons cornstarch",
      "▢ 1/8 teaspoon ground white pepper"
    ],
    "instructions": [
      "Prepare the noodles based on package instructions. Discard remaining water.",
      "Heat 2 tablespoons of cooking oil in a pan. Add the noodles. Fry until the bottom part turns light brown. Continue by frying the opposite side (Note: if necessary, do this in 2 batches). Remove the noodles from the pan and arrange on a serving dish.",
      "Combine all the sauce ingredients in a bowl. Mix well. Set aside.",
      "Heat remaining oil on the same pan. Stir fry the beef until it browns. Add onion, ginger, and garlic. Cook until onion softens.",
      "Add green onion and bok choy. Cook for 1 minute.",
      "Pour the sauce mixture into the pan. Stir. Continue cooking until the sauce thickens to your desired consistency.",
      "Pour everything over the fried noodles. Serve hot.",
      "Share and enjoy!"
    ],
    "cooking_time": "N/A",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/pan-fried-noodles-with-beef-and-veggies/",
    "image_url": "",
    "image_path": "",
    "category": "Other Filipino Dishes"
  },
  {
    "title": "Callos Recipe",
    "ingredients": [
      "▢ 1 1/2 lb ox feet veal shanks, cleaned",
      "▢ 2 lbs ox tripe cleaned",
      "▢ 15 ounces chick peas garbanzo beans",
      "▢ 8 ounces tomato sauce",
      "▢ 2 chorizo de bilbao sliced",
      "▢ 1/4 lb bacon sliced crosswise in 1 inch length",
      "▢ 1 bell pepper cut into thick strips",
      "▢ 1 onions sliced",
      "▢ 1/4 cup extra virgin olive oil EVOO",
      "▢ 1 teaspoon salt",
      "▢ 1/2 teaspoon ground black pepper",
      "▢ 1 carrot cubed",
      "▢ 1 teaspoon whole peppercorn",
      "▢ 4 cups water"
    ],
    "instructions": [
      "Pour water in a casserole or cooking pot and bring to a boil.",
      "Put-in the onion, whole peppercorn, ox feet, and ox tripe. Simmer until the ox feet and tripe are extremely tender (you may use a slow cooker or pressure cooker for this step).",
      "Remove the ox feet and tripe from the cooking pot and let it cool down for a few minutes. Set the stock aside for later use.",
      "Cut the ox tripe into bite size pieces and debone the ox feet. Set aside.",
      "Heat a large wok or pan then pour-in the olive oil.",
      "Add chorizo de bilbao and bacon then cook in medium heat for 5 to 8 minutes.",
      "Pour-in the tomato sauce then let boil.",
      "Add the tender ox feet and tripe and 2 cups of stock (water used to boil ox feet and ox tripe) then simmer for 10 minutes.",
      "Add salt and pepper then put-in the carrots. Simmer for 3 minutes.",
      "Put-in the chick peas and bell pepper then simmer for 10 minutes.",
      "Transfer to a serving dish.",
      "Serve hot. Share and enjoy!"
    ],
    "cooking_time": "2 hours",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/ox-tripe-stew-callos-recipe/",
    "image_url": "",
    "image_path": "",
    "category": "Other Filipino Dishes"
  },
  {
    "title": "Beef Stroganoff Lasagna",
    "ingredients": [
      "▢ 1 lb beef sirloin",
      "▢ 8 ounces lasagna",
      "▢ 1 onion sliced",
      "▢ 2 cups chopped mushroom",
      "▢ 3 tablespoons butter",
      "▢ 8 ounces mozzarella cheese",
      "▢ 1 pack 68 grams Knorr Cream of Mushroom",
      "▢ 2 teaspoons paprika",
      "▢ ½ cup sour cream",
      "▢ 2 ½ cups water"
    ],
    "instructions": [
      "Cook lasagna based on package instructions. Set aside.",
      "Make the sauce by melting the butter in a pan. Add beef sirloin and then cook until it turns light brown.",
      "Add onion and mushroom. Continue sauteeing for 3 minutes.",
      "Combine Knorr Cream of Mushroom with 2 ½ cups water. Stir until well blended. Pour the mixture into the pan. Stir and cook until the sauce thickens.",
      "Add paprika. Cook for another 3 minutes.",
      "Turn the heat off and then add sour cream. Stir to mix all the ingredients.",
      "Preheat the oven to 350F. Assemble the lasagna in the baking pan starting with the stroganoff followed by the lasagna. Top with mozzarella. Continue with the pattern until all ingredients are used up.",
      "Bake for 30 minutes.",
      "Remove from the oven and serve warm with garlic bread. Share and enjoy!"
    ],
    "cooking_time": "N/A",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/beef-stroganoff-lasagna/",
    "image_url": "",
    "image_path": "",
    "category": "Other Filipino Dishes"
  },
  {
    "title": "Garlic Butter Shrimp Pancit Canton",
    "ingredients": [
      "▢ 10 shrimp cleaned",
      "▢ 1 egg fried",
      "▢ 1 Knorr Shrimp Cube",
      "▢ 21 ounces pancit canton flour noodles",
      "▢ 4 cups water",
      "▢ 2 cups cabbage shredded",
      "▢ ½ lemon",
      "▢ 1 head garlic minced",
      "▢ 1 onion sliced",
      "▢ 4 Tablespoons soy sauce",
      "▢ 5 Tablespoons oyster sauce",
      "▢ 1 cup green onion chopped",
      "▢ ¼ cup butter",
      "▢ 2 Tablespoons cooking oil",
      "▢ Salt and ground black pepper to taste"
    ],
    "instructions": [
      "Melt butter in a wok. Add cooking oil.",
      "Put the garlic in the wok. Stir-fry until it turns light brown.",
      "Add shrimp. Cook each side for 1 minute.",
      "Squeeze the lemon over the shrimp. Cover the wok. Continue cooking for 1 minute. Season with salt.",
      "Remove the shrimp from the wok and place in a clean plate. Leave the juices in the wok.",
      "Allow the juices to evaporate until you are only left with the fats (butter and oil mixture).",
      "Sauté onion until it softens and then add soy sauce and water. Let it boil.",
      "Add Knorr Shrimp cube. Stir.",
      "Put the cabbage and carrot in the wok. Cook for 30 seconds.",
      "Add the noodles. Gently toss while cooking. Cook until the noodles completely absorb the liquid.",
      "Add oyster sauce and green onion. Season with ground black pepper. Toss until all ingredients are well distributed.",
      "Arrange the pancit canton in a serving plate and then top with shrimp and fried egg.",
      "Share. Serve and enjoy!"
    ],
    "cooking_time": "N/A",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/garlic-butter-shrimp-pancit-canton/",
    "image_url": "",
    "image_path": "",
    "category": "Noodles"
  },
  {
    "title": "Porknigang (Sinigang na Baboy Ribs)",
    "ingredients": [
      "▢ 3 lbs. pork baby back ribs",
      "▢ 3 bunches bok choy",
      "▢ 1 1/2 liter water",
      "▢ 44 grams Knorr Sinigang sa Sampaloc with Gabi",
      "▢ 15 counts string beans cut in 2-inch pieces",
      "▢ 8 okra",
      "▢ 1 eggplant sliced",
      "▢ 3 long green chili pepper",
      "▢ 1 cup daikon radish sliced",
      "▢ 2 tomato",
      "▢ 1 onion wedged",
      "▢ 3 tablespoons cooking oil",
      "▢ Fish sauce and ground black pepper to taste"
    ],
    "instructions": [
      "Heat oil in a large pot. Saute onion and tomato until the layers of the onion starts to separate.",
      "Add pork spare ribs. Continue sautéing until the pork turns light brown in color.",
      "Pour water. Cover the pot. Let the water boil. Adjust heat to low setting and continue boiling for 30 minutes.",
      "Add Knorr Sinigang sa Sampaloc with Gabi recipe mix and daikon radish. Stir and cover the pot. Continue cooking until the pork gets tender.",
      "Add chili pepper, string beans, okra, and eggplant. Cook for 12 minutes.",
      "Add pechay. Cook for 3 minutes.",
      "Season with fish sauce and ground black pepper.",
      "Transfer to a serving bowl. Serve with rice. Share and enjoy!"
    ],
    "cooking_time": "N/A",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/porknigang-sinigang-na-baboy-ribs/",
    "image_url": "",
    "image_path": "",
    "category": "Seafood"
  },
  {
    "title": "Bulalo Recipe",
    "ingredients": [
      "▢ 2 lbs beef shank",
      "▢ ½ cabbage whole leaf individually detached",
      "▢ 1 bundle bok choy",
      "▢ 2 cobs corn each cut into 3 parts",
      "▢ 2 Tablespoons whole peppercorn",
      "▢ 1/2 cup green onions cut unto 1 1/2 inch pieces",
      "▢ 1 onion",
      "▢ 34 ounces water",
      "▢ fish sauce to taste optional"
    ],
    "instructions": [
      "In a big cooking pot, pour in water and bring to a boil",
      "Put-in the beef shank followed by the onion and whole pepper corn then simmer for 1.5 hours (30 mins if using a pressure cooker) or until meat is tender.",
      "Add the corn and simmer for another 10 minutes",
      "Add the fish sauce,cabbage, pechay, and green onion (onion leeks)",
      "Serve hot. Share and Enjoy!"
    ],
    "cooking_time": "2 hours",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/bulalo-stewed-beef-shank/",
    "image_url": "",
    "image_path": "",
    "category": "Soups And Stews"
  },
  {
    "title": "Beef Pares Lomi",
    "ingredients": [
      "▢ 2 1/2 lbs beef kalitiran",
      "▢ 1 Knorr Beef Cube",
      "▢ 1 lb. fresh miki noodles",
      "▢ 5 cloves garlic chopped",
      "▢ 1 onion chopped",
      "▢ 1 1/2 teaspoons ginger chopped",
      "▢ 2 tablespoons potato starch",
      "▢ 3 tablespoons brown sugar",
      "▢ 2 star anise",
      "▢ 1 egg",
      "▢ 3 tablespoons soy sauce",
      "▢ 6 cups water",
      "▢ 3 tablespoons cooking oil",
      "▢ Salt and ground black pepper to taste"
    ],
    "instructions": [
      "Heat oil in a wok. Sauté garlic, onion, and ginger until the onion softens.",
      "Add beef. Sauté until the beef turns light brown.",
      "Pour the soy sauce and water. Cover and Let boil.",
      "Add star anise, sugar, and Knorr Beef Cube. Stir. Cover the wok and then adjust the heat to a low setting. Continue cooking until the beef tenderizes",
      "Remove and discard the star anise. Add the fresh noodles and then season with salt and ground black pepper. Cook for 3 minutes.",
      "Thicken the soup by adding a slurry. Do this by combining potato starch with 3 tablespoons of water. Pour it into the wok and add beaten egg. Stir. Cook until the soup thickens based on your desired consistency.",
      "Serve with soy dipping sauce and garlic fried rice, if preferred. Share and enjoy!"
    ],
    "cooking_time": "N/A",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/beef-pares-lomi/",
    "image_url": "",
    "image_path": "",
    "category": "Noodles"
  },
  {
    "title": "Crispy Mini Lechon Belly Roll",
    "ingredients": [
      "▢ 4 lbs. pork belly",
      "▢ 1 onion sliced",
      "▢ 1 head  garlic minced",
      "▢ 1 bunch  lemongrass",
      "▢ 1 bunch  green onion",
      "▢ 3 tablespoons salt",
      "▢ 1 1/2 tablespoons ground black pepper",
      "▢ 3 tablespoons cooking oil"
    ],
    "instructions": [
      "Slice the pork belly in half. Lay it flat on a clean surface and then rub salt and ground black pepper on the side with meat.",
      "Spread the garlic over each piece of belly and arrange the sliced onion, lemongrass, and green onion.",
      "Roll the pork belly in a way that all ingredients remain inside. Make sure that both ends are touching. Securely tie the belly using a kitchen twine.",
      "Arrange the two pork belly rolls in a steamer. Steam for 45 minutes.",
      "Remove from the steamer and let it cool down for 15 minutes. Rub oil all over each belly roll.",
      "Arrange the belly rolls in a turbo broiler and then broil for 45 minutes.",
      "Slice and serve while still hot. Share and enjoy!"
    ],
    "cooking_time": "N/A",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/crispy-mini-lechon-belly-roll/",
    "image_url": "",
    "image_path": "",
    "category": "Pork Dishes"
  },
  {
    "title": "Pancit Palabok Recipe",
    "ingredients": [
      "▢ 500 grams rice noodles bihon",
      "▢ 2 tbsp cooking oil",
      "▢ 1/2 lb ground pork",
      "▢ 1 tbsp anatto powder",
      "▢ 3 cups pork broth",
      "▢ 1 piece shrimp bouillon",
      "▢ 6 tablespoons all-purpose flour",
      "▢ 2 tbsp fish sauce",
      "▢ 1/2 tsp ground black pepper",
      "▢ 1 cup pork belly boiled and sliced thinly  into small pieces",
      "▢ 4 ounces firm tofu fried and sliced into cubes",
      "▢ ½ cup tinapa flakes smoked fish",
      "▢ ½ cup chicharon pounded",
      "▢ 2 hard boiled eggs sliced",
      "▢ ½ cup cooked shrimps boiled or steamed",
      "▢ 1/4 cup green onion or scallions finely chopped",
      "▢ 3 Tablespoons toasted garlic",
      "▢ 2 lemons sliced (or 6 pieces calamansi)"
    ],
    "instructions": [
      "Soak the rice noodles in water for about 15 minutes. Drain and set aside.",
      "Cook the sauce by heating a saucepan. Pour-in the cooking oil.",
      "When the oil is hot enough, put-in the ground pork and cook for about 5 to 7 minutes",
      "Dilute the annato powder in pork broth then pour the mixture in the saucepan. Bring to a boil (If you are using anatto seeds, soak them first in 3 tbsp water to bring-out the color)",
      "Add the shrimp cube and stir and simmer for 3 minutes",
      "Add the flour gradually while stirring.",
      "Add the fish sauce and ground black pepper then simmer until sauce becomes thick. Set aside.",
      "Meanwhile, boil enough water in a pot.",
      "Place the soaked noodles in a strainer (use metal or bamboo strainer) then submerge the strainer in the boiling water for about a minute or until the noodles are cooked. (make sure that the noodles are still firm)",
      "Remove the strainer from the pot and drain the liquid from the noodles.",
      "Place the noodles in the serving plate.",
      "Pour the sauce on top of the noodles then arrange the toppings over the sauce.",
      "Serve with a slice of lemon or calamansi. Share and enjoy!"
    ],
    "cooking_time": "45 minutes",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/asian-filipino-food-noodles-pansit-pancit-palabok-recipe/",
    "image_url": "",
    "image_path": "",
    "category": "Seafood"
  },
  {
    "title": "Kakaibang Tokwat Baboy",
    "ingredients": [
      "▢ 2 lbs pork belly",
      "▢ 12 ounces extra firm tofu",
      "▢ 3 calamansi",
      "▢ 3/4 cup soy sauce",
      "▢ 1 red onion sliced",
      "▢ 6 chili pepper chopped",
      "▢ ¼ cup soy sauce",
      "▢ ¾ cups white vinegar",
      "▢ ½ cup lemon lime soda",
      "▢ Ground black pepper to taste"
    ],
    "instructions": [
      "Steam the pork belly for 45 minutes. Let it cool down.",
      "Combine calamansi juice and soy sauce. Stir.",
      "Place the pork belly in a resealable bag and then pour the soy sauce mixture. Marinate for 1 hour.",
      "Slice the tofu into smaller pieces. Rub oil all over each piece. Air fry for 17 minutes at 400F. Let it cool down and then slice into cubes.",
      "Grill the pork belly until fully cooked. Let it cool down and then slice into serving pieces.",
      "Make the sauce by combining all the sauce ingredients in a large bowl. Mix well.",
      "Add fried tofu and grilled pork belly. Toss until well blended.",
      "Transfer to a serving bowl. Serve as an appetizer or main dish. Share and enjoy!"
    ],
    "cooking_time": "N/A",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/kakaibang-tokwat-baboy/",
    "image_url": "",
    "image_path": "",
    "category": "Pork Dishes"
  }
]