[
  {
    "title": "Pork Empanada Recipe",
    "ingredients": [
      "▢ 1 lb. ground pork",
      "▢ 1 small carrot cubed",
      "▢ 1/2 cup green peas",
      "▢ 1 small baking potato cubed",
      "▢ 1 medium yellow onion chopped",
      "▢ 1/2 cup raisins",
      "▢ 1/4 cup Worcestershire sauce",
      "▢ 1 tablespoon brown sugar",
      "▢ 1/2 to 3/4 cups beef broth",
      "▢ 3 tablespoons cooking oil",
      "▢ Salt and ground black pepper to taste",
      "▢ 3 1/4 cups all-purpose flour",
      "▢ 1/2 teaspoon salt",
      "▢ 1 cup unsalted butter",
      "▢ 1 egg",
      "▢ 10 tablespoons fresh milk",
      "▢ 1 Egg egg white only",
      "▢ 2 tablespoons fresh milk"
    ],
    "instructions": [
      "Prepare the pork filling by heating oil in a cooking pot. Add ground pork and cook until light brown.",
      "Add the chopped onions. Stir and continue to cook until the onion becomes soft.",
      "Add raisins, Worcestershire sauce, and beef broth. Cover the pot, adjust the heat to medium, cook for 10 to 12 minutes.",
      "Add peas, carrots, and potato. Cover and cook for 5 to 8 minutes Note: Add more beef broth or water, if needed",
      "Put the brown sugar into the pot and season with salt and ground black pepper. Stir and cook for 1 minute. Set aside.",
      "Preheat oven to 400F.",
      "Meanwhile, prepare the dough using a food processor. Put flour in a food processor and then add salt. Pulse until both ingredients are blended.",
      "Slice the butter into small pieces. Add into the food processor. Continue to pulse until the butter blends well with the flour mixture.",
      "Add egg and gradually pour the milk 2 to 3 tablespoons at a time, while pulsing. Continue to process the mixture until all the ingredients are well blended.",
      "Transfer the dough into a flat surface. Mold a large sphere out of it. Separate in half, and then create a disk shaped figure on each piece of dough. Chill the dough for at least 20 minutes.",
      "Flatten one piece of dough on a flat surface using a rolling pin. Note: Watch video below for more information.",
      "Cut a part of the flatten dough using a circular mold, or anything with a circular tip such as a bowl. Remove the circular dough and set aside.",
      "Assemble the pork empanada by placing 1 to 2 tablespoons of the pork filling in the center of the circular dough.Secure it by folding both sides of the dough towards each other. Use your thumb and index finger to pinch the sides for it to cling to each other. Secure it even more by pressing the tip of a fork on the sides of the empanada.",
      "Arrange the empanadas on a baking tray lined with parchment paper. Bake for 15 minutes and then remove from the oven.",
      "Prepare the egg wash by combining egg white and milk in a bowl. Beat the mixture until blended. Brush the egg wash all over the empanadas.",
      "Put the pork empanada back into the oven. Continue to bake for 5 to 7 minutes or until it turns medium brown.",
      "Remove from the oven. Let it cool down.",
      "Serve. Share and enjoy!"
    ],
    "cooking_time": "1 hour",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/pork-empanada-recipe/",
    "image_url": "",
    "image_path": "",
    "category": "Pork Dishes"
  },
  {
    "title": "Chicken Congee Recipe",
    "ingredients": [
      "▢ 1 lb. skinless chicken thigh",
      "▢ 1 Knorr chicken cube",
      "▢ 1 1/4 cups long grain rice",
      "▢ 3/4 cups chopped scallions",
      "▢ 3 thumbs ginger sliced into thin strips",
      "▢ 2 tablespoons toasted garlic optional",
      "▢ 2 teaspoons Sesame oil",
      "▢ 7 to 10 cups water",
      "▢ Salt and ground black pepper to taste"
    ],
    "instructions": [
      "Heat water in a cooking pot. Add ginger, half of the chopped scallions, and chicken. Let boil.",
      "Add Knorr chicken cube. Stir. Cover and continue to cook in medium heat for 15 minutes.",
      "Remove the chicken from the pot. Let it cool down. Shred the chicken meat. Discard the bones. Note: you can shred the chicken using two forks, or your bare clean hands.",
      "Add rice into the pot. Cover and to cook for 30 minutes.",
      "Put the shredded chicken in the pot. Continue to cook for 30 minutes more or until the consistency of the porridge gets thick. Note: add water if needed.",
      "Add salt, ground black pepper, and Sesame oil. Stir.",
      "Transfer to a bowl. Top with chopped scallions and toasted garlic.",
      "Serve. Share and enjoy!"
    ],
    "cooking_time": "1 hour",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/chicken-congee-recipe/",
    "image_url": "",
    "image_path": "",
    "category": "Chicken Dishes"
  },
  {
    "title": "Shrimp and Chicken Pancit Canton",
    "ingredients": [
      "▢ 8 ounces 227 grams pancit canton (flour noodles)",
      "▢ 1 Knorr shrimp cube",
      "▢ ½ head small cabbage sliced into small pieces",
      "▢ 10 to 12 pieces medium shrimp shell and head removed",
      "▢ 4 ounces chicken boiled and shredded",
      "▢ 12 to 15 pieces snow peas",
      "▢ 1 Chinese sausage chopped",
      "▢ 1 medium carrot julienne",
      "▢ ¼ cup chopped parsley",
      "▢ ¼ cup soy sauce",
      "▢ 1 medium yellow onion sliced",
      "▢ 4 cloves garlic minced",
      "▢ ½ teaspoon ground black pepper",
      "▢ 1 ½ to 2 cups water or beef broth",
      "▢ 3 tablespoons cooking oil"
    ],
    "instructions": [
      "Heat oil in a cooking pot.",
      "Once the oil gets hot, pan-fry the shrimp for 40 seconds per side. Remove from the pot. Set aside.",
      "Using the remaining oil (you can add more oil if needed), sauté garlic and onion.",
      "Add the Chinese sausage and shredded chicken. Saute for 2 minutes.",
      "Pour the soy sauce into the pot along with the beef broth. Stir. Let boil. Cover and continue to cook in medium heat for 5 minutes.",
      "Add parsley, snow peas, carrot, and cabbage. Cover and cook for 8 minutes.",
      "Put the ground black pepper into the pot. Stir.",
      "Add the pancit canton (flour noodles). Cover and cook until the noodles starts to get softer. Note: there is no need to stir the noodles after adding. Covering the pot traps the steam, which the noodles absorb. This makes it softer, eventually.",
      "Gently toss noodles. Add pan-fried shrimp. Cover the pot and continue to cook in medium heat for 3 minutes.",
      "Transfer to a serving plate. Serve with lime or calamansi.",
      "Share and enjoy!"
    ],
    "cooking_time": "50 minutes",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/shrimp-and-chicken-pancit-canton/",
    "image_url": "",
    "image_path": "",
    "category": "Noodles"
  },
  {
    "title": "Homemade Pork and Beans Recipe",
    "ingredients": [
      "▢ 1/2 cup smoked bacon cubed",
      "▢ 2 15.5 oz. cans Cannellini beans",
      "▢ 1 medium yellow onion chopped",
      "▢ 1 8 oz. can tomato sauce",
      "▢ 3 tablespoons molasses",
      "▢ 2 tablespoons white vinegar",
      "▢ 3 teaspoons mustard powder",
      "▢ 1/4 teaspoon salt",
      "▢ 2 tablespoons cooking oil"
    ],
    "instructions": [
      "Heat oil in a cooking pot.",
      "Add onions. Cook until the onions gets soft and somewhat caramelized.",
      "Add bacon. Cook for 1 minutes.",
      "Pour the tomato sauce, vinegar, and liquid from the can of beans into the pot. Add mustard powder. Let boil. Stir and cover. Continue to cook in low heat for 30 to 35 minutes. Note: add water if the liquid starts to dry-up.",
      "Add the molasses, beans, and salt into the pot. Gently stir. Cover and cook for 8 to 10 minutes.",
      "Transfer to serving bowl. Serve.",
      "Share and enjoy!"
    ],
    "cooking_time": "50 minutes",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/homemade-pork-and-beans-recipe/",
    "image_url": "",
    "image_path": "",
    "category": "Pork Dishes"
  },
  {
    "title": "Eggplant Omelette",
    "ingredients": [
      "▢ 3 pieces eggs",
      "▢ 1 medium eggplant",
      "▢ 1/4 teaspoon garlic powder",
      "▢ 1/4 teaspoon salt",
      "▢ A dash of ground black pepper",
      "▢ 4 tablespoons olive oil"
    ],
    "instructions": [
      "Beat the eggs in a large bowl. Add salt, ground black pepper, and garlic powder. Continue to beat until all ingredients are well blended. Set aside.",
      "Use a fork to create tiny holes all over the eggplant. Cook the eggplant by either baking it in the oven at 400F for 20 to 25 minutes, or exposing it in fire over a stove top until the skin gets burnt and turns black.",
      "Let the eggplant cool down. Peel the skin then cut the stalk off. Arrange the eggplant flat in a plate. Gently mash using a fork.",
      "Transfer the mashed eggplant to the bowl with beaten egg. Beat until the eggplant is well incorporated with all the ingredients.",
      "Meanwhile, heat olive oil in a pan. Once the oil gets hot, pour the mixture into the pan. Continue to cook in low to medium heat for 3 to 5 minutes.",
      "Flip the eggplant omellette using a plate. Do this by lifting the pan and tilt it towards the plate until the content slides into the plate (you can also use a spatula). Make sure that the cooked part is facing down. Now, hold the plate with one hand and the pan with the other. Cover the plate with pan and then quickly flip it over in a way that the top part of the omellete (which is still uncooked) touches the base of the pan. Continue to cook for 3 minutes.",
      "Transfer to a serving plate. Serve with your favorite condiment.",
      "Share and enjoy!"
    ],
    "cooking_time": "18 minutes",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/eggplant-omelette/",
    "image_url": "",
    "image_path": "",
    "category": "Other Filipino Dishes"
  },
  {
    "title": "Pandesal and Sardines Pizza",
    "ingredients": [
      "▢ 2 to 3 pieces pandesal",
      "▢ 2 155 g  small cans sardines in tomato sauce",
      "▢ 3/4 cups shredded cheddar cheese",
      "▢ 3 tablespoons tomato paste",
      "▢ A pinch of Italian seasoning optional",
      "▢ 1 tablespoon chopped flat leaf parsley",
      "▢ 1 teaspoon red pepper flakes"
    ],
    "instructions": [
      "Preheat oven to 370F",
      "Slice the pandesal in half. Set aside",
      "Open the cans of sardines. Separate the fish from the tomato sauce.",
      "Combine tomato paste, 2 tablespoons of sauce from the sardines, and Italian seasoning. Stir.",
      "Spread the tomato paste mixture over every slice of pandesal. Arrange 1 to 2 pieces of sardines over each pandesal. Top with a generous amount of cheese.",
      "Arrange on a baking tray. Bake for 5 to 8 minutes.",
      "Remove from the oven. Top with parsley and red pepper flakes.Serve as snack.",
      "Share and enjoy!"
    ],
    "cooking_time": "18 minutes",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/pandesal-and-sardines-pizza/",
    "image_url": "",
    "image_path": "",
    "category": "Seafood"
  },
  {
    "title": "Bacon Wrapped Sea Scallop",
    "ingredients": [
      "▢ 9 to 12 pieces large sea scallops",
      "▢ 9 to 12 strips of bacon",
      "▢ 1 teaspoon garlic powder",
      "▢ 14 teaspoon salt",
      "▢ 1/4 cup unsalted butter sliced into small cubes",
      "▢ 2 teaspoons minced flat leaf parsley"
    ],
    "instructions": [
      "Preheat oven to 375F",
      "Place the scallops in a bowl. Add garlic powder and salt. Rub all over the scallops.",
      "Wrap 1 strip of bacon on the sides of a scallop. Secure by inserting a toothpick into the scallop. Do this step until all the scallops are wrapped with bacon.",
      "Arrange the bacon wrapped scallops on a baking tray. Bake for 15 to 18 minutes.",
      "Remove from the oven. Top each piece with a cube of butter.",
      "Arrange in a serving plate. Sprinkle minced parsley all over the scallops.",
      "Serve. Share and enjoy!"
    ],
    "cooking_time": "28 minutes",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/bacon-wrapped-sea-scallop/",
    "image_url": "",
    "image_path": "",
    "category": "Other Filipino Dishes"
  },
  {
    "title": "Nilagang Buto-buto ng Baka Recipe",
    "ingredients": [
      "▢ 4 lbs. beef neck bone cut into serving pieces",
      "▢ 2 quarts water",
      "▢ 2 medium yellow onion wedged",
      "▢ 1 tablespoon whole peppercorn",
      "▢ 4 pieces saba banana sliced",
      "▢ 1 large baking potato slced",
      "▢ 2 bunches baby bok choy",
      "▢ 2 cups Napa cabbage cut into pieces",
      "▢ 1/4 cup patis sauce"
    ],
    "instructions": [
      "Pour water into a deep soup pot.",
      "Add onion, whole peppercorn, and beef neck bone. Let boil. Cover and continue to boil in low heat for 3 hours. Add water if needed. Note: You can use a pressure cooker to quickly cook the beef and tenderize the meat. It should take around 40 to 45 minutes.",
      "Add saba banana and potato. Boil in medium heat for 10 minutes.",
      "Add bok choy and Napa cabbage. Cover the pot, Turn the heat off. Let it stay covered for 8 minutes for the residual heat to partially cook the vegetables.",
      "Add patis. Stir.",
      "Transfer to a serving bowl. Serve with rice.",
      "Share and enjoy!"
    ],
    "cooking_time": "3 hours",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/nilagang-buto-buto-ng-baka-recipe/",
    "image_url": "",
    "image_path": "",
    "category": "Soups And Stews"
  },
  {
    "title": "Rosemary Crusted Roast Rack of Lamb",
    "ingredients": [
      "▢ 1 rack of lamb 7 to 8 bones at approximately 1 1/2 to 2 lbs",
      "▢ 3 tablespoons Panko breadcrumbs",
      "▢ 3 tablespoons chopped Rosemary",
      "▢ 2 1/2 tablespoons extra virgin olive oil",
      "▢ 6 cloves garlic minced",
      "▢ 1 teaspoon salt",
      "▢ 1/4 teaspoon ground black pepper"
    ],
    "instructions": [
      "Rub salt and ground black pepper all over the lamb. Let it stay for at least 12 minutes.",
      "Meanwhile preheat oven to 450F",
      "Combine Panko bread crumbs, Rosemary, garlic, and olive oil in a bowl. Mix well. Rub the mixture all over the rack of lamb. Arrange on a baking tray and roast for 18 minutes.",
      "Remove from the oven. Let it cool down for 8 to 12 minutes.",
      "Slice the lamb between each bones.",
      "Serve. Share and enjoy!"
    ],
    "cooking_time": "30 minutes",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/rosemary-crusted-roast-rack-of-lamb/",
    "image_url": "",
    "image_path": "",
    "category": "Other Filipino Dishes"
  },
  {
    "title": "How To Cook Filipino Chicken Arroz Caldo",
    "ingredients": [
      "▢ 1 lb. chicken cut into serving pieces",
      "▢ ½ cup glutinous rice",
      "▢ ½ cup Jasmine rice",
      "▢ 6 to 8 cups chicken broth",
      "▢ 2 tablespoons kasubha dried safflower (optional)",
      "▢ 3 tablespoons cooking oil",
      "▢ 4 thumbs ginger julienne",
      "▢ 1 large onion chopped",
      "▢ 3 cloves garlic crushed",
      "▢ 3 tablespoons cooking oil",
      "▢ Fish sauce patis and ground black pepper to taste",
      "▢ ¼ cup chopped scallions",
      "▢ 2 boiled eggs sliced into half lengthwise",
      "▢ 6 cloves garlic crushed and toasted",
      "▢ 1 small lemon or 4 pieces calamansi, sliced"
    ],
    "instructions": [
      "Heat oil in a cooking pot.",
      "Saute garlic, onion, and ginger.",
      "When the onion starts to turn soft and translucent, put the chicken into the pot. Cook until it turns light brown.",
      "Add glutinous and Jasmine rice. Saute for 1 minute.",
      "Pour 6 cups of chicken broth. Let boil. Cover the pot. Continue to cook in medium heat for 35 to 40 minutes. Make sure to stir the mixture every few minutes to prevent the rice from sticking on the pot. Add more broth if necessary.",
      "Add kasubha, patis, and ground black pepper. Stir. Continue to cook until it reaches your desired consistency.",
      "Transfer to a serving bowl. Top with egg, scallions, garlic, and lemon wedges.",
      "Serve hot. Share and enjoy!"
    ],
    "cooking_time": "1 hour",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/how-to-cook-filipino-chicken-arroz-caldo/",
    "image_url": "",
    "image_path": "",
    "category": "Rice Dishes"
  },
  {
    "title": "Spanish Sardines Pasta with Sun Dried Tomato and Chopped Olives",
    "ingredients": [
      "▢ 1/2 lb. fettuccine",
      "▢ 6 oz. Spanish sardines",
      "▢ 1/4 cup chopped sun-dried tomato",
      "▢ 1/2 cup chopped green olives",
      "▢ 1/4 cup extra virgin olive oil",
      "▢ 1/4 teaspoon crushed red pepper optional",
      "▢ 2 tablespoons chopped flat leaf parsley",
      "▢ Salt and ground black pepper to taste"
    ],
    "instructions": [
      "Cook fettuccine according to package instructions. Place in a large mixing bowl.",
      "Add Spanish sardines, chopped sun-dried tomato, chopped olives, crushed red pepper, parsley, and extra virgin olive oil.",
      "Place the pasta and other ingredients in a pan. Heat the pan and toss. Continue to cook for 3 minutes.",
      "Add salt and ground black pepper to taste.",
      "Transfer to a serving plate. Serve.",
      "Share and enjoy!"
    ],
    "cooking_time": "30 minutes",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/spanish-sardines-pasta-with-sun-dried-tomato-and-chopped-olives/",
    "image_url": "",
    "image_path": "",
    "category": "Other Filipino Dishes"
  },
  {
    "title": "Lechon Belly Pork Adobo Recipe",
    "ingredients": [
      "▢ 1 1/2 lbs. lechon belly",
      "▢ 5 tablespoons soy sauce",
      "▢ 3 cups beef broth",
      "▢ 1/4 cup white vinegar",
      "▢ 5 to 6 pieces dried bay leaves",
      "▢ 1 medium onion chopped",
      "▢ 4 to 5 cloves garlic crushed",
      "▢ 1 tablespoon whole peppercorn",
      "▢ 1 teaspoon granulated white sugar",
      "▢ 3 tablespoons cooking oil"
    ],
    "instructions": [
      "Heat oil in a cooking pot.",
      "Saute garlic and onion.",
      "Once the onion starts to get translucent and soft, and the garlic turns brown, add the sliced lechon belly. Continue to saute for 3 minutes.",
      "Pour beef broth. Let boil.",
      "Add whole peppercorn and dried bay leaves. Cover and cook in low heat for 45 to 50 minutes. Note: add more broth or water if needed.",
      "Pour vinegar. Let boil.",
      "Add sugar. Stir. Cook until there is only a little bit of sauce left. Do not let the pork adobo to get dry.",
      "Transfer to a serving bowl.",
      "Serve with rice. Share and enjoy!"
    ],
    "cooking_time": "1 hour",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/lechon-belly-pork-adobo-recipe/",
    "image_url": "",
    "image_path": "",
    "category": "Pork Dishes"
  }
]