[
  {
    "title": "Crispy Pork Binagoongan",
    "ingredients": [
      "▢ 2 lbs pork belly",
      "▢ 1 ½ teaspoons salt",
      "▢ ¼ cup bagoong alamang",
      "▢ 1 piece onion chopped",
      "▢ 1 piece tomato chopped",
      "▢ 1 thumb  ginger chopped",
      "▢ 4 cloves garlic chopped",
      "▢ 1 piece long green pepper sliced",
      "▢ 1 ½ tablespoons white vinegar",
      "▢ 1 teaspoon white sugar",
      "▢ ½ cup water",
      "▢ 3 tablespoons cooking oil",
      "▢ Ground black pepper to taste"
    ],
    "instructions": [
      "Steam the pork belly for 35 minutes.",
      "Remove from the steamer and let it cool down. Rub salt all over the pork belly. Let it dry-up a bit by leaving in open air for at least 15 minutes.",
      "Arrange the pork belly in an air fryer or turbo broiler. Air-fry in 350F for 25 minutes.",
      "Place the crispy fried pork on a serving plate.",
      "Prepare the  binagoongan sauce by sauteing garlic, onion, ginger, and tomato.",
      "Once the tomato and onion softens, add the bagoong alamang (shrimp paste). Saute for 1 minute.",
      "Add long green pepper and vinegar. Stir.",
      "Pour water water. Let boil. Season with sugar and ground black pepper. Cook for 2 minutes.",
      "Pour binagoongan sauce over the crispy fried pork. Serve with warm rice."
    ],
    "cooking_time": "N/A",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/crispy-pork-binagoongan/",
    "image_url": "",
    "image_path": "",
    "category": "Pork Dishes"
  },
  {
    "title": "Chicken Caldereta",
    "ingredients": [
      "▢ 2 lbs chicken cut into pieces",
      "▢ 1 piece Knorr Chicken Cube",
      "▢ 2 pieces carrots wedged",
      "▢ 2 pieces potato cubed",
      "▢ 8 ounces tomato sauce",
      "▢ 2 pieces bell pepper sliced",
      "▢ 4 tablespoons liver spread",
      "▢ 1 piece tomato cubed",
      "▢ 3 pieces chili pepper chopped",
      "▢ 1 piece onion chopped",
      "▢ 3 cloves garlic crushed",
      "▢ 3 tablespoons cheddar cheese grated",
      "▢ 1 ½ cups water",
      "▢ 4 tablespoons cooking oil"
    ],
    "instructions": [
      "Start by pan-frying the potato and carrots. Heat oil in a pan. Add potato. Fry each side for 1 minute. Remove from the pan and put in a bowl lined with paper towel. Set aside. Do the same thing with the carrots.",
      "Using the remaining oil, fry the chicken for 1 ½ minutes per side. Remove from the pan. Set aside.",
      "Saute onion and garlic. Add tomato. Continue to saute while stirring until tomato and onion softens.",
      "Add chicken and pour-in tomato sauce and water. Let boil.",
      "Stir and then add Knorr Chicken Cube and chili pepper. Cover the pan. Cook between low to medium heat for 15 minutes.",
      "Turn the chicken pieces over to equally cook the opposite side. Add liver spread. Stir. Cover and cook for 20 minutes.",
      "Add bell peppers and cheese. Cook for 3 minutes.",
      "Put the carrots and potatoes into the pan. Continue to cook for 5 to 7 minutes.",
      "Season with salt and ground black pepper. Serve. Share and enjoy."
    ],
    "cooking_time": "N/A",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/chicken-caldereta/",
    "image_url": "",
    "image_path": "",
    "category": "Chicken Dishes"
  },
  {
    "title": "Chicken Lollipop Recipe",
    "ingredients": [
      "▢ 10 pieces chicken wings",
      "▢ 1 1/2 cup Panko bread crumbs",
      "▢ 2 pieces raw eggs",
      "▢ 1/2 cup all-purpose flour",
      "▢ 3 teaspoons salt",
      "▢ 1/2 teaspoon ground black pepper",
      "▢ 2 cups cooking oil"
    ],
    "instructions": [
      "Divide the chicken wing into 3 parts by slicing through the joints. Set aside the wingtip for other possible uses.",
      "Shape the wing to look like a lollipop. You should have two parts of the chicken wing by now: the one with a single bone and the one with two bones. Start by selecting the part with one bone.",
      "Separate the meat from the bone by sliding a sharp knife around the tip of the bone where meat is still connected (do not cut through the bone).",
      "Place the wing vertically on top of a flat surface while holding the part where the knife passed.",
      "Gently push downward while gripping the bone with your thumb and index finger until the meat slides down.",
      "Arrange the meat by inverting the inner part until a lollipop shape is formed. Note: Do the same procedure for the part with two bones. However, you need to first detach the smaller bone before commencing.",
      "Season the chicken lollipops with salt and pepper and let it stand for at least 15 minutes.",
      "Crack the eggs and transfer to a bowl then whisk.",
      "Gradually add-in the all-purpose flour while whisking until a batter is formed.",
      "Dip the chicken lollipop on the batter then to the Panko breadcrumbs.",
      "Heat oil in a cooking pot then deep-fry the chicken lollipop under medium heat until the color of the outer part turns medium brown (about 10 to 12 minutes).",
      "Remove the fried chicken lollipop from the cooking pot and transfer to a dish with paper towel. Let it stand until excess oil is absorbed by the paper towel.",
      "Serve with your favorite dip. Share and enjoy!"
    ],
    "cooking_time": "22 minutes",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/quick-easy-chicken-lollipop-recipe/",
    "image_url": "",
    "image_path": "",
    "category": "Chicken Dishes"
  },
  {
    "title": "Easy Adobong Pusit",
    "ingredients": [
      "▢ 5 pieces squid large, cleaned and sliced",
      "▢ 2 tablespoons soy sauce",
      "▢ 5 tablespoons white vinegar",
      "▢ 1 teaspoon salt coarse",
      "▢ 1 piece onion chopped",
      "▢ 1 piece tomato chopped",
      "▢ 5 cloves garlic crushed",
      "▢ 1/2 teaspoon sugar",
      "▢ 3 tablespoons cooking oil"
    ],
    "instructions": [
      "Combine squid, salt, soy sauce, and vinegar in a bowl. Mix well. Marinate for 12 minutes.",
      "Heat oil in a cooking pot. Saute garlic until it starts to turn light brown. Add onion and tomato. Continue to saute until onion and tomato completely softens.",
      "Pour the marinade liquid into the pot. Add ground black pepper. Let boil and then cook for 3 minute using low to medium heat. Make sure to cover the pot.",
      "Add the squid. Let the sauce boil. Cover the pot and continue cooking for 3 minutes.",
      "Add sugar. Stir. Remove the squid from the pot and then arrange in a bowl. Continue cooking the sauce until it reduces to half.",
      "Pour the sauce over the squid. Serve. Share and enjoy."
    ],
    "cooking_time": "N/A",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/easy-adobong-pusit/",
    "image_url": "",
    "image_path": "",
    "category": "Chicken Dishes"
  },
  {
    "title": "Ginataang Bilo bilo with Langka Recipe",
    "ingredients": [
      "▢ 20 pieces glutinous rice balls (Bilo-bilo)",
      "▢ 20 oz jackfruit ripe, sliced",
      "▢ 2 cups water",
      "▢ 2 cups coconut cream",
      "▢ 3/4 cup granulated white sugar",
      "▢ 1 1/2 cups tapioca pearls cooked"
    ],
    "instructions": [
      "Pour the water in a cooking pot. Bring to a boil.",
      "Add the coconut cream. Stir and cook until the mixture starts to boil again.",
      "Gradually stir-in the sugar.",
      "Add the ripe jackfruit. Cover and cook in low heat for 15 minutes.",
      "Add-in the bilo-bilo. Continue to cook for another 15 minutes while stirring every 3 minutes.",
      "Put-in the sago. Cook for 3 to 5 minutes.",
      "Transfer to a serving bowl. Serve.",
      "Share and enjoy!"
    ],
    "cooking_time": "45 minutes",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/ginataang-bilo-bilo-langka-recipe/",
    "image_url": "",
    "image_path": "",
    "category": "Other Filipino Dishes"
  },
  {
    "title": "Creamy Garlic Parmesan Chicken with Mushrooms",
    "ingredients": [
      "▢ 1 lb. chicken breast boneless",
      "▢ 28 g Knorr SavorRich Chicken",
      "▢ 1 ½ cups fresh mushroom sliced",
      "▢ ½ cup Parmesan cheese grated",
      "▢ 4 cloves garlic minced",
      "▢ 3 tablespoons all-purpose flour",
      "▢ 2 ½ cups milk",
      "▢ 3 tablespoons butter",
      "▢ 3 tablespoons cooking oil",
      "▢ Ground black pepper to taste"
    ],
    "instructions": [
      "Slice the boneless chicken breast into thin pieces. Brush Knorr savorRich chicken seasoning all over the chicken. Let it stay for 15 minutes.",
      "Heat oil in a pan. Fry the chicken for 4 1.2 minutes per side. Transfer the chicken to a plate afterwards. Set aside.",
      "Start to make the creamy sauce by melting butter on the same pan the chicken was cooked. Saute mushrooms for 2 minutes. Add garlic and continue to cook for 30 seconds.",
      "Gradually add all-purpose flour. Continuously stir until lumps form.",
      "Slowly pour around ¾ of the total milk amount. Stir until the cream sauce becomes smooth. Add Parmesan cheese. Stir.",
      "Pour remaining milk while stirring. Season with ground black pepper.",
      "Put the chicken back into the pan. Cover and cook between low to medium heat for 3 minutes.",
      "Transfer to a serving plate. Serve with your favorite side."
    ],
    "cooking_time": "N/A",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/creamy-garlic-parmesan-chicken-with-mushrooms/",
    "image_url": "",
    "image_path": "",
    "category": "Chicken Dishes"
  },
  {
    "title": "Garlic Butter Shrimp Recipe",
    "ingredients": [
      "▢ 2 lbs shrimp cleaned",
      "▢ 2 tablespoons parsley chopped",
      "▢ 1/4 cup butter",
      "▢ 1 head garlic crushed",
      "▢ 1 cup lemon lime soda",
      "▢ 1 teaspoon lemon juice",
      "▢ salt and pepper to taste"
    ],
    "instructions": [
      "Marinate the shrimp in lemon soda for about 10 minutes",
      "Melt the butter in a pan.",
      "Add the garlic. Cook in low heat until the color turns light brown",
      "Put-in the shrimp. Adjust heat to high. Stir-fry until shrimp turns orange.",
      "Season with ground black pepper, salt, and lemon juice. Stir.",
      "Add parsley. Cook for 30 seconds.",
      "Serve hot. Share and Enjoy!"
    ],
    "cooking_time": "22 minutes",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/buttered-garlic-shrimp/",
    "image_url": "",
    "image_path": "",
    "category": "Other Filipino Dishes"
  },
  {
    "title": "Tuyo Pesto Spaghetti Pasta",
    "ingredients": [
      "▢ 5 pieces dried fish tuyo (cooked) and flaked",
      "▢ ½ cup Parmesan cheese",
      "▢ 1 lb. spaghetti",
      "▢ 2 cups basil leaves fresh",
      "▢ ¼ cups pine nuts roasted",
      "▢ 3 cloves garlic",
      "▢ ¼ cup Parmesan cheese",
      "▢ 1/3 cup olive oil extra virgin"
    ],
    "instructions": [
      "Prepare the pesto by combining basil, roasted pine nuts, and garlic in a food processor. Blitz for 30 seconds. Add Parmesan cheese. Continue to blitz while gradually pouring olive oil. Set aside.",
      "Cook the spaghetti based on package instructions. Save ¾ cups of pasta water. Drain the remaining water.",
      "Place the cooked spaghetti in a large bowl. Combine tuyo fish flakes, Parmesan cheese, and all of the fresh pesto. Toss. Add pasta water as needed.",
      "Arrange the tuyo pesto in a pasta bowl. Serve. Share and enjoy."
    ],
    "cooking_time": "N/A",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/tuyo-pesto-spaghetti-pasta/",
    "image_url": "",
    "image_path": "",
    "category": "Seafood"
  },
  {
    "title": "Banana Fritter Recipe (Maruya)",
    "ingredients": [
      "▢ 6 pieces banana saba or plantain variety, ripe (mashed)",
      "▢ 1 cup all-purpose flour",
      "▢ 1 1/2 teaspoon vanilla extract",
      "▢ 1 piece egg beaten",
      "▢ 1 teaspoon baking powder",
      "▢ 3/4 cup granulated white sugar",
      "▢ 1 cup fresh milk",
      "▢ 3/4 cups cooking oil",
      "▢ 1/2 teaspoon salt"
    ],
    "instructions": [
      "In a large bowl, combine flour, baking powder, salt, and 1/2 cup sugar. Mix well.",
      "Gradually add the mashed bananas while mixing.",
      "Add the egg, vanilla extract, and milk. Mix to incorporate all the ingredients.",
      "Heat half of the oil in a pan.",
      "When the oil becomes hot, scoop about 1/2 cup of the mixture and then pour in the pan (add the remaining oil in the next batches).",
      "Fry both sides until the color turns golden brown.",
      "Sprinkle the remaining sugar on both sides.",
      "Serve. Share and enjoy!"
    ],
    "cooking_time": "25 minutes",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/banana-fritter-recipe/",
    "image_url": "",
    "image_path": "",
    "category": "Other Filipino Dishes"
  },
  {
    "title": "Pork Burger Steak with Mushroom Gravy Recipe",
    "ingredients": [
      "▢ 1 lb ground pork",
      "▢ ½ teaspoon garlic powder",
      "▢ 1 teaspoon onion powder",
      "▢ 1 teaspoon salt",
      "▢ ½ teaspoon ground black pepper",
      "▢ 3 tablespoons bread crumbs",
      "▢ 1 piece egg",
      "▢ 1 piece Knorr Pork Cube",
      "▢ 4 ounces button mushroom sliced",
      "▢ ¼ cup butter",
      "▢ ¼ cup all-purpose flour",
      "▢ 2 ¼ cups water"
    ],
    "instructions": [
      "Make the burger patty by combining ground pork, garlic powder, onion powder, salt, ground black pepper, and egg in a large bowl. Mix well. Add breadcrumbs. Continue mixing until all ingredients are well blended.",
      "Scoop around 1/3 cup mixture and roll into a ball-shaped figure. Flatten it into a patty.Set aside.",
      "Heat 2 tablespoons cooking oil in a pan. Put the patties and fry for 4 minutes using low to medium heat. Cover the pan while frying to trap the steam inside.",
      "Flip the pork burger patties. Continue frying the other side for 2 minutes. Add ¼ cup water. Cover and steam for 3 minutes. Remove the patties from the pan and place in a clean plate. Note. Perform the same steps until all pork burgers are cooked.",
      "Make the mushroom gravy by melting butter in a pan.",
      "Add mushroom and then cook for 30 seconds. Gradually add the flour while continuously stirring. Cook in low to medium heat until the color turns brown (around 10 to 12 minutes).",
      "Gradually pour the water into the pot while stirring the mixture. Continue stirring until the gravy becomes smooth.",
      "Once the gravy boils, add Knorr Pork Cube. Stir until it completely dissolves.",
      "Arrange the pork burger patties on a serving plate. Top with mushroom gravy and chopped green onions. Serve hot. Share and enjoy!"
    ],
    "cooking_time": "N/A",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/pork-burger-steak-with-mushroom-gravy/",
    "image_url": "",
    "image_path": "",
    "category": "Pork Dishes"
  },
  {
    "title": "Corned Beef Omelet",
    "ingredients": [
      "▢ 12 ounces corned beef",
      "▢ 3 pieces eggs",
      "▢ 1 piece onion",
      "▢ 4  cloves garlic",
      "▢ 3/4  cup green onion chopped",
      "▢ 3 tablespoons Cooking oil",
      "▢ Salt and ground black pepper to taste"
    ],
    "instructions": [
      "Prepare the corned beef by sautéing. Heat oil in a pan and then saute garlic and onion. Add corned beef. Continue to saute for 3 to 5 minutes. Remove from the pan and let it cool down.",
      "Crack the eggs and place in a large mixing bowl. Add the salt and pepper.. Beat until all the ingredients are well incorporated.",
      "Add sautéed Corned beef and green onions. Stir to mix the ingredients. Note: Make sure that the corned beef has cooled down before you execute this step.",
      "Heat a frying pan. Add 1 tablespoon cooking oil or use a cooking oil spray and spray oil on the pan.",
      "Scoop around ½ to ¾ cups of the corned beef and egg mixture and pour in the pan. Cook for 3 minutes on medium heat.",
      "Use a spatula to flip the omelet and cook the other side for 2 to 3 minutes.",
      "Transfer to a serving plate. Serve.",
      "Share and enjoy!"
    ],
    "cooking_time": "15 minutes",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/tortang-corned-beef-omelet/",
    "image_url": "",
    "image_path": "",
    "category": "Other Filipino Dishes"
  },
  {
    "title": "Beef Kaldereta sa Gata with Peanut Butter",
    "ingredients": [
      "▢ 2 lbs. beef chuck cubed",
      "▢ 8 ounces tomato sauce",
      "▢ 1 piece  tomato chopped",
      "▢ 2 cups beef broth",
      "▢ 2 cups coconut mlk",
      "▢ 3 tablespoons peanut butter",
      "▢ 1 piece onion chopped",
      "▢ 5 cloves garlic chopped",
      "▢ 2 pieces potato cubed",
      "▢ 1 piece red bell pepper sliced",
      "▢ 1 piece green bell pepper sliced",
      "▢ 3 pieces Thai chili pepper optional",
      "▢ 3 tablespoons cooking oil",
      "▢ Salt and ground black pepper to taste"
    ],
    "instructions": [
      "Heat oil in a cooking pot.",
      "Saute onion, garlic, and tomato. Continue to saute until onion and tomato softens.",
      "Add beef. Cook until it turns light brown.",
      "Pour tomato sauce and beef broth. Let boil. Cover and cook in low heat until the sauce reduces to half.",
      "Pour coconut milk into the pot. Add Thai chili peppers. Cover and continue to boil until the beef gets tender.",
      "Add peanut butter. Stir.",
      "Add the potato.Cover and cook for 10 minutes.",
      "Put the bell peppers into the pot. Cover and cook for 12 minutes.",
      "Season with salt and ground black pepper.",
      "Transfer to a serving plate and serve with warm white rice. Share and enjoy!"
    ],
    "cooking_time": "N/A",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/beef-kaldereta-sa-gata-with-peanut-butter/",
    "image_url": "",
    "image_path": "",
    "category": "Main Dishes"
  }
]