[
  {
    "title": "How to Make Lasagna",
    "ingredients": [
      "▢ 250 grams of pasta preferably whole wheat",
      "▢ 500 grams of minced meat",
      "▢ 2 tablespoons olive or sesame oil",
      "▢ ½ onion chopped",
      "▢ 1 teaspoon garlic minced",
      "▢ 1 packet of cheese sauce",
      "▢ Cheese as needed grated",
      "▢ Salt and pepper to taste"
    ],
    "instructions": [
      "Fill a pot with water and bring to a boil. Sprinkle a pinch of salt in water and toss is the pasta.",
      "While the pasta cooks, heat 2 tablespoons of olive oil in a pan. Sauté the onions and garlic for 5 minutes. Add minced meat and seasoning, and cook until brown and soft. Remove from heat.",
      "When the pasta is cooked but still slightly undercooked, remove from heat and drain the water. Wait for it to cool. Layer the bottom of a casserole dish with the al dente pasta. Add the meat and pat the surface with a spatula to make sure it is level.",
      "Pour the cheese sauce on top of the meat and level with a spoon. Finally, sprinkle the grated cheese, making sure the top is fully covered.",
      "Bake in 360F until the cheese on top turns golden brown. Serve."
    ],
    "cooking_time": "50 minutes",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/how-to-make-lasagna/",
    "image_url": "",
    "image_path": "",
    "category": "Other Filipino Dishes"
  },
  {
    "title": "Chicharon Bulaklak Recipe",
    "ingredients": [
      "▢ 2 lbs. ruffle fat",
      "▢ 1 tablespoon whole peppercorn",
      "▢ 5 dried bay leaves",
      "▢ 2 ½ tablespoons sea salt",
      "▢ 4 cups canola oil",
      "▢ 6 cups water"
    ],
    "instructions": [
      "Arrange the ruffle fat, whole peppercorn, 2 tablespoons salt, and bay leaves in a cooking pot. Pour-in water. Let boil. Cover and then simmer for 1 hour.",
      "Turn the heat off. Remove the boiled ruffle fat from the pot and then let the water drip-off.",
      "Rub the remaining salt all over the ruffled fat. Set aside.",
      "Meanwhile, heat the cooking oil in a deep fryer or a deep cooking pot.",
      "When the oil gets hot, slowly add-in the ruffled fat. Deep fry in low to medium heat until the texture becomes crisp and the color turns medium brown.",
      "Remove from the deep fryer or cooking pot. Arrange in a plate lined with paper towels to absorb the oil.",
      "Serve with spiced vinegar.",
      "Share and enjoy!"
    ],
    "cooking_time": "1 hour",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/chicharon-bulaklak-recipe/",
    "image_url": "",
    "image_path": "",
    "category": "Other Filipino Dishes"
  },
  {
    "title": "Garlic Shrimp Pasta",
    "ingredients": [
      "▢ 1 lb. shrimp medium, shell and tail removed",
      "▢ 3 teaspoons minced garlic",
      "▢ 4 tablespoons butter softened",
      "▢ 2 1/2 tablespoons extra virgin olive oil",
      "▢ 1/2 teaspoon dried oregano",
      "▢ 3/4 lb. spaghetti noodles cooked according to package instructions",
      "▢ 5 tablespoons shredded Parmesan Cheese",
      "▢ A dash of ground black pepper"
    ],
    "instructions": [
      "Cook the spaghetti noodles according to package instructions. Set aside.",
      "Melt the butter in a pan and then add the olive oil.",
      "Add the shrimp. Cook for 1 minute.",
      "Put-in the garlic. Continue to cook for 1 to 2 minutes or until the garlic turns light brown.",
      "Gradually add-in the cooked spaghetti noodles. Toss until all the ingredients are incorporated.",
      "Add the oregano, parmesan cheese, and ground black pepper. Toss again until all are well distributed.",
      "Transfer to individual pasta bowls.",
      "Serve. Share and enjoy!"
    ],
    "cooking_time": "40 minutes",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/garlic-shrimp-pasta/",
    "image_url": "",
    "image_path": "",
    "category": "Other Filipino Dishes"
  },
  {
    "title": "Tosilog Recipe",
    "ingredients": [
      "▢ 1 lb. uncooked tocino",
      "▢ 3 cups sinangag",
      "▢ 3 sunny-side up eggs",
      "▢ 2 cups water",
      "▢ 1/4 cup cooking oil"
    ],
    "instructions": [
      "Boil the water in a cooking pot.",
      "Once the water starts to boil, pour-in the cooking oil and add the uncooked tocino. Boil in medium heat until the water evaporates.",
      "Once the water completely evaporate, the oil will be left behind. Let one side of the tocino cook in oil for 3 minutes. Flip the tocino and cook the other side for the same time.",
      "Arrange the cooked tocino with the eggs in individual plates.",
      "Meanwhile, remove the excess oil in the cooking pot where the tocino was cooked. Heat the same pot and put-in the sinangag. Cook the fried rice for 1 minute while tossing. The residue from the tocino will stick to the fried rice making it more tasty.",
      "Arrange the fried rice with the tocino in individual plates.",
      "Serve with spiced vinegar.",
      "Share and enjoy!"
    ],
    "cooking_time": "45 minutes",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/tosilog-recipe/",
    "image_url": "",
    "image_path": "",
    "category": "Pork Dishes"
  },
  {
    "title": "Monggo Guisado Recipe",
    "ingredients": [
      "▢ 1 1/4 cup mung beans soaked in 1 1/2 cups water (overnight)",
      "▢ 3/4 cups fish flakes",
      "▢ 1 bunch fresh spinach",
      "▢ 2 tablespoons bagoong isda",
      "▢ 1 small yellow onion",
      "▢ 1 cup diced tomatoes canned or 3 fresh plum tomatoes, cubed",
      "▢ 1 tablespoon minced garlic",
      "▢ 2 cups water",
      "▢ ground black pepper to taste",
      "▢ 2 tablespoons cooking oil"
    ],
    "instructions": [
      "Heat the cooking oil in a pan.",
      "Saute the onion and garlic.",
      "Once the onion becomes soft, add the fish flakes and continue to cook in medium heat for 1 to 2 minutes.",
      "Add the tomatoes. Stir and cook for 1 minute.",
      "Put-in the mung beans. Stir, add the bagoong isda, and 1 cup water. Cover and cook for 15 to 18 minutes. Add more water if necessary.",
      "Sprinkle some ground black pepper and then add the spinach. Stir.",
      "Add more water (around 1 cup or more as needed). Let boil and cook for 5 minutes more.",
      "Adjust the taste by adding more bagoong isda (only of needed).",
      "Transfer to a serving bowl. Serve.",
      "Serve and enjoy!"
    ],
    "cooking_time": "45 minutes",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/monggo-guisado-recipe/",
    "image_url": "",
    "image_path": "",
    "category": "Seafood"
  },
  {
    "title": "Italian Sausage Pasta Recipe",
    "ingredients": [
      "▢ 1 lb. spaghetti noodles",
      "▢ 4 pieces Italian Sausage",
      "▢ 5 to 6 cups marinara sauce",
      "▢ 1/2 cup shredded Parmesan Cheese",
      "▢ 2 tablespoons chopped fresh basil",
      "▢ Salt and pepper to taste"
    ],
    "instructions": [
      "Cook the spaghetti noodles according to package instructions. Set aside.",
      "Heat-up the grill and start grilling the Italian sausage in low heat. Grill the sausages until the inside is completely cooked (around 15 to 25 minutes).",
      "Remove the sausage from the grill. Let it rest for 10 minutes. Slice the sausages diagonally.",
      "Make the marinara sauce by following this marinara sauce recipe. Once the sauce is ready, add the sliced sausage and continue to cook for 5 minutes. Add additional salt and pepper, if needed.",
      "Arrange the spaghetti noodles in a pasta bowl. Top with marinara sauce with Italian sausage.",
      "Sprinkle with chopped basil and Parmesan cheese on top.",
      "Serve. Share and enjoy!"
    ],
    "cooking_time": "1 hour",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/italian-sausage-pasta-recipe/",
    "image_url": "",
    "image_path": "",
    "category": "Other Filipino Dishes"
  },
  {
    "title": "Broccoli Bacon Salad Recipe",
    "ingredients": [
      "▢ 6 bacon slices cooked",
      "▢ 1 head broccoli florets chopped",
      "▢ 1 cup shredded monterrey jack cheese",
      "▢ 1/2 small sweet onion minced",
      "▢ 2 tablespoons rice vinegar or white wine vinegar",
      "▢ 1 tablespoons granulated white sugar",
      "▢ 1/4 teaspoon ground black pepper",
      "▢ 1/4 teaspoon salt",
      "▢ 1/2 cup mayonnaise",
      "▢ 3/4 cup roasted cashews"
    ],
    "instructions": [
      "Prepare the dressing by combining the vinegar, mayonnaise, sugar, pepper, and salt in a bowl. Mix well.",
      "Add the minced onion and stir.",
      "Combine the broccoli and the dressing. Gently toss.",
      "Crumble the bacon and add to the bowl with broccoli. Add the cashew and cheese, as well. Continue to toss gently until all the ingredients are well belended.",
      "Transfer to a serving bowl. Serve.",
      "Share and enjoy"
    ],
    "cooking_time": "25 minutes",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/broccoli-bacon-salad-recipe/",
    "image_url": "",
    "image_path": "",
    "category": "Other Filipino Dishes"
  },
  {
    "title": "Pulled Pork Crock Pot Recipe",
    "ingredients": [
      "▢ 4 lbs. pork shoulder",
      "▢ 1 medium sweet onion minced",
      "▢ 3 tablespoons dark brown sugar",
      "▢ 1/4 cup cane vinegar",
      "▢ 1 tablespoon sea salt",
      "▢ 1 1/2 teaspoons ground black pepper",
      "▢ 1 teaspoon garlic powder",
      "▢ 1/4 cup tomato paste",
      "▢ 1 teaspoon Sriracha sauce"
    ],
    "instructions": [
      "Arrange the minced onion at the bottom of the crock pot.",
      "Lay-in the pork shoulders. You can divide the pork shoulders in half if it does not fit the crock pot.",
      "Combine salt, pepper, sugar, vinegar, garlic powder, and Sriracha sauce in a bowl. Mix well. Pour the mixture in the crock pot. Cover and slow cook for 7 hours.",
      "Remove the pork and let cool. Shred the pork using your hands. Set aside.",
      "Transfer the remaining liquid in a sauce pan. Cook the liquid and reduce in half. Pour over the pulled pork crock pot.",
      "Serve. Share and enjoy"
    ],
    "cooking_time": "7 hours",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/pulled-pork-crock-pot-recipe/",
    "image_url": "",
    "image_path": "",
    "category": "Pork Dishes"
  },
  {
    "title": "Filipino Pork Chop Steak Recipe",
    "ingredients": [
      "▢ 2 lbs. pork chops",
      "▢ 5 to 6 tablespoons soy sauce",
      "▢ 1 1/2 cups water",
      "▢ 1 large red onion peeled and sliced crosswise",
      "▢ juice from 3 limes or 4 large calamansi",
      "▢ Salt and pepper to taste",
      "▢ 1 teaspoon granulated white sugar",
      "▢ 3 tablespoons cooking oil"
    ],
    "instructions": [
      "Heat the oil in a pan.",
      "Pan-fry both sides of the pork chop for 3 to 4 minutes or until medium brown.",
      "Pour-in soy sauce and lime (or calamansi) juice.",
      "Add water and sugar. Let boil. Cover and simmer for 40 minutes or until the pork becomes tender. Note: add more water if needed.",
      "Put-in the onions, salt (only if needed), and pepper. Cook for 8 more minute. Note: The dish should have some sauce in it when its done. Adding enough water in the middle of the process will help as long as you make sure that you control the amount.",
      "Transfer to a serving bowl. Serve with rice.",
      "Share and enjoy!"
    ],
    "cooking_time": "1 hour",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/filipino-pork-chop-steak-recipe/",
    "image_url": "",
    "image_path": "",
    "category": "Pork Dishes"
  },
  {
    "title": "Ube Biko Recipe",
    "ingredients": [
      "▢ 1 1/2 cups glutinous rice or sweet rice malagkit",
      "▢ 1 1/4 cups granulated white sugar",
      "▢ 1 3/4 cups water",
      "▢ 1/2 cup ube powder powdered dehydrated purple yam or freshly grated purple yam",
      "▢ 1/4 teaspoon salt.",
      "▢ 1/2 teaspoon ube flavoring",
      "▢ 4 cups coconut milk"
    ],
    "instructions": [
      "Combine rice and water in a cooking pot. Cover the pot and turn on the heat .",
      "Adjust the heat to a simmer once the water starts to boil. continue to cook the rice until the water is completely absorbed. Note: try to stir the rice once in a while to prevent it from sticking to the cooking pot.",
      "Meanwhile, pour the coconut milk in another cooking pot . Let boil.",
      "Gradually add the sugar while stirring. Put-in the ube powder and stir. Cook for 5 to 7 minutes in low to medium heat while stirring.",
      "Add salt and ube flavoring. Continue to cook for 3 minutes or until the texture becomes thick.",
      "Once the rice absorbs the water, combine the coconut milk mixture to the glutinous rice. Mix well and continue to cook while stirring until the rice is completely cooked and the desired texture is achieved.",
      "Transfer to a serving tray lined with banana leaves.",
      "Top with toasted grated coconut.",
      "Serve. Share and enjoy!"
    ],
    "cooking_time": "1 hour",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/ube-biko-recipe/",
    "image_url": "",
    "image_path": "",
    "category": "Other Filipino Dishes"
  },
  {
    "title": "Inun unan Recipe (Fish cooked in Vinegar)",
    "ingredients": [
      "▢ 2 lbs. fish tulingan, cleaned and innards removed",
      "▢ 1 medium ampalaya bitter gourd, cored and sliced",
      "▢ 1 medium Chinese eggplant sliced",
      "▢ 1 small onion chopped",
      "▢ 1 thumb ginger sliced",
      "▢ 5 pieces long green chili or Serrano pepper",
      "▢ 1/2 cup cane or white vinegar",
      "▢ 1 cup water",
      "▢ 1 teaspoon whole peppercorn"
    ],
    "instructions": [
      "Arrange the onion, fish, ginger, whole peppercorn, water, and vinegar in a cooking pot. Cover the pot and turn the heat on. Let the liquid boil.",
      "Once the liquid starts to boil, adjust the heat to low. Cook for 15 minutes.",
      "Add the eggplant, bitter gourd, and chili (or pepper). Cover the pot and continue to cook until the water completely evaporates.",
      "Transfer to a serving plate. Serve.",
      "Share and enjoy!"
    ],
    "cooking_time": "30 minutes",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/inun-unan-recipe/",
    "image_url": "",
    "image_path": "",
    "category": "Seafood"
  },
  {
    "title": "How to Make Brownies",
    "ingredients": [
      "▢ 1 cup butter preferably unsalted",
      "▢ 2 cups sugar white",
      "▢ 1 tsp. vanilla essence or extract",
      "▢ ½ cup cocoa powder",
      "▢ 4 whole eggs beaten",
      "▢ 1 ½ cups of flour all-purpose",
      "▢ ½ tsp. baking powder",
      "▢ Pinch of salt"
    ],
    "instructions": [
      "Soften butter by leaving it at room temperature for 20-30 minutes. Do not melt. Preheat oven to 350 F.",
      "Combine soft butter with sugar and mix well. Add cocoa powder little by little, mixing thoroughly. Add vanilla and eggs.",
      "In a separate bowl, combine flour, baking powder and salt. Sift the flour into the butter-sugar mixture. Combine and transfer the mixture into a baking pan. Bake for 20-30 minutes until a light crust forms at the top of brownies. Brownies are incredibly easy to make. Create more flavors by adding caramel sauce, cream cheese, chocolate chips, nuts and fruit. Watch your portions and enjoy."
    ],
    "cooking_time": "1 hour",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/how-to-make-brownies/",
    "image_url": "",
    "image_path": "",
    "category": "Other Filipino Dishes"
  },
  {
    "title": "Liempo Estofado Recipe",
    "ingredients": [
      "▢ 2 lbs. pork belly sliced",
      "▢ 4 pieces ripe saba banana peeled and sliced",
      "▢ 2 medium carrots sliced",
      "▢ 1 tablespoon dark brown sugar",
      "▢ 1/2 cup soy sauce",
      "▢ 3 pieces dried bay leaves",
      "▢ 1/4 cup red wine vinegar or cane vinegar",
      "▢ 3 cloves garlic crushed and minced",
      "▢ 1/4 teaspoon ground black pepper",
      "▢ 1 1/2 cups water",
      "▢ 2 tablespoons cooking oil",
      "▢ Salt to taste"
    ],
    "instructions": [
      "Heat the cooking oil in a cooking pot.",
      "Sauté the garlic.",
      "Add the pork and cook for 2 minutes.",
      "Pour-in the soy sauce and water. Add the bay leaves and ground black pepper. Let boil and then simmer for 30 minutes.",
      "Add the vinegar and sugar. Cook for 15 minutes. Note: add water if needed",
      "Put-in the banana and carrots. Cook for 10 minutes.",
      "Add salt to taste.",
      "Transfer to a serving bowl. Serve.",
      "Share and enjoy!"
    ],
    "cooking_time": "1 hour",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/liempo-estofado/",
    "image_url": "",
    "image_path": "",
    "category": "Pork Dishes"
  },
  {
    "title": "Cream of Asparagus Soup",
    "ingredients": [
      "▢ 1 bunch about a pound fresh asparagus, lower end trimmed and then chopped",
      "▢ 1 medium yellow onion minced",
      "▢ 2 tablespoons cooking oil",
      "▢ 1/2 teaspoon minced garlic",
      "▢ 1 cup heavy cream",
      "▢ 2 cups chicken broth",
      "▢ 1 cup water",
      "▢ salt and pepper to taste"
    ],
    "instructions": [
      "Heat the cooking oil in a cooking pot.",
      "Saute the onion, asparagus, and garlic for 5 minutes.",
      "Pour-in water and chicken broth. Bring to a boil. cover and simmer for 15 minutes.",
      "Add the heavy cream.",
      "Start to refine the mixture using an immersion blender. Note: make sure that you take extra caution while blending the mixture.",
      "Once the mixture is smooth and creamy, add salt and pepper to taste.Stir.",
      "Transfer to a serving bowl.",
      "Serve. Share and enjoy!"
    ],
    "cooking_time": "35 minutes",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/cream-of-asparagus-soup/",
    "image_url": "",
    "image_path": "",
    "category": "Chicken Dishes"
  },
  {
    "title": "Nilupak Recipe",
    "ingredients": [
      "▢ 1 lb. grated cassava",
      "▢ 1 cup shredded coconut",
      "▢ 1 can 14 oz. condensed milk",
      "▢ 3 tablespoons salted butter softened",
      "▢ 1/4 teaspoon salt"
    ],
    "instructions": [
      "Combine the grated cassava, shredded coconut, condensed milk, salt, and butter. Mix well.",
      "Place the mixture in a pan. Start to heat the pan and cook the mixture in low to medium heat for 20 to 25 minutes. Gradually stir the mixture while cooking.",
      "Scoop part of a mixture and place it in a mold such as a ramekin or small bowl. Drop the molded mixture in a serving plate lined with cut banana leaves and shredded coconut.",
      "Top with butter. Serve. Share and enjoy!"
    ],
    "cooking_time": "35 minutes",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/nilupak-recipe/",
    "image_url": "",
    "image_path": "",
    "category": "Other Filipino Dishes"
  },
  {
    "title": "Grilled Flank Steak Recipe",
    "ingredients": [
      "▢ 1 1/2 lbs flank steak",
      "▢ 1 serving flank steak marinade use the exact measurement of the recipe in the link",
      "▢ Salt and pepper"
    ],
    "instructions": [
      "Season the steak with a little salt and pepper",
      "Place the flank steak in a strong resealable freezer bag. Pour the Flank steak marinade in the same bag. Let the air out and seal the bag. Place inside the fridge. Marinate the steak in flank steak marinade overnight.",
      "Heat-up the grill. Start to grill the marinated flank steaks for 6 to 7 minutes per side (time will depend on the thickness).",
      "Remove from the grill. Let the meat rest for 10 minutes.",
      "Slice into your desired thickness.",
      "Serve with either white rice, grilled, corn or grilled potatoes on the side.",
      "Share and enjoy!"
    ],
    "cooking_time": "1 hour",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/grilled-flank-steak-recipe/",
    "image_url": "",
    "image_path": "",
    "category": "Desserts"
  },
  {
    "title": "Sausage and Egg Casserole with Hash Browns Recipe",
    "ingredients": [
      "▢ 5 eggs",
      "▢ 1 cup milk",
      "▢ 1/2 pound bulk pork sausage",
      "▢ 1 1/2 cups hash browns",
      "▢ 1 cup shredded Monterrey jack cheese",
      "▢ 1/4 teaspoon salt",
      "▢ 1/8 teaspoon ground black pepper"
    ],
    "instructions": [
      "Cook the sausage in a pan until it turns light to medium brown. Drain the liquid and oil. Set aside.",
      "Beat the eggs in a mixing bowl.",
      "Stir-in the milk, cheese, salt, and pepper. Mix well.",
      "Add the cooked sausage and hash browns. Stir to distribute the ingredients evenly.",
      "Pour the mixture in a baking dish.",
      "Preheat the oven to 350F",
      "Bake for 40 to 45 minutes.",
      "Serve. Share and enjoy!"
    ],
    "cooking_time": "55 minutes",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/sausage-and-egg-casserole-with-hash-brown-recipe/",
    "image_url": "",
    "image_path": "",
    "category": "Pork Dishes"
  },
  {
    "title": "Flank Steak Marinade",
    "ingredients": [
      "▢ 3 tablespoons red wine vinegar",
      "▢ 5 tablespoons dark soy sauce",
      "▢ 2 tablespoons Worcestershire sauce",
      "▢ Juice from 1 lemon",
      "▢ 1 1/2 tablespoon Dijon mustard",
      "▢ 1 /2 teaspoon paprika",
      "▢ 1/4 teaspoon cayenne pepper powder",
      "▢ 1/2 cup canola oil",
      "▢ 2 teaspoons minced garlic",
      "▢ 1/2 teaspoon ground black pepper"
    ],
    "instructions": [
      "Prepare the Flank Steak Marinade by combining vinegar, soy sauce, Worcestershire sauce, and lemon juice in a bowl. Stir.",
      "Add Dijon mustard, paprika, cayenne pepper powder, canola oil, garlic, and ground black pepper. Mix well until all the ingredients are well blended.",
      "Pour the flank steak marinade mixture on flank steaks. This can also be used as a marinade for other steak cuts for grilling.",
      "Share and enjoy!"
    ],
    "cooking_time": "11 minutes",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/flank-steak-marinade-recipe/",
    "image_url": "",
    "image_path": "",
    "category": "Desserts"
  },
  {
    "title": "Inihaw na Tilapia Recipe",
    "ingredients": [
      "▢ 2 medium tilapia fish cleaned (scales, innards, and gills removed)",
      "▢ 1 to 1 1/2 teaspoons sea salt",
      "▢ A dash of ground black pepper",
      "▢ Cooking oil spray for grilling"
    ],
    "instructions": [
      "Pat the tilapia dry using a paper towel.",
      "Arrange the tilapia in a plate and rub salt and pepper all over the fish including its cavity.",
      "Spray cooking oil spray on the grill.",
      "Start to heat the grill.",
      "Grill each side of the tilapia for 10 minutes. Note: use a spatula to turn the fish over so that the sides will be intact and clean.",
      "Transfer to a serving plate. Serve with lime or lemon wedges.",
      "Share and enjoy!"
    ],
    "cooking_time": "30 minutes",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/inihaw-na-tilapia-recipe/",
    "image_url": "",
    "image_path": "",
    "category": "Pork Dishes"
  },
  {
    "title": "Easy Chicken Caesar Salad Recipe",
    "ingredients": [
      "▢ 12 ounces boneless and skinless chicken breast",
      "▢ 3 romaine lettuce hearts chopped",
      "▢ 1 pack croutons any flavor",
      "▢ 3/4 cup grated or shredded Parmesan cheese",
      "▢ 6 pieces peperoncini",
      "▢ 1/2 cup lite Caesar salad dressing",
      "▢ Salt and pepper"
    ],
    "instructions": [
      "Flatten the chicken breast by pounding using a meat tendering tool. Season the chicken with salt and pepper. Grill for 5 to 7 minutes per side depending on the thickness. Remove from the grill and let the chicken rest for 10 minutes. Chop. Set aside.",
      "Prepare the salad by combining the lettuce hearts, croutons, peperoncini, Parmesan Cheese, Caesar salad dressing, and grilled chicken. Toss.",
      "Transfer to a salad bowl. Serve.",
      "Share and enjoy!"
    ],
    "cooking_time": "22 minutes",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/easy-chicken-caesar-salad-recipe/",
    "image_url": "",
    "image_path": "",
    "category": "Chicken Dishes"
  },
  {
    "title": "Ham and Cheese Quiche Recipe",
    "ingredients": [
      "▢ 1 Pastry dough see recipe for homemade pastry dough",
      "▢ 1/2 lb. ham cubed",
      "▢ 1 cup fresh milk",
      "▢ 5 eggs beaten",
      "▢ 1 cup shredded sharp cheddar cheese",
      "▢ 1/2 teaspoon salt",
      "▢ 1/4 teaspoon ground black pepper"
    ],
    "instructions": [
      "Preheat the oven to 350F.",
      "Arrange the pastry dough on a round baking dish.Blind bake for 12 to 15 minutes.",
      "Meanwhile, combine the beaten egg, salt, pepper, milk, and cheese. Mix well.",
      "Add the cubed ham to the egg mixture and stir.",
      "Remove the baking dish from the oven. Pour the entire mixture in the baking dish.",
      "Place it back in the oven. Bake for 35 to 40 minutes at 350F.",
      "Remove from the oven.",
      "Serve. Share and enjoy!"
    ],
    "cooking_time": "1 hour",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/ham-and-cheese-quiche-recipe/",
    "image_url": "",
    "image_path": "",
    "category": "Other Filipino Dishes"
  },
  {
    "title": "Grilled Ahi Tuna Recipe",
    "ingredients": [
      "▢ 1 lb. ahi Tuna",
      "▢ 1/2 cup light soy sauce",
      "▢ 1 teaspoon granulated white sugar",
      "▢ 1/4 teaspoon ground black pepper",
      "▢ 1/2 teaspoon garlic powder"
    ],
    "instructions": [
      "Combine the soy sauce, sugar, garlic powder, and ground black pepper in a bowl. Stir to mix.",
      "Place the ahi tuna in a resealable bag. Pour the soy sauce mixture into the bag. Release the air and seal.Refrigerate and Let the tuna marinate for at least 3 hours.",
      "Remove the tuna from the fridge. Spray high heat cooking oil grill spray on the grill and start to grill the ahi tuna for 4 to 5 minutes per side. Use a spatula to turn the tuna over so that the meat will not get damaged.",
      "Arrange in a serving plate. Serve with mango salsa.",
      "Share and enjoy!"
    ],
    "cooking_time": "3 hours",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/grilled-ahi-tuna-recipe/",
    "image_url": "",
    "image_path": "",
    "category": "Other Filipino Dishes"
  },
  {
    "title": "Sauteed Shrimp with String Beans",
    "ingredients": [
      "▢ 1 lb. shrimp deveined",
      "▢ 1 bunch string beans about 4 cups, sliced in length of 2 inches",
      "▢ 1 medium yellow onion sliced",
      "▢ 1 medium ripe tomato chopped",
      "▢ 4 cloves garlic crushed and chopped",
      "▢ 2 tablespoons soy sauce",
      "▢ 3 tablespoons canola oil",
      "▢ Salt and pepper to taste"
    ],
    "instructions": [
      "Heat the oil in a pan.",
      "Saute the onion, tomato, and garlic.",
      "Sprinkle a dash of ground black pepper.",
      "Once the onion turns soft, put-in the shrimp and stir fry for 2 to 3 minutes.",
      "Add the string beans and soy sauce. Continue to stir fry for 5 minutes.",
      "Add salt and pepper to taste.",
      "Serve. Share and enjoy!"
    ],
    "cooking_time": "22 minutes",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/sauteed-shrimp-string-beans/",
    "image_url": "",
    "image_path": "",
    "category": "Other Filipino Dishes"
  },
  {
    "title": "Breakfast Daing na Bisugo with Sinangag",
    "ingredients": [
      "▢ 3 pieces salted dried bisugo Threadfin bream",
      "▢ 2 tablespoons cooking oil",
      "▢ 1 1/2 cup sinangag",
      "▢ 1/2 cup sinamak or pinakurat spiced vinegar"
    ],
    "instructions": [
      "Heat the cooking oil in a frying pan.",
      "Once the oil is hot, fry all 3 pieces of daing (salted dried fish) at the same time for 1 minute per side. Make sure to quickly turn the fish over to avoid the first side from being burnt.",
      "Once both sides are fried, remove the fish from the pan. Place it in a plate lined with paper towel to absorb the oil.",
      "Transfer the fried daing na bisugo in a plate with sinangag.",
      "Serve with spiced vinegar.",
      "Share and enjoy!"
    ],
    "cooking_time": "25 minutes",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/breakfast-daing-na-bisugo-sinangag/",
    "image_url": "",
    "image_path": "",
    "category": "Seafood"
  },
  {
    "title": "Slow Cooked Beef Brisket Recipe",
    "ingredients": [
      "▢ 2 lbs. beef brisket",
      "▢ 1 10 oz. can beef consomme",
      "▢ 2 tablespoons Worcestershire sauce",
      "▢ 1 medium onion minced",
      "▢ 2 teaspoons garlic minced (optional)",
      "▢ 1/2 teaspoon ground black pepper",
      "▢ 1/2 teaspoon salt"
    ],
    "instructions": [
      "Combine the beef consomme, Worcestershire sauce, salt, and pepper in a bowl. Stir.",
      "Arrange the beef brisket in a crock pot (slow cooker). Add the minced onions and garlic on top.",
      "Pour-in the sauce mixture.",
      "Cover and slow cook the beef brisket for 5 to 6 hours.",
      "Gently remove the beef brisket from the crock pot.",
      "Pour the remaining liquid in a sauce pan and heat over the stove top. Let the sauce reduce to half.",
      "Pour the sauce over the beef brisket.",
      "Serve. Share and enjoy!"
    ],
    "cooking_time": "6 hours",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/slow-cooked-beef-brisket-recipe/",
    "image_url": "",
    "image_path": "",
    "category": "Other Filipino Dishes"
  }
]