[
  {
    "title": "Fried Chicken Potato Salad Recipe",
    "ingredients": [
      "▢ ½ lb. chicken fried",
      "▢ 4 potatoes",
      "▢ 2 carrots",
      "▢ 20 ounces pineapple chunks",
      "▢ 6 cups water",
      "▢ ½ cup green onion chopped",
      "▢ 1 cup cooking oil",
      "▢ 470 ml. Lady’s Choice Mayonnaise",
      "▢ 3 tablespoon sweet pickle relish",
      "▢ ½ teaspoon onion powder",
      "▢ Salt and ground black pepper to taste"
    ],
    "instructions": [
      "Prepare the potato and carrot by boiling 6 cups of water in a cooking pot. Add salt and potato. Boil for 5 minutes. Add carrots. Continue boiling for 8 to 10 minutes or until all vegetables are soft. Remove from the cooking pot, let it cool down, and slice into small cubes. Set aside.",
      "Combine the salad dressing ingredients in a bowl. Mix well. Pour the dressing over the boiled potato and carrot. Toss.",
      "Add pineapple chunks, green onion, and fried chicken. Toss until well blended.",
      "Refrigerate for at least 1 hour before serving.",
      "Share and enjoy!"
    ],
    "cooking_time": "N/A",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/fried-chicken-potato-salad-recipe/",
    "image_url": "",
    "image_path": "",
    "category": "Chicken Dishes"
  },
  {
    "title": "Seafood Lomi Noodles Recipe",
    "ingredients": [
      "▢ 14 oz. wonton noodles",
      "▢ 55 Grams Knorr Crab and Corn Soup",
      "▢ 8 oz. Squid balls.",
      "▢ 8 ounces Kani crab meat",
      "▢ ½ head cabbage shredded",
      "▢ 4 carrots diced",
      "▢ 6 ounces long green beans",
      "▢ 1 egg",
      "▢ 1 onion minced",
      "▢ 5 cloves garlic minced",
      "▢ 2 tablespoons soy sauce",
      "▢ 5 cup water",
      "▢ 3 tablespoons cooking oil",
      "▢ Salt and ground black pepper to taste"
    ],
    "instructions": [
      "Heat oil in a cooking pot. Sauté the garlic and onion until the latter softens.",
      "Add the squid balls and soy sauce. Sauté for 2 minutes.",
      "Combine Knorr Crab and Corn Soup with 5 cups water. Stir until blended. Pour the mixture into the cooking pot. Let it boil.",
      "Add the carrot, kani, long green beans, and cabbage. Cover and cook for 3 minutes.",
      "Add the noodles and egg. Stir and continue cooking for 3 to 5 minutes.",
      "Season with salt and ground black pepper.",
      "Serve hot. Share and enjoy!"
    ],
    "cooking_time": "N/A",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/seafood-lomi-noodles-recipe/",
    "image_url": "",
    "image_path": "",
    "category": "Soups and Stews"
  },
  {
    "title": "Oven BBQ Spare Ribs",
    "ingredients": [
      "▢ 2 lbs. pork baby back ribs",
      "▢ 3 tablespoons brown sugar",
      "▢ 1 ½ teaspoons salt",
      "▢ 1/2 teaspoon ground black pepper",
      "▢ ¾ cup barbecue sauce",
      "▢ 2 teaspoons Knorr Liquid Seasoning",
      "▢ 3 tablespoons Worcestershire sauce",
      "▢ ¼ cup apple juice",
      "▢ 1 ½ teaspoons garlic powder",
      "▢ 1  teaspoon liquid smoke optional"
    ],
    "instructions": [
      "Preheat the oven to 230F.",
      "Combine dry rub ingredients. Mix well. Rub it all over the pork ribs.",
      "Arrange the ribs in a roasting rack.",
      "Combine sauce ingredients in a bowl. Mix well. Pour it over the pork ribs. Cover the roasting rack. Put it in the oven and roast for 3 to 3 ½ hours.",
      "Set the oven to broil mode. Broil for 5 minutes",
      "Remove the ribs from the oven and let it cool down. Transfer the sauce into a saucepan. Boil until the sauce thickens. Set aside.",
      "Arrange the ribs on a serving plate and then brush with the thickened sauce.",
      "Share and enjoy!"
    ],
    "cooking_time": "2 hours",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/oven-baked-broiled-barbeque-spare-ribs-sauce-recipe/",
    "image_url": "",
    "image_path": "",
    "category": "Pork Dishes"
  },
  {
    "title": "Creamy Macaroni Soup (ala Jollibee)",
    "ingredients": [
      "▢ 1 ½ cups elbow macaroni",
      "▢ 2 oz. chicken breast diced",
      "▢ 2 ounces ham Sliced into squares",
      "▢ 1 Knorr Chicken Cube",
      "▢ 62 grams Knorr Cream of Mushroom Soup",
      "▢ 2 carrots diced",
      "▢ 8 oz whole corn kernel",
      "▢ 1 onion minced",
      "▢ 3 cloves garlic minced",
      "▢ 5 cups water",
      "▢ 3 tablespoons butter",
      "▢ Salt and ground black pepper to taste"
    ],
    "instructions": [
      "Melt butter in a cooking pot.",
      "Sauté garlic and onion. Once the onion softens, add the chicken. Cook until it turns light brown in color.",
      "Add ham. Sauté for 2 minutes.",
      "Pour 3 cups of water into the pot. Let it boil.",
      "Add Knorr Chicken Cube and elbow macaroni. Stir and cover the pot. Let the liquid re-boil.",
      "Adjust the heat to medium setting. Boil for 8 minutes.",
      "Combine Knorr Cream of Mushroom Soup with 2 cups of water. Stir until well blended. Pour the mixture into the cooking pot.",
      "Add carrots and corn. Cover the pot and continue cooking for 8 minutes.",
      "Season with salt and ground black pepper as needed.",
      "Transfer to a serving bowl. Serve hot. Share and enjoy!"
    ],
    "cooking_time": "N/A",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/creamy-macaroni-soup-ala-jollibee/",
    "image_url": "",
    "image_path": "",
    "category": "Chicken Dishes"
  },
  {
    "title": "Pinoy Breakfast Omelet and Bacon Garlic Fried Rice",
    "ingredients": [
      "▢ 5 eggs",
      "▢ 1 ½ teaspoons Knorr Liquid Seasoning",
      "▢ 1 tomato sliced",
      "▢ 1 onion sliced",
      "▢ ½ cup cheddar cheese grated",
      "▢ ½ cup green onions chopped",
      "▢ 2 tablespoons butter",
      "▢ 3 tablespoons cooking oil",
      "▢ 4 cups cooked rice",
      "▢ 8 strips bacon cut into small pieces",
      "▢ 5 cloves garlic",
      "▢ 2 teaspoons Knorr Liquid Seasoning",
      "▢ ¼ cup green onions chopped",
      "▢ Salt and ground black pepper to taste"
    ],
    "instructions": [
      "Make the fried rice by searing the bacon until the fat gets extracted and the bacon becomes crispy. Note: You will only need around 3 tablespoons of bacon fat. Remove the excess fat for later use.",
      "Once the bacon gets crispy, add the minced garlic. Cook until it starts to brown.",
      "Put the rice into the pan (using leftover rice is ideal for this recipe). Stir-fry for 3 minutes.",
      "Add Knorr Liquid Seasoning, salt, and ground black pepper, and green onions. Toss and cook for 2 minutes. Transfer to a serving plate. Set aside.",
      "Make the breakfast omelet by heating 3 tablespoons of cooking oil in a pan. Saute the onion until tender. Remove and set aside.",
      "Using the same pan with remaining oil, arrange the sliced tomatoes in a way that it covers the pan.",
      "Add the butter. Let it melt. Cook the tomato for 1 minute.",
      "Add green onions and put the sauteed onion back into the pan while distributing it evenly.",
      "Beat the eggs and add Knorr Liquid Seasoning. Pour the mixture over the onions. Top with grated cheese.",
      "Cover the pan. Adjust the heat to the lowest setting. Continue cooking until the eggs get stiff and the cheese is completely melted. Transfer to a serving plate. Serve with fried rice for breakfast.",
      "Share and enjoy!"
    ],
    "cooking_time": "N/A",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/pinoy-breakfast-omelet-and-bacon-garlic-fried-rice/",
    "image_url": "",
    "image_path": "",
    "category": "Other Filipino Dishes"
  },
  {
    "title": "Tofu Balls with Miswa and Patola Recipe",
    "ingredients": [
      "▢ 3 ounces misua",
      "▢ 1 Knorr Shrimp Cube",
      "▢ 1 patola sliced",
      "▢ 1 bunch  green onions chopped",
      "▢ 4 cloves garlic chopped",
      "▢ 1 onion minced",
      "▢ Fish sauce and ground black pepper to taste",
      "▢ 5 cups water",
      "▢ ½ cup cooking oil",
      "▢ 1 lb. firm tofu",
      "▢ 1 egg beaten",
      "▢ 1 carrot minced",
      "▢ 3 tablespoons green onion minced",
      "▢ 1 onion minced",
      "▢ 6 tablespoons all-purpose flour",
      "▢ 1 teaspoon salt",
      "▢ 1/4 teaspoon ground black pepper"
    ],
    "instructions": [
      "Start making the tofu balls by pressing the tofu to drain excess liquid. Mash it in a bowl and then add all the tofu ball ingredients. Mix well. Mold into balls. Note: you have the option to fry this in oil or to use an air fryer. This recipe suggests frying these in oil.",
      "Heat cooking oil in a pan. Fry the tofu balls until the exterior part turns medium brown. Remove from the pan. Set aside.",
      "Heat 3 tablespoons of cooking oil in a pot. (Note: you can utilize some of the oil used to cook the tofu balls.)",
      "Saute garlic until it starts to brown. Add onion. Cook until the onion softens.",
      "Pour water into the pot. Let it boil.",
      "Add Knorr Shrimp Cube and fried tofu. Cook for 3 to 5 minutes.",
      "Add patola. Cook for 5 minutes.",
      "Put the miswa into the pot. Stir and season with fish sauce and ground black pepper.",
      "Transfer to a serving plate and top with chopped green onions. Share and enjoy!"
    ],
    "cooking_time": "N/A",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/tofu-balls-with-miswa-and-patola-recipe/",
    "image_url": "",
    "image_path": "",
    "category": "Seafood"
  },
  {
    "title": "Pork Binagoongan sa Gata",
    "ingredients": [
      "▢ 3 lbs. pork belly cubed",
      "▢ 40 grams Knorr Ginataang Gulay Recipe Mix",
      "▢ 4 tablespoons shrimp paste",
      "▢ 3 cups water",
      "▢ 1 eggplant sliced",
      "▢ 1 tomato chopped",
      "▢ 1 onion minced",
      "▢ 5 cloves garlic minced",
      "▢ 2 tablespoons white vinegar",
      "▢ 1 teaspoon sugar",
      "▢ 3 long green chili pepper sliced",
      "▢ 5 tablespoons cooking oil",
      "▢ Fish sauce and ground black pepper to taste"
    ],
    "instructions": [
      "Heat a pan and then sear the pork belly. Remove the belly from the pan and set it aside.",
      "Add 2 tablespoons of cooking oil in the same pan. Fry the eggplants for 2 minutes per side. Remove and set aside.",
      "Heat remaining oil in a pan. Sauté garlic, onion, and tomato. Add the shrimp paste (bagoong alamang) and cook it for 2 minutes.",
      "Add the seared pork back once the onion softens. Cook for 1 minute.",
      "Pour water and let the mixture boil. Adjust the heat to a low setting. Cook for 35 minutes.",
      "Combine Knorr Gintaang Gulay Mix with 1 cup water. Pour the mixture into the pot. Add vinegar. Cover and continue cooking until the pork become tender.",
      "Add the fried eggplants, long green peppers, along with a teaspoon of sugar. Cook for 2 minutes.",
      "Season with fish sauce and ground black pepper. Serve with rice. Share and enjoy!"
    ],
    "cooking_time": "N/A",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/pork-binagoongan-sa-gata/",
    "image_url": "",
    "image_path": "",
    "category": "Pork Dishes"
  },
  {
    "title": "Suam na Mais",
    "ingredients": [
      "▢ 30 ounces white corn kernels",
      "▢ 37 grams Knorr Crab and Corn Soup",
      "▢ 1 bunch  hot pepper leaves or spinach",
      "▢ 4 ounces ground pork",
      "▢ 8 ounces shrimp chopped",
      "▢ 1 onion minced",
      "▢ 3 cloves garlic minced",
      "▢ 4 cups water",
      "▢ 3 tablespoons cooking oil",
      "▢ Fish sauce and ground white pepper to taste"
    ],
    "instructions": [
      "Heat oil in a cooking pot. Sauté garlic and onion.",
      "Once the onion softens, add the ground pork. Sauté It for 2 minutes or until the exterior turns light to medium brown in color.",
      "Add the white corn. Cook it for 3 minutes.",
      "Put the shrimp into the cooking pot. Sauté it for 1 minute.",
      "Combine Knorr Crab and Corn Soup with water. Mix well. Pour the mixture into the cooking pot. Stir and let it boil. Continue cooking in low to medium heat setting for 3 minutes while stirring.",
      "Add the hot pepper leaves or spinach and season with ground white pepper and fish sauce.",
      "Serve hot with rice and pair it with fried pork chop.",
      "Share and enjoy!"
    ],
    "cooking_time": "N/A",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/suam-na-mais/",
    "image_url": "",
    "image_path": "",
    "category": "Pork Dishes"
  },
  {
    "title": "Pinoy Carbonara with Ham and Bacon",
    "ingredients": [
      "▢ 300 grams spaghetti",
      "▢ 68g  Knorr Cream of Mushroom Soup",
      "▢ 8 strips bacon cut into ½ cm slices",
      "▢ 1 tablespoon butter",
      "▢ 2 cloves garlic finely chopped",
      "▢ ½ cup button mushrooms sliced",
      "▢ 4 tablespoons all-purpose flour",
      "▢ 3 cups water",
      "▢ 1/4 cup grated Parmesan Cheese",
      "▢ Ground black pepper to taste"
    ],
    "instructions": [
      "Cook the spaghetti based on package instructions. Drain the water and set it aside.",
      "Heat pan. Add the bacon. Cook until crispy. Remove from the pan. Set aside.",
      "Melt butter on the same pan where the bacon was cooked. Saute garlic for 10 seconds. Add mushrooms and all-purpose flour. Cook for 30 seconds while stirring.",
      "Combine Knorr Cream of Mushroom Soup and water. Stir. Pour the mixture into the pan. Continue cooking while stirring until the sauce thickens to your desired consistency.",
      "Season with parmesan cheese and ground black pepper.",
      "Turn the heat off and toss the pasta.",
      "Transfer to a serving plate and top with bacon slices and more parmesan cheese.",
      "Serve. Share and enjoy!"
    ],
    "cooking_time": "N/A",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/pinoy-carbonara-with-ham-and-bacon/",
    "image_url": "",
    "image_path": "",
    "category": "Soups and Stews"
  },
  {
    "title": "Creamy Beef with Mushroom",
    "ingredients": [
      "▢ 2 lbs. beef sirloin sliced thinly",
      "▢ 8 ounces button mushrooms",
      "▢ 62 grams  Knorr Cream of Mushroom Soup",
      "▢ 1 head  garlic sliced",
      "▢ 1 onion diced",
      "▢ 2 cups water",
      "▢ 3 tablespoons butter",
      "▢ 1 tablespoon cooking oil",
      "▢ 1 tablespoon parsley chopped",
      "▢ Salt and ground black pepper to taste"
    ],
    "instructions": [
      "Melt butter in a pan. Add cooking oil.",
      "Sauté garlic until it browns. Add onion and cook until it softens.",
      "Add the beef. Cook while stirring until the sides turn brown.",
      "Pour 1 cup water. Cover the pan. Adjust to a simmer and continue cooking for 35 minutes.",
      "Add button mushrooms. Stir.",
      "Combine 1 cup water and Knorr Cream of Mushroom in a bowl. Mix well.",
      "Pour the mixture into the pan. Let it boil. Continue cooking uncovered for 10 to 15 minutes using low heat setting.",
      "Season with salt and ground black pepper.",
      "Top with parsley. Serve warm with rice.",
      "Share and enjoy!"
    ],
    "cooking_time": "N/A",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/creamy-beef-with-mushroom/",
    "image_url": "",
    "image_path": "",
    "category": "Soups and Stews"
  },
  {
    "title": "Creamy Sipo Egg with Chicken Gizzard",
    "ingredients": [
      "▢ 2 lbs. chicken gizzard cleaned",
      "▢ 62 grams Knorr Cream of Mushroom Soup",
      "▢ 12 quail eggs",
      "▢ ¾ cups frozen green peas",
      "▢ 1 carrot cubed",
      "▢ ¾ cup sweet corn kernels",
      "▢ 1 jicama cubed",
      "▢ 3 cloves garlic minced",
      "▢ 1 onion chopped",
      "▢ 7 ounces all-purpose cream optional",
      "▢ 3 tablespoons butter",
      "▢ 1 tablespoon cooking oil"
    ],
    "instructions": [
      "Boil 2 cups of water in a cooking pot. Add the quail eggs. Boil for 2 minutes. Let it cool down and peel off the shell. Set aside.",
      "Boil 5 cups of water in a cooking pot. Add the chicken gizzard. Cover and then continue boiling using low heat for 45 minutes or until the gizzard becomes tender. Drain the water and set the gizzards aside.",
      "Melt butter in a pan. Add cooking oil.",
      "Sauté garlic and onion until the onion softens and the garlic browns a bit.",
      "Add the boiled chicken gizzard. Sauté for 2 minutes.",
      "Combine Knorr Cream of Mushroom Soup with 3 cups of water. Stir. Pour the mixture into the pan. Let it boil.",
      "Add carrot, corn, jicama, and green peas. Cook uncovered for 2 minutes in a low to medium heat setting.",
      "Add all-purpose cream and boiled quail eggs.",
      "Season with salt and ground black pepper.",
      "Transfer to a serving plate. Serve warm with rice.",
      "Share and enjoy!"
    ],
    "cooking_time": "N/A",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/creamy-sipo-egg-with-chicken-gizzard/",
    "image_url": "",
    "image_path": "",
    "category": "Chicken Dishes"
  },
  {
    "title": "Pepper Pork Belly",
    "ingredients": [
      "▢ 2 lbs. pork belly",
      "▢ 1 tablespoon Knorr Liquid Seasoning",
      "▢ 1 red bell pepper",
      "▢ 1 green bell pepper",
      "▢ 1 orange bell pepper",
      "▢ 1 tablespoon oyster sauce",
      "▢ 3 tablespoons soy sauce",
      "▢ 1 teaspoons brown sugar",
      "▢ 1 ½ teaspoons cornstarch",
      "▢ 1 onion chopped",
      "▢ 4 cloves garlic crushed",
      "▢ 2 cups water",
      "▢ 3 tablespoons cooking oil",
      "▢ Salt and ground black pepper to taste"
    ],
    "instructions": [
      "Heat cooking oil in a cooking pot.3 tablespoons cooking oil",
      "Sauté onion and garlic.1 onion, 4 cloves garlic",
      "Add pork belly once the onion softens. Continue sautéing until the exterior of the pork turns light brown.2 lbs. pork belly",
      "Add Knorr Liquid Seasoning, oyster sauce, soy sauce, and water. Let it boil. Cover the pot. Adjust the heat to a low setting. Cook until the pork becomes tender. Note: add water as needed.1 tablespoon Knorr Liquid Seasoning, 1 tablespoon oyster sauce, 3 tablespoons soy sauce, 2 cups water",
      "Add the sugar and put all the bell peppers into the pot. Cook for 3 minutes.1 red bell pepper, 1 orange bell pepper, 1 teaspoons brown sugar, 1 green bell pepper",
      "Combine cornstarch with 3 tablespoons of water. Stir. Pour the mixture into the pot.1 ½ teaspoons cornstarch",
      "Once the sauce thickens, season your dish with salt and ground black pepper.Salt and ground black pepper to taste",
      "Transfer to a serving plate. Serve with rice. Share and enjoy!"
    ],
    "cooking_time": "N/A",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/pepper-pork-belly/",
    "image_url": "",
    "image_path": "",
    "category": "Pork Dishes"
  }
]