[
  {
    "title": "Bok Choy in Garlic Sauce",
    "ingredients": [
      "▢ 1 lb bok choy",
      "▢ 1 teaspoon ginger grated",
      "▢ 2 cloves garlic minced",
      "▢ 1 tablespoon oyster sauce",
      "▢ 1 tablespoon soy sauce",
      "▢ 1 tablespoon brown sugar",
      "▢ 1/4 cup water",
      "▢ 1 tablespoon sesame oil",
      "▢ 1 tablespoon vegetable oil"
    ],
    "instructions": [
      "Combine soy sauce, water, garlic, ginger, oyster sauce, sugar and mix well. Set aside.1 teaspoon ginger, 2 cloves garlic, 1 tablespoon oyster sauce, 1 tablespoon soy sauce, 1/4 cup water, 1 tablespoon brown sugar",
      "Heat a wok or frying pan then put-in the cooking oil.1 tablespoon vegetable oil",
      "When the cooking oil is hot enough, pour-in the sesame oil.1 tablespoon sesame oil",
      "Stir fry the bok choy. Put the stalks first and stir fry for about 2 minutes then add the leaves and stir fry for 2 to 4 minutes.1 lb bok choy",
      "Turn off the heat and transfer the cooked bok choy in a serving plate.",
      "Heat the same wok or frying pan then pour-in the sauce mixture. Cook for about 2 minutes or until the sauce thickens.",
      "Turn off heat then top the sauce over the Bok Choy.",
      "Serve. Share and enjoy!"
    ],
    "cooking_time": "17 minutes",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/bok-choy-in-garlic-sauce-recipe/",
    "image_url": "",
    "image_path": "",
    "category": "Other Filipino Dishes"
  },
  {
    "title": "Buttermilk Fried Chicken",
    "ingredients": [
      "▢ 1 lb. chicken cut into serving pieces",
      "▢ 2 cups cooking oil",
      "▢ 2 cups buttermilk",
      "▢ 1 teaspoon paprika",
      "▢ 1 teaspoon onion powder",
      "▢ ½ teaspoon garlic powder",
      "▢ 1 teaspoon salt",
      "▢ ½ teaspoon ground black pepper",
      "▢ ¾ cup all-purpose flour",
      "▢ 1 teaspoon salt",
      "▢ 1 teaspoon onion powder",
      "▢ 1 teaspoon paprika"
    ],
    "instructions": [
      "Combine chicken with marinade ingredients in a bowl. Mix well. Cover the bowl and refrigerate for 8 hours.",
      "Combine all breading ingredients in a clean bowl. Mix well. Set aside.",
      "Heat oil in a pan.",
      "While the oil is heating up, separate the chicken from the remaining buttermilk. Do not wash the chicken. Dredge each chicken piece in flour mixture until fully coated. Shake-off excess flour.",
      "Once the oil temperature reaches 350F, fry the chicken for 9 to 11 minutes. Turn it over and continue frying the opposite side for 8 minutes or until the chicken gets fully cooked (165F internal temperature).",
      "Remove the fried chicken from the pan. Place it on a plate lined with a paper towel.",
      "Serve with chicken gravy."
    ],
    "cooking_time": "30 minutes",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/buttermilk-fried-chicken-recipe/",
    "image_url": "",
    "image_path": "",
    "category": "Chicken Dishes"
  },
  {
    "title": "Creamy Tuyo Pesto",
    "ingredients": [
      "▢ 1/2 lb. spaghetti noodles",
      "▢ 4 to 5 pieces cooked tuyo salted dried fish, flaked",
      "▢ 3 to 5 cloves garlic",
      "▢ 1/2 teaspoon ground black pepper",
      "▢ 1/2 teaspoon salt",
      "▢ 1/2 cup of extra virgin olive oil",
      "▢ 3/4 cup parmesan cheese grated",
      "▢ 1 cup fresh basil leaves",
      "▢ 3/4 cup heavy whipping cream",
      "▢ 2 tablespoons butter",
      "▢ 1/4 cup water",
      "▢ 2 tablespoons butter"
    ],
    "instructions": [
      "Heat a cooking pan then pour-in water. Let boil.",
      "Cook the spaghetti noodles according to package instructions. Set aside.",
      "Combine garlic and olive oil in a blender or food processor then blend until finely chopped.",
      "Add salt, ground black pepper, basil leaves, and half of the parmesan cheese then blend until the texture becomes fine. You may add extra olive oil as needed. Set aside.",
      "Heat a cooking pot and pour-in water and heavy whipping cream. Stir.",
      "When the mixture is hot enough, put-in butter and stir until melted.",
      "Add-in the tuyo flakes and pesto then stir.",
      "Put-in the remaining parmesan cheese and stir. Simmer until the texture thickens.",
      "Turn off heat. Top noodles with sauce.",
      "Serve. Share and enjoy!"
    ],
    "cooking_time": "30 minutes",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/creamy-tuyo-pesto-pasta-recipe/",
    "image_url": "",
    "image_path": "",
    "category": "Seafood"
  },
  {
    "title": "Sinigang na Buto buto with Gabi Recipe",
    "ingredients": [
      "▢ 1 lb pork neck bones",
      "▢ 2 pieces eggplants sliced",
      "▢ 1 medium radish sliced",
      "▢ 5 to 8 pieces okra",
      "▢ 3 pieces medium tomatoes quartered",
      "▢ 3 pieces long green chili or siling pangsigang",
      "▢ 1 pack tamarind base sinigang mix good for 2 liters",
      "▢ 4 pieces taro root gabi, halved",
      "▢ 3 cups water spinach kangkong or ong choy, leaves separated and stems chopped",
      "▢ 1 medium onion diced",
      "▢ 3 cloves garlic minced",
      "▢ 2 tablespoons fish sauce",
      "▢ 6 cups water",
      "▢ 2 tablespoons cooking oil"
    ],
    "instructions": [
      "Heat a cooking pot then pour-in cooking oil.",
      "When the oil is hot enough, sauté garlic and onion.",
      "Add the pork neck bones and fish sauce.",
      "Pour-in water then bring to a boil.",
      "Add tomatoes and simmer for 40 minutes or until pork is tender.",
      "Add the sinigang mix, radish, long green chilies, and taro root (gabi) and simmer for 8 minutes.",
      "Put-in the eggplant and okra then simmer for another 5 minutes.",
      "Put-in the water spinach and stir. Turn off heat and cover the cooking pot for at least 5 minutes (this will cook the water spinach).",
      "Transfer to a serving plate then serve.",
      "Share and enjoy!"
    ],
    "cooking_time": "1 hour",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/sinigang-na-buto-buto-with-gabi-recipe/",
    "image_url": "",
    "image_path": "",
    "category": "Seafood"
  },
  {
    "title": "Chicken Teriyaki  Recipe",
    "ingredients": [
      "▢ 1 lb chicken chopped into serving pieces",
      "▢ 2 tablespoons sake",
      "▢ 5 tablespoons soy sauce",
      "▢ 4 tablespoons mirin",
      "▢ 2 tablespoons brown sugar",
      "▢ 2 teaspoon sesame seeds toasted (optional)"
    ],
    "instructions": [
      "Combine sake, mirin, soy sauce, and brown sugar in a bowl or freezer bag then mix well.",
      "Add the chicken and marinade for at least 1 hour.",
      "Grill the chicken until both sides are cooked. Since the chicken is marinated with sugar, try to use low heat if possible to cook the meat without easily burning the skin. Set aside.",
      "Heat a small saucepan and pour-in the remaining marinade. Add proportional amounts of soy sauce and sugar plus a little water if necessary. Let boil.",
      "Simmer until the sauce thickens. Turn-off heat.",
      "Place the chicken in a serving plate then top with Teriyaki Sauce. Garnish with sesame seeds, if desired.",
      "Serve hot with steamed rice. Share and Enjoy!"
    ],
    "cooking_time": "1 hour",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/how-to-cook-chicken-teriyaki/",
    "image_url": "",
    "image_path": "",
    "category": "Chicken Dishes"
  },
  {
    "title": "Minatamis na Saging",
    "ingredients": [
      "▢ 4 pieces saba banana saging na saba",
      "▢ 3/4 cup brown sugar",
      "▢ 1 1/2 cups water",
      "▢ 1 teaspoon vanilla extract",
      "▢ 1/4 teaspoon salt"
    ],
    "instructions": [
      "Heat a cooking pot and pour-in water then let boil.",
      "Add brown sugar and stir until diluted.",
      "Add salt and vanilla extract and mix well.",
      "Put-in the plantains and adjust the heat to medium. Cover the cooking pot and simmer for 8 to 12 minutes or until the liquid thickens.",
      "Turn-off heat and allow the plantains to cool."
    ],
    "cooking_time": "40 minutes",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/minatamis-na-saging-recipe/",
    "image_url": "",
    "image_path": "",
    "category": "Other Filipino Dishes"
  },
  {
    "title": "Pancit Malabon Recipe",
    "ingredients": [
      "▢ 1 lb thick rice noodles",
      "▢ 1/2 lb pork belly boiled and sliced",
      "▢ 1/2 cup annatto seeds diluted in 1/2 cup water also known as annatto water",
      "▢ 3/4 cup shrimp juice",
      "▢ 3 tablespoons fish sauce patis",
      "▢ 1/2 teaspoon ground black pepper",
      "▢ 1 tablespoon fresh garlic minced",
      "▢ 1 medium-sized onion minced",
      "▢ 1/4 cup pork rinds chicharon, pounded",
      "▢ 1/2 lb shrimp shelled, cooked, and halved lengthwise",
      "▢ 1/4 lb adobong pusit sliced",
      "▢ 1/2 cup pork rinds chicharon, pounded",
      "▢ 1 cup napa cabbage pechay baguio, chopped then blanched",
      "▢ 1 piece lemon quartered",
      "▢ 3/4 cup tinapa flakes",
      "▢ 3 pieces hard boiled eggs sliced",
      "▢ 1 tablespoon parsley chopped",
      "▢ 2 tablespoons toasted garlic"
    ],
    "instructions": [
      "Cook the noodles according to package instructions. If you are using the traditional Pancit Malabon noodles, you will need to soak it in water overnight before cooking. Set aside.",
      "Start making the sauce by sautéing the minced garlic and onion.",
      "Add chopped boiled pork and cook for 3 minutes.",
      "Add fish sauce and ground black pepper then stir.",
      "Pour-in shrimp juice and annatto water and let boil.",
      "Add pounded pork rinds (chicharon) then stir.",
      "Simmer for 2 to 3 minutes then turn off heat.",
      "Place the cooked noodles in a large bowl then pour-in the sauce and mix well.",
      "Transfer the sauce and noodle mixture in a wide serving plate and arrange the tinapa flakes, eggs, parsley, garlic, and cabbage on top.",
      "Serve with lemon or calamansi and a lot of love. Share and enjoy!"
    ],
    "cooking_time": "1 hour",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/pancit-malabon-recipe/",
    "image_url": "",
    "image_path": "",
    "category": "Chicken Dishes"
  },
  {
    "title": "Buko Pie",
    "ingredients": [
      "▢ 2 cups all-purpose flour",
      "▢ 1/3 cup butter",
      "▢ 1 teaspoon salt",
      "▢ 1/3 cup vegetable shortening",
      "▢ 6 to 8 tablespoons cold water",
      "▢ 2 cups young coconut meat",
      "▢ 3/4 cup granulated white sugar",
      "▢ 1/2 cup cornstarch diluted in 1/2 cup young coconut water",
      "▢ 1/2 cup evaporated milk"
    ],
    "instructions": [
      "Create the crust. Combine flour and salt then mix using a balloon whisk. Add butter and shortening then mix using a pastry mixer. Gradually add cold water a tablespoon at a time while mixing the ingredients. When everything is completely mixed, gather the mixture and divide into two equal parts. In a flat surface flatten each of the dough and roll using a rolling pin until wide enough to fit an eight or nine inch cake pan. Note: Sprinkle flour over the flat surface to prevent the dough from sticking or use a silicon mat. Arrange the first dough over the cake pan. This will be the base. Set the second flattened dough aside. This will be needed after arranging the filling in the cake pan.",
      "Make the filling by heating a saucepan and pour-in the milk. Let boil.",
      "Add the granulated white sugar and stir.",
      "Put-in the young coconut meat and cook for 3 minutes.",
      "Pour-in the cornstarch diluted in young coconut water and stir thoroughly while cooking. Cook until the texture thickens.",
      "Turn-off the heat and allow the mixture to cool down.",
      "Preheat oven to 375 degrees Fahrenheit.",
      "Arrange the cooked filling in the cake pan.",
      "Put the second crust over the filling and seal the sides.",
      "Create holes on the secondary crust using a fork. This will serve as exhaust vents that will prevent the crust from deforming.",
      "Bake for 45 to 55 minutes or until the color turns golden brown. Note: Baking time may vary; make sure to check the color of the crust to determine if baking is complete.",
      "Let cool and serve. Share and enjoy!"
    ],
    "cooking_time": "1 hour",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/coconut-buko-pie-recipe/",
    "image_url": "",
    "image_path": "",
    "category": "Other Filipino Dishes"
  },
  {
    "title": "Sardines with Misua Recipe",
    "ingredients": [
      "▢ 1 small can sardines in tomato sauce",
      "▢ 2 ounces misua thin flour noodles",
      "▢ 2 tablespoons fish sauce",
      "▢ 1/4 teaspoon ground black pepper",
      "▢ 2 cloves garlic minced",
      "▢ 1 small onion minced",
      "▢ 1 1/2 cups water",
      "▢ 1 tablespoon toasted garlic",
      "▢ 1 teaspoon scallion chopped",
      "▢ 2 tablespoons cooking oil"
    ],
    "instructions": [
      "Heat a cooking pot and pour-in oil.",
      "When the oil is hot enough, sauté garlic and onions.",
      "Add the sardines including the sauce and cook for 2 minutes.",
      "Put-in fish sauce and ground black pepper then stir.",
      "Add water and let boil.",
      "Put-in the misua and cook for 3 to 5 minutes under medium heat.",
      "Turn-off the heat and transfer to a serving bowl.",
      "Garnish with toasted garlic and chopped scallions on top.",
      "Serve hot. Share and enjoy!"
    ],
    "cooking_time": "15 minutes",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/how-to-cook-sardines-with-misua-recipe/",
    "image_url": "",
    "image_path": "",
    "category": "Seafood"
  },
  {
    "title": "Kinilaw na Dulong",
    "ingredients": [
      "▢ 1/2 lb silverfish dulong, cleaned",
      "▢ 1 to 2 pieces lemon or 6 to 8 pieces calamansi",
      "▢ 1 1/2 tablespoons ginger minced",
      "▢ 2 teaspoons salt",
      "▢ 1/2 teaspoon ground black pepper",
      "▢ 1 to 2 teaspoons birds eye chili siling labuyo, minced"
    ],
    "instructions": [
      "Combine silverfish, salt, and ground black pepper then gently mix until everything is well incorporated.",
      "Add minced ginger and minced bird’s eye chili then continue mixing until everything is distributed.",
      "Squeeze-in lemon (or calamansi) and gently stir the mixture to distribute the juice.",
      "Refrigerate for at least 30 minutes. At this stage, the citric acid in lemon or calamansi will gently cook the fish.",
      "Transfer to a serving bowl and serve.",
      "Share and enjoy!"
    ],
    "cooking_time": "40 minutes",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/kilawin-kinilaw-na-dulong-recipe/",
    "image_url": "",
    "image_path": "",
    "category": "Seafood"
  },
  {
    "title": "Papaitan Recipe",
    "ingredients": [
      "▢ 1/2 lb ox tripe",
      "▢ 1/2 lb cow’s small intestine",
      "▢ 1/2 lb beef thinly sliced and chopped",
      "▢ 1/2 lb cow’s heart",
      "▢ 2 tbsp bile",
      "▢ 2 thumbs  ginger julienned",
      "▢ 1 piece onion diced",
      "▢ 6 cloves garlic crushed and chopped",
      "▢ 8 cups water",
      "▢ 4 to 6 pieces finger chilies",
      "▢ 2 1/2 tablespoons salt",
      "▢ 1/2 tablespoon ground black pepper",
      "▢ 1 to 2 pieces lemon or 5 to 8 pieces calamansi",
      "▢ 2 tablespoons cooking oil"
    ],
    "instructions": [
      "Heat a cooking pot and pour-in 4 cups of water and put-in 1 tablespoon salt. Bring to a boil.",
      "Put-in the ox tripe and small intestines and simmer until tender. This should take approximately 35 to 50 minutes.",
      "Turn off heat. Remove the tender ox tripe and small intestines then slice. Set aside. Discard the water.",
      "Heat a clean cooking pot and pour-in cooking oil.",
      "When the oil is hot enough, sauté garlic, onion, and ginger.",
      "Add the beef, heart, sliced intestines, and tripe then cook for about 3 to 4 minutes.",
      "Add 1 1/2 tablespoon salt and ground black pepper then stir for a minute.",
      "Pour-in remaining 4 cups of water and bring to a boil. Simmer for 40 minutes (you may add more water if needed).",
      "Add bile then simmer for 5 minutes.",
      "Add the finger chilies and squeeze-in the lemon juice then simmer for 3 minutes.",
      "Turn off the heat and transfer to a serving bowl.",
      "Serve hot. Share and enjoy!"
    ],
    "cooking_time": "1 hour",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/papaitan-recip/",
    "image_url": "",
    "image_path": "",
    "category": "Other Filipino Dishes"
  }
]