[
  {
    "title": "Maxs Style Fried Chicken with Kamote Fries",
    "ingredients": [
      "▢ 2 lbs. whole chicken",
      "▢ 1 piece Knorr chicken cube",
      "▢ 1 bunch green onion",
      "▢ 1 bunch lemongrass",
      "▢ 1 tablespoon whole peppercorn",
      "▢ 1 piece onion wedged",
      "▢ 2 tablespoons Knorr Liquid Seasoning",
      "▢ 1 piece sweet potato peeled and sliced",
      "▢ 1 ½ teaspoons salt",
      "▢ 3.5 cups cooking oil",
      "▢ 2 quarts water"
    ],
    "instructions": [
      "Boil water in a cooking pot. Add onion, peppercorns, and Knorr chicken cube.",
      "Prepare chicken by inserting green onion and lemongrass into cavity.",
      "Add chicken into the pot. Boil between low to medium heat for 35 minutes. Turn the chicken over and continue boiling the opposite side for 15 minutes. Remove from the pot and let it cool down.",
      "Start preparing the kamote fries by boiling sliced kamote in the remaining stock used to cook the chicken for 3 minutes. Remove from the pot. Let dry and set aside.",
      "Clear the cavity of the chicken and rub Knorr Liquid Seasoning all over . Air dry for at least 3 hours. Slice the chicken in half.",
      "Pour oil in a pot and heat to 360F. Deep-fry chicken for 5 minutes (skin part down). Turn it over and deep-fry opposite side for 3 minutes. Remove from the pan and perform the same steps on the other half chicken.",
      "Put the first half chicken that was fried earlier back into the pot, skin side down. Fry for 3 minutes. Do the same to the remaining half. Remove from the pot and set aside.",
      "Deep-fry kamote in remaining oil until golden brown and crispy.",
      "Arrange fried chicken with kamote fries on a serving plate. Serve. Share and enjoy!"
    ],
    "cooking_time": "N/A",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/maxs-style-fried-chicken-with-kamote-fries/",
    "image_url": "",
    "image_path": "",
    "category": "Chicken Dishes"
  },
  {
    "title": "Pork Menudo sa Gata with Peas and Capsicum",
    "ingredients": [
      "▢ 2 lbs. pork cubed",
      "▢ 1 piece Knorr Pork Cube",
      "▢ 1 piece potato cubed",
      "▢ 1 piece carrot cubed",
      "▢ 3/4 cup green peas",
      "▢ 1 piece red bell pepper",
      "▢ 8 ounces tomato sauce",
      "▢ 2 cups coconut milk",
      "▢ 3 tablespoons cooking oil",
      "▢ Salt and ground black pepper to taste"
    ],
    "instructions": [
      "Heat oil in a pan. Add onion. Cook for 20 seconds. Put the garlic in the pan. Saute until onion becomes tender.",
      "Add pork. Saute until the pork turns light brown.",
      "Pour tomato sauce and stir. Add coconut milk. Stir and let boil.",
      "Add Knorr Pork Cube. Stir. Cover the pan and continue cooking between low to medium heat for 45 minutes to 1 hour, or until tender. Note: you can add more water as needed.",
      "Put the potato and carrot into the pan. Cover and cook using medium heat for 8 minutes.",
      "Add red bell pepper and green peas. Cook for 3 minutes.",
      "Season with ground black pepper and salt.",
      "Transfer to a serving plate. Serve and enjoy!"
    ],
    "cooking_time": "N/A",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/pork-menudo-sa-gata/",
    "image_url": "",
    "image_path": "",
    "category": "Main Dishes"
  },
  {
    "title": "Sinantomas",
    "ingredients": [
      "▢ 3 lbs. pork ribs",
      "▢ 1 piece sweet potato cubed",
      "▢ 5 cloves garlic chopped",
      "▢ 1 piece onion chopped",
      "▢ 1 pieces tomato chopped",
      "▢ 1 1/2 tablespoons fish sauce",
      "▢ 1/2 cup soy sauce",
      "▢ 1 cup pineapple juice",
      "▢ 1/4 cup banana ketchup",
      "▢ 1 1/2 cups water",
      "▢ 1 1/2 teaspoon whole peppercorn cracked",
      "▢ 1/2 cup cooking oil"
    ],
    "instructions": [
      "Prepare the ribs by removing the membrane and slicing it into serving pieces.",
      "Combine the marinade ingredients along with the ribs in a big bowl. Start with the ground black pepper, fish sauce, soy sauce, and pineapple juice. Mix well. Marinate for at least 3 hours. Note: the longer the better.",
      "Heat oil in a pan. Fry the sweet potato until it turns light brown. Remove and set aside.",
      "Using the remaining oil, pan-fry ribs for 3 minutes per side. Remove from the pan. Set aside.",
      "Saute onion using remaining oil. Add garlic and tomato. Cook until onion softens.",
      "Pour-in remaining rib marinade ingredients. Let it boil.",
      "Add ribs back into the bowl. Pour water. Let boil.",
      "Add banana ketchup. Stir and cover the pan. Continue cooking in low heat for 1 to 1 ½ hours or until the meat gets tender.",
      "Add the sweet potato back in the pan. Cook for 3 minutes.",
      "Transfer to a serving plate. Serve with warm rice."
    ],
    "cooking_time": "N/A",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/sinantomas/",
    "image_url": "",
    "image_path": "",
    "category": "Pork Dishes"
  },
  {
    "title": "Chicken Sotanghon Soup with Malunggay and Sayote",
    "ingredients": [
      "▢ 1 lb. Chicken breast",
      "▢ 1 piece Knorr Chicken Cube",
      "▢ 1.3 oz. Sotanghon",
      "▢ 1 ½ cups malunggay leaves",
      "▢ 1 piece sayote sliced",
      "▢ 1 piece onion chopped",
      "▢ 8 cloves garlic crushed",
      "▢ 3 tablespoons cooking oil",
      "▢ 8 cups water",
      "▢ Patis and ground black pepper to taste"
    ],
    "instructions": [
      "Boil water in a cooking pot. Add chicken. Cover and continue boiling for 18 minutes. Remove chicken from the pot and let it cool down. Save the chicken stock for later.",
      "Separate the bone from the meat and then shred. Set shredded chicken aside.",
      "Heat oil in a cooking pot. Add crushed garlic right away. Continue cooking the garlic until it turns light brown.",
      "Add onion. Sauté until it softens.",
      "Add sayote. Cook for 1 minute.",
      "Put shredded chicken into the pot and pour-in chicken stock. Cover the pot and let the liquid boil.",
      "Add Knorr Chicken Cube. Stir and add the sotanghon noodles. Cook until noodles are soft.",
      "Add malunggay leaves. Cook for 1 minute.",
      "Season with patis and ground black pepper. Transfer to a serving bowl. Share and enjoy!"
    ],
    "cooking_time": "N/A",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/chicken-sotanghon-soup-with-malunggay-and-sayote/",
    "image_url": "",
    "image_path": "",
    "category": "Noodles"
  },
  {
    "title": "Corned Beef Lomi Batangas Style",
    "ingredients": [
      "▢ 12 ounces canned corned beef",
      "▢ 1 piece Knorr Beef Cube",
      "▢ 12 ounces fresh noodles",
      "▢ 1 piece carrot minced",
      "▢ 2 pieces eggs raw",
      "▢ ½ cup all-purpose flour",
      "▢ 5 tablespoons cornstarch",
      "▢ 1 piece onion chopped",
      "▢ 4 cloves garlic crushed",
      "▢ ½ cup green onion chopped",
      "▢ 2 tablespoons soy sauce",
      "▢ 2 pieces eggs boiled",
      "▢ 1 cup chicharon",
      "▢ 6 cups water",
      "▢ ½ cup cooking oil",
      "▢ Salt and ground black pepper to taste"
    ],
    "instructions": [
      "Make the meatballs by combining ¾ the amount of the corned beef, carrot, salt, ground black pepper, and 1-piece cracked egg in a bowl. Mix well. Gradually add all-purpose flour and continue mixing until all ingredients are well blended.",
      "Heat oil in pan. Scoop 1 ½ tablespoon of mixture and mold into a ball-shaped figure. Fry in low heat for 1 ½ minutes per side. Remove from the pan and transfer to a clean plate. Set aside.",
      "Transfer the remaining oil on a pot. Heat and then sauté garlic until it starts to brown. Add onion and continue cooking until the later softens.",
      "Add remaining corned beef from the can. Sauté for 1 minute.",
      "Pour water into pot. Let boil.",
      "Add Knorr Beef Cube. Stir. Pour-in soy sauce and add fresh noodles. Cover and cook for 5 minutes.",
      "Combine cornstarch and ½ cup water. Mix well. Pour the mixture into the pot. Stir until the soup thickens.",
      "Crack a piece of egg into the pot. Quickly stir and continue cooking for 1 minute.",
      "Add fried meatballs and season with salt and ground black pepper. Cook for 3 minutes.",
      "Transfer to a serving bowl. Top with meatballs, boiled egg, chicharron, and chopped green onions.",
      "Serve warm. Share and enjoy!"
    ],
    "cooking_time": "N/A",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/corned-beef-lomi-batangas-style/",
    "image_url": "",
    "image_path": "",
    "category": "Soups and Stews"
  },
  {
    "title": "Ginataang Sapsap",
    "ingredients": [
      "▢ 6 pieces butterfish cleaned and salted",
      "▢ 29 grams Knorr Ginataang Gulay Mix",
      "▢ 2 cups spinach",
      "▢ 6 pieces Thai chili pepper",
      "▢ 1 piece long green pepper",
      "▢ 3 thumbs ginger julienne",
      "▢ 1 piece onion chopped",
      "▢ 2 cloves garlic crushed",
      "▢ 2 tablespoons white vinegar",
      "▢ 1 ¼ cup water",
      "▢ 3 tablespoons cooking oil"
    ],
    "instructions": [
      "Combine Knorr Ginataang Gulay mix with water. Mix well. Set aside.",
      "Heat oil in pan. Saute onion, garlic, and ginger. Continue sautéing until onion softens.",
      "Pour ginataan mixture into pan. Add chili pepper. Let boil. Cook for 1 minute.",
      "Add butterfish. Cover the pan. Cook for 5 minutes.",
      "Pour vinegar and add long green chili pepper. Cover and cook for 2 minutes.",
      "Add spinach. Stir. Cook for 1 minute.",
      "Transfer to a serving plate. Serve with warm rice. Share and enjoy!"
    ],
    "cooking_time": "N/A",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/ginataang-sapsap/",
    "image_url": "",
    "image_path": "",
    "category": "Vegetable Dishes"
  },
  {
    "title": "Chicken Potato Salad Recipe",
    "ingredients": [
      "▢ 8 ounces chicken breast boneless",
      "▢ 1 ¼ cups Lady's Choice Mayonnaise",
      "▢ 4 pieces potato",
      "▢ 1 piece carrot",
      "▢ 1 cup green peas frozen",
      "▢ 2 ½ tablespoons sweet relish",
      "▢ ½ teaspoon onion powder",
      "▢ ½ cup sharp cheddar cheese shredded",
      "▢ ½ teaspoon sugar",
      "▢ ¼ teaspoon ground black pepper",
      "▢ Salt to taste",
      "▢ Water for boiling"
    ],
    "instructions": [
      "Boil water in a pot. Add potato. Boil for 5 minutes.",
      "Add carrot. Boil for 10 minutes. Remove potato and carrot from the pot. Place in a clean bowl and let it cool down.",
      "Add frozen green peas into the pot with boiling water. Boil for 1 minute. Remove and set aside.",
      "Add chicken into the pot. Boil for 15 minutes. Set aside.",
      "Slice potato, carrot, and chicken into cubes. Set aside.",
      "Make the salad dressing by combining Lady’s Choice Mayonnaise, pickle relish, onion powder, ground black pepper, sugar, and salt in a bowl. Mix well.",
      "Combine potato, carrot, peas, and chicken with the salad dressing and then add shredded cheddar cheese. Toss until well blended.",
      "Refrigerate for at least one hour. Serve. Share and enjoy!"
    ],
    "cooking_time": "N/A",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/chicken-potato-salad-recipe/",
    "image_url": "",
    "image_path": "",
    "category": "Chicken Dishes"
  },
  {
    "title": "Tortang Noodles at Sardinas",
    "ingredients": [
      "▢ 3 ounces instant noodles",
      "▢ 5 ounces sardines in tomato sauce",
      "▢ 2 pieces eggs",
      "▢ 2 tablespoons all-purpose flour",
      "▢ ½ piece onion minced",
      "▢ ¼ cup green onion chopped",
      "▢ 4 tablespoons cooking oil",
      "▢ 3 cups water",
      "▢ Salt and pepper to taste"
    ],
    "instructions": [
      "Cook the instant noodles by boiling water in a cooking pot. Add noodles and then cook until soft. Discard the water after cooking.",
      "While cooking the noodles, prepare the sardines. Separate the fish from the sauce. Put the fish in a bowl. Mash. Crack 2 eggs and place it in the same bowl. Mix with the mashed sardines. Season with ground black pepper and salt. Set aside",
      "Add the cooked noodles in the bowl with the sardine mixture. Mix",
      "Add flour and green onion. Continue mixing until all ingredients are well blended.",
      "Heat oil in a pan. Scoop around ½ cup of mixture and cook one side for 1 ½ minutes. Top with green onion and then flip to cook the other side using the same duration. Remove from the pan and arrange on a clean plate. Note: do this step until the mixture is totally consumed.",
      "Prepare the sauce by heating oil in a pot. Sauté onion until soft. Pour the sauce into the pot and then cook for 30 seconds. Add remaining green onions. Stir.",
      "Top the sauce over the sardines and noodle omelet. Serve. Share and enjoy!"
    ],
    "cooking_time": "N/A",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/tortang-noodles-at-sardinas/",
    "image_url": "",
    "image_path": "",
    "category": "Seafood"
  },
  {
    "title": "Saucy Beef with Broccoli",
    "ingredients": [
      "▢ 1 ½ lbs. beef sirloin",
      "▢ 3 tablespoons soy sauce",
      "▢ 3 tablespoons cooking wine",
      "▢ 4 tablespoons oyster sauce",
      "▢ 2 tablespoons cornstarch",
      "▢ 2 cups broccoli florets",
      "▢ 2 thumbs ginger",
      "▢ 1 piece onion",
      "▢ 1 ½ cup beef broth",
      "▢ 3 tablespoons cooking oil",
      "▢ Salt and pepper to taste"
    ],
    "instructions": [
      "Combine beef, soy sauce, cooking wine, and cornstarch in a bowl. Mix well.  Marinate for 15 minutes.",
      "Heat oil in a pan. Sauté ginger and onion until the later softens.",
      "Add marinated beef into the pan. Stir-fry until the beef browns.",
      "Add oyster sauce. Stir-fry for 1 minute.",
      "Pour-in beef broth. Stir. Cover the pan and then continue cooking in low heat for 10 to 12 minutes.",
      "Add broccoli. Stir and cover the pan. Cook for 3 minutes.",
      "Season with salt and ground black pepper.",
      "Transfer to a serving plate. Serve! Share and enjoy."
    ],
    "cooking_time": "N/A",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/saucy-beef-with-broccoli/",
    "image_url": "",
    "image_path": "",
    "category": "Other Filipino Dishes"
  },
  {
    "title": "Sardines Fish Ball with Sweet and Sour Sauce",
    "ingredients": [
      "▢ 2 cans sardines in tomato sauce",
      "▢ 1 cup pechay chopped",
      "▢ 2 teaspoons Knorr Liquid Seasoning",
      "▢ 2 tablespoons green onion chopped",
      "▢ ¾ cup breadcrumbs",
      "▢ 2 ½ teaspoons sugar",
      "▢ 5 teaspoons white vinegar",
      "▢ 2 pieces eggs",
      "▢ 1 ½ teaspoons cornstarch",
      "▢ 2 cups cooking oil",
      "▢ 3 tablespoons water"
    ],
    "instructions": [
      "Open the can of the sardines. Separate the fish from the sauce using a kitchen sieve.",
      "Prepare the sweet and sour sauce by heating the sauce in a saucepan. Add vinegar. Let the mixture boil. Stir and then add sugar. Thicken the sauce by mixing cornstarch and 3 tablespoons water. Pour the mixture into the pot. Stir and cook until the sauce thickens. Set aside.",
      "Start making the sardine balls by placing the fish (sardines) in a bowl. Mash it and then add the chopped pechay and crack a piece of egg into the bowl. Mix well.",
      "Add Knorr liquid seasoning and around 3 tablespoons of breadcrumbs. Continue mixing until all ingredients are well blended. Note: add more breadcrumbs if needed.",
      "Crack the remaining egg and place it in a clean bowl. Beat until smooth. Scoop around 2 tablespoons of sardine mixture and mold it into a sphere. Dip in beaten egg and then roll it over the remaining breadcrumbs.",
      "Heat oil in a small cooking pot. Deep-fry the sardine balls using low to medium heat until it turns golden brown.",
      "Remove from the pot and arrange in a serving plate. Serve with sweet and sour sauce. Share and enjoy!"
    ],
    "cooking_time": "N/A",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/sardines-fish-ball-with-sweet-and-sour-sauce/",
    "image_url": "",
    "image_path": "",
    "category": "Seafood"
  },
  {
    "title": "Spareribs Kaldereta",
    "ingredients": [
      "▢ 2 lbs. pork spare ribs",
      "▢ 1 piece Knorr Pork Cube",
      "▢ 1 piece potato diced",
      "▢ 1 piece carrot sliced",
      "▢ 2 pieces bell pepper sliced",
      "▢ ¾ cup green peas frozen",
      "▢ 5 tablespoons liver spread",
      "▢ 8 ounces tomato sauce",
      "▢ 1 piece onion chopped",
      "▢ 4 cloves garlic crushed",
      "▢ 2 pieces Thai chili pepper chopped",
      "▢ 2 cups water",
      "▢ 3 tablespoons cooking oil",
      "▢ Salt and ground black pepper to taste"
    ],
    "instructions": [
      "Heat oil in a pan.",
      "Saute onion and garlic.",
      "Once the onion softens, add spareribs. Saute until the ribs turns light brown in color.",
      "Pour tomato sauce and water. Stir and let boil.",
      "Add Knorr Pork Cube. Cover the pan and then cook for 1 hour or until the meat gets tender.",
      "Add liver spread and chili pepper. Stir.",
      "Add carrot and potato and more water, as needed. Cover and cook for 5 minutes.",
      "Stir-in bell peppers and green peas. Cook for 3 minutes.",
      "Season with ground black pepper and salt.",
      "Transfer to a serving bowl and serve along with warm rice.",
      "Share and enjoy."
    ],
    "cooking_time": "N/A",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/spareribs-kaldereta/",
    "image_url": "",
    "image_path": "",
    "category": "Main Dishes"
  },
  {
    "title": "Chicken and Liver Adobo",
    "ingredients": [
      "▢ 1 ½ lbs. chicken cut into serving pieces",
      "▢ 3 ounces chicken liver",
      "▢ 1 piece Knorr Chicken Cube",
      "▢ 2 cups water",
      "▢ 8 cloves garlic crushed",
      "▢ 1 teaspoon whole peppercorn",
      "▢ 5 pieces dried bay leaves",
      "▢ 3 tablespoons oyster sauce",
      "▢ 5 tablespoons cane vinegar",
      "▢ 3 tablespoons cooking oil"
    ],
    "instructions": [
      "Heat oil in a pan. Pan-fry chicken liver until thoroughly cooked. Remove from pan. Set aside.",
      "Using the remaining oil, saute garlic for 15 seconds. Add chicken pieces. Fry each side for 15 seconds.",
      "Pour vinegar. Let boil. Deglaze the chicken liver particles by gently scraping the bottom of the pan. Cover and cook in medium heat for 3 minutes.",
      "Add oyster sauce, whole peppercorn, dried bay leaves, and water. Let boil.",
      "Add Knorr Chicken Cube. Cover the pan. Cook for 15 minutes.",
      "Mash the fried chicken liver. Add it back to the pan. Stir and cook for 15 to 20 minutes.",
      "Transfer to a serving plate. Serve with warm rice."
    ],
    "cooking_time": "N/A",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/chicken-and-liver-adobo/",
    "image_url": "",
    "image_path": "",
    "category": "Chicken Dishes"
  }
]