[
  {
    "title": "Ginataang Puso ng Saging",
    "ingredients": [
      "▢ 1 1/2 cups banana blossom sliced and cleaned",
      "▢ 40 grams Knorr Ginataang Gulay Mix",
      "▢ 1/2 cup ground pork",
      "▢ 8 pieces shrimp shell and head removed",
      "▢ 5 pieces Thai chili pepper",
      "▢ 1 piece onion chopped",
      "▢ 4 cloves garlic minced",
      "▢ Ground black pepper to taste",
      "▢ 1 1/2 cups water",
      "▢ 3 tablespoons cooking oil"
    ],
    "instructions": [
      "Slice banana blossom into thin pieces. Soak in 1/2 cup vinegar for 15 minutes. Rinse and wring tight. Set aside.",
      "Combine Knorr Ginataang Gulay Mix and water. Stir until powder dilutes completely. Set aside.",
      "Heat oil in a pot. Add garlic and cook until it starts to brown.",
      "Add onion. Saute while constantly stirring until onion softens.",
      "Add ground pork. Cook until pork turns light brown.",
      "Put the banana blossoms in the pan. Saute for 2 minutes. Pour vinegar. Cover and cook in medium heat for another 2 minutes.",
      "Pour Knorr Ginataang Gulay mixture and add chili peppers. Let boil. Cover the pot and continue cooking in low to medium heat for 7 to 10 minutes. Note: add more water as needed.",
      "Add shrimp. Cook for 2 minutes. Season with ground black pepper.",
      "Transfer to a serving bowl and serve. Share and enjoy!"
    ],
    "cooking_time": "N/A",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/ginataang-puso-ng-saging/",
    "image_url": "",
    "image_path": "",
    "category": "Vegetable Dishes"
  },
  {
    "title": "Coke Pork Adobo",
    "ingredients": [
      "▢ 2 1/2 lbs pork belly cubed",
      "▢ 10 tablespoons white vinegar",
      "▢ 3 tablespoons soy sauce",
      "▢ 5 cloves garlic crushed",
      "▢ 12 ounces cola drink",
      "▢ 2 teaspoons whole peppercorn",
      "▢ 4 pieces dried bay leaves",
      "▢ Salt optional",
      "▢ Water  as needed"
    ],
    "instructions": [
      "Heat pan. Sear pork belly until it browns and enough oil is extracted. Note: stir the pork continuosly while searing.",
      "Push the pork on one side of the pan. Add garlic on the open area.  Saute garlic for 30 seconds. Mix pork and garlic together. Cook for 1 minute.",
      "Pour-in soy sauce and vinegar. Let boil. Stir. Cook for 2 minutes.",
      "Add whole peppercorn and dry bay leaves.",
      "Add cola drink. Let it boil. Cover the pan. Continue cooking in low heat until pork gets tender. Note: add water if needed.",
      "Season with salt (optional).",
      "Transfer to a serving bowl. Serve. Share and enjoy!"
    ],
    "cooking_time": "N/A",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/coke-pork-adobo/",
    "image_url": "",
    "image_path": "",
    "category": "Chicken Dishes"
  },
  {
    "title": "Salmon Sisig",
    "ingredients": [
      "▢ 12 ounces salmon fillet",
      "▢ 1/4 cup Lady's Choice Mayonnaise",
      "▢ 1 1/2 teaspoons Knorr Liquid Seasoning",
      "▢ 1 piece onion chopped",
      "▢ 3/4 cup green onion chopped",
      "▢ 6 pieces Thai chili pepper chopped",
      "▢ 3/4 cup chicharon crushed",
      "▢ 3 tablespoons butter",
      "▢ 1/4 teaspoon garlic powder",
      "▢ 1 1/2 tablespoons cooking oil"
    ],
    "instructions": [
      "Place salmon in a turbo broiler. Spray cooking oil all over the fish. Broil for 12 minutes at 390F.",
      "Let it cool down. Remove from the broiler and flake the fish. Set aside.",
      "Melt 1/3 of the butter in a pan. Add cooking oil. Continue cooking until the mixture gets hot. Add salmon flakes and cook for 30 seconds while constantly stirring.",
      "Add half of the amount of each of these ingredients: onion, chili pepper, green onion. Cook while stirring for 2 minutes.",
      "Add garlic powder and Knorr Liquid Seasoning. Cook for 1 minute.",
      "Add Lady's Choice Mayonnaise. Stir and cook for 30 seconds.",
      "Put chicharon into the pan. Stir. Transfer to a large bowl. Let it cool down.",
      "Add remaining onion and green onion. Toss. Season with ground black pepper.",
      "Heat a metal plate on a stovetop. Add remaining butter and let it melt. Arrage the prepared salmon sisig on the metal plate. Top with chicharon and add remaining chili pepper. Serve. Share and enjoy!"
    ],
    "cooking_time": "N/A",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/salmon-sisig/",
    "image_url": "",
    "image_path": "",
    "category": "Pork Dishes"
  },
  {
    "title": "Bulalo Kare-kare",
    "ingredients": [
      "▢ 3 lbs beef shank bulalo",
      "▢ 1 piece Knorr Beef Cube",
      "▢ 1 cup roasted peanuts",
      "▢ 15 pieces sitaw cut in 2-inch pieces",
      "▢ 1 piece eggplant sliced",
      "▢ 1 bunch  bok choy",
      "▢ 1/2 cup annatto seeds",
      "▢ 8 cloves garlic crushed and chopped",
      "▢ 1 1/2 pints water",
      "▢ 2 teaspoons cornstarch diluted in 1/4 cup water",
      "▢ ground black pepper to taste",
      "▢ 1/2 cup bagoong alamang",
      "▢ 3 tablespoons cooking oil"
    ],
    "instructions": [
      "Heat oil in a pan. Saute onion and garlic until onion softens.",
      "Add beef shank. Cook each side for 30 seconds.",
      "Pour water into the pot. Let boil. Continue boiling for 10 minutes. Skim the scums on the surface. Continue boiling in low heat until meat gets tender.",
      "Prepare the annatto water by boiling 1 cup water in a saucepan. Add annatto seeds. Boil for 1 minute. Set aside.",
      "Prepare the peanut paste by placing the roasted peanuts in a food processor. Puree until the texture becomes smooth and paste-like.",
      "Once the beef shank tenderizes, add peanut paste and annatto water (filter the seeds using a kitchen strainer). Cover and cook for 5 minutes.",
      "Add Knorr Beef Cube. Stir. Cover and cook for 3 minutes.",
      "Pour cornstarch mixture. Stir until sauce thickens. Season with ground black pepper.",
      "Add eggplant and sitaw. Cover and cook for 5 minutes.",
      "Add bok choy. Cover and cook for 3 minutes. Transfer to a serving plate. Serve with bagoong alamang. Share and Enjoy!"
    ],
    "cooking_time": "N/A",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/bulalo-kare-kare/",
    "image_url": "",
    "image_path": "",
    "category": "Soups And Stews"
  },
  {
    "title": "Chicken Hinalang (Halang-halang na Manok)",
    "ingredients": [
      "▢ 1 lb. chicken cut into serving pieces",
      "▢ 1 piece Knorr Chicken Cube",
      "▢ 1 piece red bell pepper Julienne",
      "▢ 1 piece chayote sliced",
      "▢ 10 pieces Thai chili pepper chopped",
      "▢ 1 bunch  lemongrass",
      "▢ 1 bunch  green onion cut in 3-inch pieces",
      "▢ 1 cup hot pepper leaves",
      "▢ 1 piece red onion sliced",
      "▢ 4 thumbs  ginger crushed",
      "▢ 8 cloves garlic crushed",
      "▢ 2 quarts water",
      "▢ 4 tablespoons soy sauce",
      "▢ 2 tablespoons white vinegar",
      "▢ 3 tablespoons cooking oil",
      "▢ Salt and ground black pepper to taste"
    ],
    "instructions": [
      "Combine chicken, soy sauce, and vinegar. Mix well. Let it stay for 10 minutes.",
      "Sauté garlic, onion, and ginger.",
      "Add marinated chicken once onion softens. Continue sautéing until chicken for 5 minutes.",
      "Pour 1 ½ quarts water into the cooking pot. Let boil.",
      "Add Knorr Chicken Cube and lemongrass. Cover and cook in low heat for 30 minutes.",
      "Remove lemongrass. Add chili pepper and sayote. Cook for 7 minutes.",
      "Put-in bell pepper, hot pepper leaves, and green onions.  Continue cooking for 5 minutes.",
      "Season with salt and ground black pepper.",
      "Serve hot with rice. Share and enjoy!"
    ],
    "cooking_time": "N/A",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/chicken-hinalang-halang-halang-na-manok/",
    "image_url": "",
    "image_path": "",
    "category": "Chicken Dishes"
  },
  {
    "title": "How to Cook Tuna Pasta Alfredo",
    "ingredients": [
      "▢ 1 lb. linguine cooked",
      "▢ 1 1/4 cups all-purpose cream",
      "▢ 1 1/4 cups fresh milk",
      "▢ 6 oz. tuna in can",
      "▢ 1/4 cup butter",
      "▢ 3 cloves garlic",
      "▢ 2 tablespoons parsley chopped",
      "▢ 1/4 cup Parmesan cheese",
      "▢ Salt and ground black pepper"
    ],
    "instructions": [
      "Melt butter in a pan. Add garlic. Cook while stirring until garlic starts to brown.",
      "Add all-purpose cream. Cook for 30 seconds.",
      "Pour-in fresh milk. Stir. Let boil.",
      "Add tuna. Cook for 1 minute.",
      "Put the Parmesan cheese into the pan. Cook for 30 to 40 seconds.",
      "Season with salt and ground black pepper. Stir until all ingredients are well blended.",
      "Add the cooked linguine. Toss until pasta is coated with sauce. Add chopped parsley if desired.",
      "Transfer to a pasta bowl. Serve. Share and enjoy!"
    ],
    "cooking_time": "N/A",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/how-to-cook-tuna-pasta-alfredo/",
    "image_url": "",
    "image_path": "",
    "category": "Other Filipino Dishes"
  },
  {
    "title": "Seafood Curry",
    "ingredients": [
      "▢ 15 pieces mussels cleaned",
      "▢ 1 piece Knorr Shrimp Cube",
      "▢ 10 pieces shrimp deveined",
      "▢ 4 pieces shrimp sliced",
      "▢ 2 cups coconut milk",
      "▢ 1 piece red bell pepper Julienne",
      "▢ 1 piece green bell pepper Julienne",
      "▢ 1 1/2 tablespoons curry powder",
      "▢ 1/8 teaspoon cayenne pepper powder",
      "▢ 2 thumbs  ginger Julienne",
      "▢ 1 piece onion chopped",
      "▢ 5 cloves garlic crushed and chopped",
      "▢ 3 tablespoons cooking oil",
      "▢ fish sauce to taste",
      "▢ ground black pepper to taste"
    ],
    "instructions": [
      "Heat oil in a cooking pot. Add onion. Cook for 20 seconds. Put the garlic and ginger. Continue cooking until onion softens.",
      "Pour coconut milk into the pot. Stir. Cover the pot and let boil.",
      "Add curry powder. Stir until it completely dilutes in coconut milk.",
      "Add Knorr Shrimp Cube. Stir. Put some cayenne pepper powder, if desired.",
      "Add bell peppers, mussels, and shrimp. Cook for 2 minutes. Stir until all ingredients are coated with coconut milk. Cook for 3 minutes.",
      "Add squid. Cook for 1 minute.",
      "Season with fish sauce (patis) and ground black pepper. Cook for 1 minute more.",
      "Transfer to a serving plate. Serve with rice. Enjoy!"
    ],
    "cooking_time": "N/A",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/seafood-curry/",
    "image_url": "",
    "image_path": "",
    "category": "Seafood"
  },
  {
    "title": "Monte Cristo Sandwich",
    "ingredients": [
      "▢ 4 slices white bread",
      "▢ ¼ cup Lady’s Choice Ham Spread",
      "▢ 4 slices ham",
      "▢ 4 slices turkey",
      "▢ 8 slices Swiss cheese",
      "▢ 3 tablespoons yellow mustard",
      "▢ 2 pieces eggs",
      "▢ 4 tablespoons butter"
    ],
    "instructions": [
      "Crack eggs on a wide bowl. Beat until smooth. Set aside.",
      "Spread mustard on one side of each sliced bread. Spread Lady's Choice Ham Spread over the mustard. Top one slice of bread with 2 slices of Swiss cheese and then alternately arrange 2 slices of ham and turkey over the cheese. Put 2 slices of cheese over the protein and then finish by topping with the second slice of bread.",
      "Dip one side of the sandwich in beaten egg for 40 to 50 seconds. Do the same for the other side.",
      "Melt butter in a pan. Put the sandwich in and continue cooking using between low to medium heat until golden brown. Flip the sandwich and continue to do the same procedure on the opposite side.",
      "Slice the Monte Cristo sandwich in half. Arrange in a serving plate. Serve. Share and enjoy!"
    ],
    "cooking_time": "N/A",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/monte-cristo-sandwich/",
    "image_url": "",
    "image_path": "",
    "category": "Other Filipino Dishes"
  },
  {
    "title": "Aligue Fried Rice",
    "ingredients": [
      "▢ 5 cups leftover rice",
      "▢ 8 pieces shrimp",
      "▢ 10 pieces mussels",
      "▢ 4 pieces squid sliced",
      "▢ ¼ cup taba ng talangka",
      "▢ ¼ piece lemon",
      "▢ 1 piece onion minced",
      "▢ 5 cloves garlic crushed",
      "▢ 3 tablespoons butter",
      "▢ ¼ cup cooking oil",
      "▢ Salt and ground black pepper to taste"
    ],
    "instructions": [
      "Cook the seafood by heating 2 tablespoons of oil in a pan. Put the shrimp and mussels. Make sure to remove the mussels from the shell. Continue cooking for 1 minute. Add half of the butter and let it melt. Put the squid into the pan and cook for 30 seconds. Season with salt and pepper. Set aside.",
      "On the same pan, heat remaining oil. Sauté garlic until it starts to brown. Add onion. Sauté until onion becomes tender.",
      "Put the remaining butter in the pan and let it melt. Add rice. Stir-fry for 2 minutes.",
      "Add crab fat (taba ng talangka). Stir and fold until all ingredients are well blended.",
      "Squeeze lemon or calamansi and pour the sauce from the sautéed seafood. Adjust heat to high and continue stir-frying for 1 to 2 minutes. Season with ground black pepper and salt.",
      "Arrange the aligue rice on a serving plate. Top with cooked seafood. Serve. Share and enjoy!"
    ],
    "cooking_time": "N/A",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/aligue-fried-rice/",
    "image_url": "",
    "image_path": "",
    "category": "Other Filipino Dishes"
  },
  {
    "title": "Sprite Pork Adobo Recipe",
    "ingredients": [
      "▢ 2 lbs. pork belly cubed",
      "▢ 7 tablespoons soy sauce",
      "▢ 4 tablespoons white vinegar",
      "▢ 1 can Sprite or similar soda pop",
      "▢ 1 piece onion minced",
      "▢ 5 pieces dried bay leaves",
      "▢ 1 ½ teaspoons whole peppercorn",
      "▢ 5 cloves garlic crushed",
      "▢ ½ cup water",
      "▢ 3 tablespoons cooking oil"
    ],
    "instructions": [
      "In a large bowl, combine soy sauce and Sprite with the pork belly. Mix well. Cover the bowl and refrigerate. Let the pork marinate for at least 6 hours.",
      "Using a kitchen sieve, drain the marinade out of the bowl. Set it aside.",
      "Heat oil in a cooking pot",
      "Once the oil becomes hot, saute garlic until light brown",
      "Add onion. Continue to saute until soft",
      "Add pork belly. Stir and cook until light brown",
      "Pour the marinade (Sprite and soy sauce). Cover the pot and let boil.",
      "Add whole peppercorn and dried bay leaves. Cover the pot and continue to cook for 30 minutes in medium heat.",
      "Pour vinegar into the pot. Let the liquid re-boil. Stir. Cover and cook for 25 to 30 minutes. Note: add water if needed.",
      "Transfer to a serving plate. Serve with rice.",
      "Share and enjoy!"
    ],
    "cooking_time": "1 hour",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/sprite-pork-adobo-recipe/",
    "image_url": "",
    "image_path": "",
    "category": "Chicken Dishes"
  },
  {
    "title": "Peach Mango Nuggets",
    "ingredients": [
      "▢ 3 pieces mango ripe",
      "▢ 7 ounces peaches canned",
      "▢ 3 tablespoons brown sugar",
      "▢ 1 teaspoon cornstarch",
      "▢ ¼ teaspoon cinnamon powder",
      "▢ 5 slices loaf bread",
      "▢ 2 pieces eggs",
      "▢ ½ cup Panko breadcrumbs",
      "▢ 1 ½ cups cooking oil"
    ],
    "instructions": [
      "Prepare the filling. Combine mango, peaches, sugar, cinnamon powder, and cornstarch in a bowl. Mix well. Set aside.",
      "Flatten a slice of bread using a rolling pin. Slice the flattened bread in half.",
      "Make a symmetrical fold and seal the edges by rubbing water and then pressing against each other. Leave one side open.",
      "Fill the pocket with enough peach-mango filling. Seal. You now have your peach mango nuggets.",
      "Heat oil in a pot.",
      "Beat eggs in a bow. Dip nuggets in egg and then roll over bred crumbs until completely coated. You can press the crumbs lightly towards the nuggets to ensure that it adheres well.",
      "Fry one side in medium heat until it turns golden brown. Do the same to the opposite side.",
      "Remove from the pot and place on a plate lined with paper towel.",
      "Serve for dessert. Share and enjoy!"
    ],
    "cooking_time": "N/A",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/peach-mango-nuggets/",
    "image_url": "",
    "image_path": "",
    "category": "Other Filipino Dishes"
  },
  {
    "title": "Crispy Liempo Sinigang Rice",
    "ingredients": [
      "▢ 1 ½ lbs. pork belly sliced",
      "▢ ½ cup cornstarch",
      "▢ 3 tablespoons fish sauce",
      "▢ ¾ cup cooking oil",
      "▢ 22 g Knorr Sinigang sa Sampaloc original mix",
      "▢ 1 ½ cups rice",
      "▢ 8 pieces long green beans chopped",
      "▢ 1 piece onion diced",
      "▢ 1 piece long green pepper sliced",
      "▢ 3 cups water",
      "▢ Ground black pepper",
      "▢ ½ teaspoon paprika",
      "▢ 3 tablespoons cooking oil",
      "▢ 1 piece tomato sliced",
      "▢ 6 pieces okra",
      "▢ 1 piece eggplant sliced",
      "▢ 1 ½ cups spinach",
      "▢ 1 cup cake flour",
      "▢ 1 piece egg yolk",
      "▢ 1 cup cold water",
      "▢ ¼ cup ice cubes",
      "▢ 2 cups cooking oil"
    ],
    "instructions": [
      "Prepare the sinigang broth by boiling water in a cooking pot. Add pork belly. Cover the pot and continue boiling using low to medium heat for 30 minutes. Note: add more water as needed.",
      "Add Knorr Sinigang sa sampaloc (original mix). Stir. Cover the pot and continue boiling in medium heat for 15 minutes. Remove the pork from the pot and let it cool down.",
      "Start to cook the sinigang rice by washing the rice. Drain water. Pour sinigang broth into the rice cooker while filtering using a kitchen sieve. Cook until done. Note: you can use a rice cooker, or do the traditional way of cooking rice.",
      "While the rice is cooking, prep the pork by placing it in a resealable bag. Add fish sauce. Marinate for 15 minutes. Heat oil in a pan and then dredge the pork in cornstarch. Fry each side until it turns golden brown and crispy. Place in a plate lined with paper towel. Set aside.",
      "Time to stir-fry the rice. Heat oil in a pan. Add onion and cook for 30 seconds. Put the chopped long green beans and continue cooking for 1 ½ minutes. Add sliced long green pepper and cooked rice. Stir-fry for 1 to 2 minutes. Finish by seasoning with ground black pepper and paprika. Set aside.",
      "Make the vegetable tempura by heating oil to 360F. Combine the batter ingredients starting from the egg yolk and water. Mix well. Add ice cubes and then put-in the cake flour. Mix by holding 4 pieces of chopsticks and mix using a stabbing motion for 30 to 35 seconds. Note: the mixture should be lumpy, not smooth.",
      "Dredge the vegetables in cake flour and then dip in the batter. Fry each side for 2 to 3 minutes. Note: the spinach should only be fried for not more than 1 minute.",
      "Arrange the sinigang rice on a serving plate. Top with crispy liempo and serve with vegetable tempura.Share and enjoy!"
    ],
    "cooking_time": "N/A",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/crispy-liempo-sinigang-rice/",
    "image_url": "",
    "image_path": "",
    "category": "Pork Dishes"
  }
]