[
  {
    "title": "Chicken Cordon Bleu",
    "ingredients": [
      "▢ 4 pieces boneless chicken breast about 6 ounces each",
      "▢ 1/2 cup breadcrumbs",
      "▢ 12 slices thin sliced ham",
      "▢ 4 slices of Swiss cheese",
      "▢ 1 piece raw egg",
      "▢ 4 teaspoon butter softened",
      "▢ 1/4 teaspoon salt",
      "▢ 2 tsp paprika optional"
    ],
    "instructions": [
      "Preheat oven to 350 degrees Fahrenheit",
      "Combine softened butter and salt then mix well",
      "Place a piece of chicken breast in a flat surface then brush the top with the butter-salt mixture and sprinkle some paprika.",
      "Top the chicken breast with ham slices followed by the Swiss Cheese",
      "Start rolling the chicken breast from one end to the other. Make sure that it is tightly rolled. You may use a toothpick to fasten the end of the chicken breast to keep it from rolling back.",
      "After rolling all the chicken breast, combine the remaining butter-salt mixture with egg and whisk until every ingredient is evenly distributed.",
      "Brush the outer part of the chicken breasts with the egg-butter-salt mixture then dredge in bread crumbs.",
      "Place the chicken breasts in a greased baking dish then bake for 25 minutes. If the chicken is not fully cooked by this time, you can loosely cover it with aluminum foil and continue baking at lower temperature until the chicken is cooked.",
      "Remove from the oven and slice into individual servings.",
      "Serve hot. Share and enjoy!"
    ],
    "cooking_time": "35 minutes",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/chicken-cordon-bleu-recipe/",
    "image_url": "",
    "image_path": "",
    "category": "Chicken Dishes"
  },
  {
    "title": "Morcon Recipe",
    "ingredients": [
      "▢ 2 lbs beef eye of round or flank steak 3/4 inch thick in one piece",
      "▢ 2 pieces beef cubes dissolved in 3 cups boiling water beef stock/broth",
      "▢ 1/4 tsp salt",
      "▢ 1 piece lemon",
      "▢ 1/2 cup soy sauce",
      "▢ 1 piece medium sized carrot cut into long strips",
      "▢ 1/2 cup flour",
      "▢ 1/2 cup cooking oil",
      "▢ 4 pieces hotdogs cut in half lengthwise",
      "▢ 2 pieces pickled dill or sweet pickled cucumber cut lengthwise divided into 4 equal pieces",
      "▢ 3 pieces hard boiled eggs sliced",
      "▢ 3 ounces cheddar cheese cut in strips (about 1/2 inch thick)"
    ],
    "instructions": [
      "Marinate the beef in soy sauce and lemon juice for at least 1 hour",
      "Place the beef in a flat surface and arrange the hotdogs, pickle, carrot, cheese, and egg on one side",
      "Roll the beef enclosing the fillings and tie with a cooking string to ensure that the meat will not open-up",
      "Place cooking oil in a pan and apply heat",
      "Dredge the rolled beef in flour and fry until the color of the outer part turns medium brown",
      "Transfer the fried rolled beef in a casserole and pour-in the beef broth then bring to a boil",
      "Pour-in half of the soy sauce-lemon juice marinade,salt and simmer until the beef is tender (about 2 hours using ordinary casserole or 30 minutes if a pressure cooker is used)",
      "Optional: Fry the simmered meat for at least 2 minutes",
      "Remove the strings and slice into serving pieces",
      "Place in a serving dish and add the sauce.",
      "Serve hot. Share and enjoy!"
    ],
    "cooking_time": "2 hours",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/beef-holiday-christmas-new-year-food-menu-morcon-recipe/",
    "image_url": "",
    "image_path": "",
    "category": "Desserts"
  },
  {
    "title": "Carrot Cake Recipe",
    "ingredients": [
      "▢ >>Cake:",
      "▢ 2 tsp ground cinnamon",
      "▢ 1 tsp baking powder",
      "▢ 1 tsp salt",
      "▢ 4 pcs raw eggs",
      "▢ 1 cup granulated sugar",
      "▢ 3/4 cup light brown sugar",
      "▢ 2 1/2 cups all-purpose flour",
      "▢ 2 tsp baking soda",
      "▢ 1 cup vegetable oil",
      "▢ 1/4 cup fresh milk",
      "▢ 1 tbsp vanilla extract",
      "▢ 3 cups grated carrots",
      "▢ 1 cup chopped walnuts",
      "▢ >>Cream Cheese Frosting:",
      "▢ 8 ounces cream cheese",
      "▢ 6 tbsp butter melted",
      "▢ 3 cups confectioners sugar",
      "▢ 1 1/2 tsp vanilla extract"
    ],
    "instructions": [
      "Make the cake by combining flour, baking soda, ground cinnamon, baking powder, and salt in a mixing bowl than whisk until everything is properly distributed. Beat the eggs using an electric mixer in a separate mixing bowl. Add the granulated and light brown sugar then continue mixing until fully blended. Add the vegetable oil, fresh milk, and vanilla extract then continue mixing until texture becomes smooth. Put-in the flour-baking soda-cinnamon-baking powder-salt mixture then continue mixing using low speed. Fold-in the carrots and walnuts. Pour the batter on a cake pan with shaped wax paper. Preheat oven to 350 degrees Fahrenheit and bake the batter for 35 to 50 minutes (you know that the cake is done when toothpick inserted comes out clean). Remove from the oven and allow to cool down.",
      "Make the frosting by whisking the cream cheese using an electric mixer. Add-in the butter and vanilla extract then continue mixing until the mixture is well blended. Add the confectioners sugar then mix until texture becomes smooth. Set aside",
      "Apply the frosting over the cake. Place the first cake on a flat surface and apply frosting on the top part spreading it evenly. Place the second cake on top of the first cake and align properly. Apply the remaining frosting on top and on the sides of the cake. Garnish with chopped walnuts on top and on the sides.",
      "Refrigerate for at least an hour then serve. Share and enjoy!"
    ],
    "cooking_time": "1 hour",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/baking-dessert-sweets-carrot-cake-recipe/",
    "image_url": "",
    "image_path": "",
    "category": "Other Filipino Dishes"
  },
  {
    "title": "Yema Ball Recipe",
    "ingredients": [
      "▢ 3 tbsp unsalted butter",
      "▢ 1 can 14 ounces condensed milk",
      "▢ 3 egg yolks",
      "▢ 3 tbsp peanuts chopped"
    ],
    "instructions": [
      "Place the butter in a heated saucepan and allow to melt",
      "Stir-in the condensed milk and allow to cook for 3 minutes",
      "Add the egg yolks then continue stirring for 2 minutes",
      "Set the heat to medium and put-in the chopped peanuts then stir until the mixture becomes thick (about 15 to 20 minutes). Adjust heat to low when texture is about to be achieved.",
      "Turn-off the heat and allow the mixture to cool down",
      "When the temperature of the mixture is tolerable, scoop a spoonful then roll with your hands to form a sphere (ball shape).",
      "Transfer to a serving dish and apply your desired presentation",
      "Serve. Share and Enjoy!"
    ],
    "cooking_time": "40 minutes",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/filipino-dessert-sweet-custard-candy-yema-balls-recipe/",
    "image_url": "",
    "image_path": "",
    "category": "Other Filipino Dishes"
  },
  {
    "title": "Ginataang Manok Recipe",
    "ingredients": [
      "▢ 2 lbs chicken cut into serving pieces",
      "▢ 2 cups coconut milk",
      "▢ 1/2 bunch spinach",
      "▢ 2 tbsp garlic minced",
      "▢ 1 large onion sliced",
      "▢ 2 tbsp ginger julienned",
      "▢ 8 ounces green papaya wedged",
      "▢ 1/2 tsp paprika optional",
      "▢ 1 piece long green chili optional",
      "▢ 4 pieces Thai chili or siling labuyo if available, chopped (optional)",
      "▢ 2 tbsp cooking oil",
      "▢ Salt and pepper to taste"
    ],
    "instructions": [
      "Heat the cooking pot and pour-in the cooking oil.",
      "Sauté the garlic, onion, and ginger.",
      "Add the chicken and cook until the color of the outer part turns light brown.",
      "Pour-in the coconut milk while stirring and bring to a boil.",
      "Sprinkle some paprika then simmer for 30 minutes or until the chicken is tender and the coconut milk becomes thick.",
      "Add the long green chili and Thai chili then simmer for 5 minutes",
      "Add the green papaya then simmer for 5 to 8 minutes.",
      "Put-in the spinach, salt, and pepper then simmer for 3 minutes.",
      "Turn-off the heat then transfer the cooked chicken to a serving plate",
      "Serve hot. Share and enjoy!"
    ],
    "cooking_time": "57 minutes",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/filipino-food-chicken-stew-ginataang-manok-recipe/",
    "image_url": "",
    "image_path": "",
    "category": "Chicken Dishes"
  },
  {
    "title": "California Roll Recipe",
    "ingredients": [
      "▢ 1 medium sized avocado peeled and sliced into 1/4-inch thick pieces",
      "▢ 4 sheets sushinori",
      "▢ 1/4 cup sesame seeds",
      "▢ 1 small cucumber peeled, seeded, and sliced in 1/8 inch thick pieces",
      "▢ 4 pieces crabsticks",
      "▢ 3 cups cooked sushi rice",
      "▢ 2 tbsp rice vinegar",
      "▢ 2 tbsp granulated sugar",
      "▢ 1 tsp salt"
    ],
    "instructions": [
      "In a small bowl, combine the rice vinegar, sugar, and salt then stir well.",
      "Place in a microwave oven for about 10 seconds then stir again so that all the ingredients will be dissolved.",
      "Pour the vinegar-sugar-salt mixture on the sushi rice then mix well. Set aside.",
      "Cut the sushinori (nori) in half crosswise.",
      "Lay one sushinori (shiny side down) on a flat surface",
      "Scoop some sushi rice and spread over the sushinori (make sure to distribute the rice evenly)",
      "Sprinkle sesame seeds on top of the sushi rice",
      "Cover the mat (or bamboo mat) with plastic (such as cling wrap)",
      "Place the mat on a flat surface then put the sushinori with rice over the mat. The part that has the rice should be facing down.",
      "Arrange the crabstick, cucumber, and avocado in the center of the sheet",
      "Grab the edge of the mat, keeping the fillings in place with your fingers, and roll it into a tight cylinder, using the mat to shape the cylinder. Set aside.",
      "Continue doing the process until all the rice are used.",
      "Trim the edge of the rolled sushi then cut the cylinder in half using a sharp knife",
      "Slice each half crosswise into three equal pieces.",
      "Place in a serving plate then serve with soysauce and wasabi. Share and enjoy!"
    ],
    "cooking_time": "20 minutes",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/how-to-make-suchi-california-roll-recipe-video/",
    "image_url": "",
    "image_path": "",
    "category": "Other Filipino Dishes"
  },
  {
    "title": "Chocolate Cupcake Recipe",
    "ingredients": [
      "▢ >>Cupcake:",
      "▢ 1 1/3 cups all purpose flour sifted",
      "▢ 2 tsp baking powder",
      "▢ 1/2 tsp salt",
      "▢ 1/2 cup cocoa powder",
      "▢ 1 cup hot water",
      "▢ 1/2 cup unsalted butter",
      "▢ 1 cup granulated sugar sifted",
      "▢ 2 pieces raw eggs",
      "▢ 2 tsp vanilla essence",
      "▢ >>Frosting:",
      "▢ 2/3 cup unsalted butter",
      "▢ 1  1/3 cups confectioners sugar sifted",
      "▢ 4 ounces unsweetened chocolate",
      "▢ 1  1/2 tsp vanilla essence"
    ],
    "instructions": [
      "Combine flour, baking powder, and salt in a mixing bowl and whisk thoroughly until the ingredients are evenly distributed. Set aside.",
      "Put the cocoa powder in the bowl where the hot water is and stir until the cocoa powder is diluted. Set aside.",
      "Combine the butter and sugar in a separate mixing bowl then cream (electric mixer is needed) until texture become fluffy",
      "Add the eggs while mixing continuously then put-in the vanilla essence.",
      "Put in half of the flour-baking powder-salt mixture then mix well.",
      "Add the other half of the flour-baking powder-salt mixture then continue mixing until all the ingredients are well distributed.",
      "Pour the cocoa mixture and continue mixing until texture becomes smooth.",
      "Preheat the oven to 375 degrees Fahrenheit",
      "Fill the cupcake pan with cupcake paper cups.",
      "Put the batter in each paper cup then bake for 18 minutes (insert toothpick in the cupcakes, if it comes out clean then the cupcakes are done).",
      "Remove the cupcake from the oven and allow to cool down over a wire rack.",
      "Melt the chocolate by placing it in a bowl over boiling water.",
      "Once melted, set aside and allow to cool down to room temperature",
      "Put the butter in a mixing bowl then cream (use electric mixer)",
      "Add the sugar and continue mixing until the texture becomes fluffy.",
      "Put-in the vanilla essence and chocolate then mix thoroughly until texture becomes smooth.",
      "Place the frosting over the cupcakes. (I use a pipe so that the frosting can easily be swirled. If you don't have any tools, you may use a spoon or spatula to spread the frosting.",
      "Serve with a smile. Share and enjoy!"
    ],
    "cooking_time": "28 minutes",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/dessertchocolate-cupcake-recipe/",
    "image_url": "",
    "image_path": "",
    "category": "Other Filipino Dishes"
  },
  {
    "title": "Breaded Pork Loin",
    "ingredients": [
      "▢ 1 1/2 lb pork loin about 3 slices",
      "▢ 1 piece raw egg",
      "▢ 3 tbsp milk",
      "▢ 1 cup bread crumbs",
      "▢ 1/2 cup cooking oil",
      "▢ salt and pepper to taste"
    ],
    "instructions": [
      "Sprinkle pork chops with salt and pepper.",
      "Whisk egg and milk together in a shallow bowl.",
      "Dip each loin in the egg mixture then dredge in bread crumbs.",
      "Heat oil in a heavy skillet.",
      "Fry in the hot oil for about 6 minutes on each side or until color turns golden brown.",
      "Serve hot with atchara. Share and enjoy!"
    ],
    "cooking_time": "22 minutes",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/fried-filipino-food-breaded-pork-loin-recipe/",
    "image_url": "",
    "image_path": "",
    "category": "Pork Dishes"
  },
  {
    "title": "Atchara",
    "ingredients": [
      "▢ 3 to 4 lbs. green papaya julienne",
      "▢ 2 pieces carrots julienne",
      "▢ 1 piece onion thinly sliced lengthwise",
      "▢ 10 cloves garlic thinly sliced",
      "▢ 2 tbsp whole peppercorn",
      "▢ 1 piece red bell pepper cut into strips",
      "▢ 1 knob  ginger cut into thin strips",
      "▢ 1/4 cup salt to dehydrate papaya",
      "▢ 1 1/2 tsp salt for the brine or syrup",
      "▢ 2 cups white vinegar",
      "▢ 1 1/3 cups granulated sugar",
      "▢ 1/2 cup raisins"
    ],
    "instructions": [
      "Place the julienned papaya in a large bowl and combine 1/4 cup salt then mix until the salt is well distributed.3 to 4 lbs. green papaya, 1/4 cup salt",
      "Cover the bowl and place inside the refrigerator overnight (the salt will dehydrate the papaya).",
      "Place the julienned papaya in a colander or strainer then rinse with running water.",
      "Using cheesecloth (or any cloth) as a container, put the rinsed papaya inside the cloth and squeeze until all the liquid comes out.",
      "Put the papaya back in the large bowl and combine with carrots, garlic, ginger, onions, whole peppercorn, bell pepper, and raisins2 pieces carrots, 1 piece onion, 2 tbsp whole peppercorn, 1 piece red bell pepper, 1 knob  ginger, 1/2 cup raisins, 10 cloves garlic",
      "Heat the saucepan and pour-in the vinegar and bring to a boil.2 cups white vinegar",
      "Add the sugar and 1 1/2 tsp salt then stir until well diluted1 1/2 tsp salt, 1 1/3 cups granulated sugar",
      "Turn off the heat and allow the syrup to cool down until temperature is low enough to handle.",
      "Place the combined vegetables and spices in a sterilized airtight jar and pour-in the syrup",
      "Seal the jar and place inside the refrigerator for a week (or 5 days minimum to achieve the expected texture and flavor).",
      "Serve cold with fried dishes. Share and Enjoy!"
    ],
    "cooking_time": "40 minutes",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/pickled-papaya-appetize-atsara-achara-atchara-recipe/",
    "image_url": "",
    "image_path": "",
    "category": "Other Filipino Dishes"
  },
  {
    "title": "Crab Meat Omelette",
    "ingredients": [
      "▢ 3/4 cup crab meat fresh or canned",
      "▢ 1 small onion thinly sliced lengthwise",
      "▢ 3 pieces raw eggs",
      "▢ 4 tbsp. butter",
      "▢ 2 tbsp. green onions minced (optional)",
      "▢ Salt and pepper to taste"
    ],
    "instructions": [
      "Heat the frying pan and put-in 2 tbsp of butter then allow to melt.",
      "Add the onion, crab meat, and green onions then cook until half done",
      "Add salt and pepper to taste then set aside.",
      "Heat the same frying pan (apply low heat) and put-in the remaining butter then allow to melt.",
      "Crack the eggs and place in a bowl then add some salt",
      "Whisk the eggs and pour on the frying pan",
      "Tilt the frying pan to allow the uncooked portions of the eggs (liquid form) to occupy the whole surface of the pan. You can also pull from the middle part of the pan to allow uncooked portions of the egg to occupy the space.",
      "Put the cooked crab meat and onions on top of the half side of the omelette.",
      "Cover the crab meat and onions by folding the other side of the omelette.",
      "Place in a serving plate.",
      "Serve hot with bread or rice. Share and Enjoy!"
    ],
    "cooking_time": "10 minutes",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/breakfast-dish-how-to-make-crabmeat-omelette-omelet/",
    "image_url": "",
    "image_path": "",
    "category": "Other Filipino Dishes"
  },
  {
    "title": "Beef Mami Recipe",
    "ingredients": [
      "▢ 1 lb. beef brisket",
      "▢ 6 pieces star anise",
      "▢ 1 piece beef cube",
      "▢ 5 cups water",
      "▢ 2 tbsp cooking oil",
      "▢ 1 tbsp minced garlic",
      "▢ 1 medium sized onion minced",
      "▢ 1/4 cup green onions chopped",
      "▢ 14 ounces egg noodles cooked",
      "▢ 1 cup Chinese cabbage pechay Baguio, chopped",
      "▢ 4 pieces hard boiled eggs",
      "▢ salt and pepper to taste"
    ],
    "instructions": [
      "Put the oil in a cooking pot and apply heat",
      "Saute the garlic and onions",
      "Put-in the beef brisket and cook until the color of the outer part turns light brown",
      "Add the beef cube and star anise",
      "Pour-in the water and bring to a boil. Allow to boil until beef becomes tender",
      "Add salt and pepper to taste",
      "Place the cooked egg noodles and Chinese cabbage in a serving bowl",
      "Pour the soup and beef brisket on the bowl with noodles then garnish with sliced boiled egg and green onions",
      "Serve hot. Share and Enjoy!"
    ],
    "cooking_time": "1 hour",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/asian-filipino-soup-beef-mami-recipe/",
    "image_url": "",
    "image_path": "",
    "category": "Soups And Stews"
  },
  {
    "title": "Espasol Recipe",
    "ingredients": [
      "▢ 3 cups glutinous rice flour toasted",
      "▢ 1/2 cup sweet rice flour toasted",
      "▢ 2 cups sugar",
      "▢ 3 cups coconut milk",
      "▢ 1 1/2 cups grated coconut toasted",
      "▢ 1 tsp vanilla essence"
    ],
    "instructions": [
      "In a cooking pot, pour-in the coconut milk and bring to a boil.",
      "Add the sugar and stir continuously for 10 minutes.",
      "Put-in the toasted grated coconut and cook for 5 minutes.",
      "Add the vanilla essence and toasted rice flour and cook for 40 minutes to 1 hour or until the mixture becomes really thick while folding.",
      "Remove the mixture from the pot and allow to cool down.",
      "Dust the toasted sweet rice flour in a flat surface.",
      "Divide the mixture into parts and roll over the dusted sweet rice flour until a cylindrical shape is formed.",
      "Slice according to your preference.",
      "Put in a serving plate or wrap in paper or banana leaf. Share and enjoy!"
    ],
    "cooking_time": "1 hour",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/espasol/",
    "image_url": "",
    "image_path": "",
    "category": "Other Filipino Dishes"
  }
]