[
  {
    "title": "Pork Menudo Recipe",
    "ingredients": [
      "▢ 2 lbs. pork",
      "▢ 1/4 lb. pig liver",
      "▢ 1 cup potatoes diced",
      "▢ 1 piece carrot cubed",
      "▢ 1/2 cup soy sauce",
      "▢ 1/2 piece lemon",
      "▢ 1 piece onion chopped",
      "▢ 3 cloves garlic minced",
      "▢ 1 teaspoon sugar",
      "▢ 3/4 cup tomato sauce",
      "▢ 1 cup water",
      "▢ 4 pieces hotdogs sliced diagonally",
      "▢ 2 tablespoons cooking oil",
      "▢ 2 to 3 pieces dried bay leaves",
      "▢  Salt and pepper to taste"
    ],
    "instructions": [
      "Combine pork, soysauce, and lemon in a bowl. Marinate for at least 1 hour.",
      "Heat oil in a pan",
      "Saute garlic and onion.",
      "Add the marinated pork. Cook for 5 to 7 minutes.",
      "Pour in tomato sauce and water and then add the bay leaves.Let boil and simmer for 30 minutes to an hour depending on the toughness of the pork. Note: Add water as necessary.",
      "Add-in the liver and hot dogs.Cook for 5 minutes.",
      "Put-in potatoes, carrots, sugar,salt, and pepper. Stir and cook for 8 to 12 minutes.",
      "Serve. Share and enjoy!"
    ],
    "cooking_time": "1 hour",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/pork-menudo-recipe/",
    "image_url": "",
    "image_path": "",
    "category": "Main Dishes"
  },
  {
    "title": "Pork Caldereta Recipe",
    "ingredients": [
      "▢ 2 lbs. Pork sliced into cubes",
      "▢ 1 piece Knorr Pork cube",
      "▢ 8 oz. tomato sauce",
      "▢ ¾ cup green olives",
      "▢ 1 piece red bell pepper sliced",
      "▢ 1 piece green bell pepper sliced",
      "▢ 2 pieces potatoes cubed",
      "▢ 2 pieces carrot sliced",
      "▢ 1 piece onion chopped",
      "▢ 3 cloves garlic chopped",
      "▢ 1 1/2 cups water",
      "▢ ½ cup liver spread",
      "▢ 3 tablespoons cooking oil",
      "▢ Salt and ground black pepper to taste"
    ],
    "instructions": [
      "Heat the oil in a cooking pot.",
      "Once the oil gets hot, saute the garlic and onion.",
      "Add the pork. Saute until the color turns light brown.",
      "Pour-in the tomato sauce and water. Let boil. Cover and cook in low heat  for 60 minutes.",
      "Add the liver spread. Stir and cook for 3 minutes.",
      "Put-in the potato and carrot.  Cover and cook for 8 to 10 minutes.",
      "Add the olives and bell peppers. Cook for 5 minutes.",
      "Season with salt and ground black pepper.",
      "Turn-off the heat. Transfer to a serving plate.",
      "Serve. Share and enjoy!"
    ],
    "cooking_time": "1 hour",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/pork-caldereta/",
    "image_url": "",
    "image_path": "",
    "category": "Pork Dishes"
  },
  {
    "title": "Bicol Express Gising-gising Recipe",
    "ingredients": [
      "▢ 1 lb pork belly sliced",
      "▢ 2 cups long green beans",
      "▢ 1 piece Knorr Pork cube",
      "▢ 4 cups coconut milk",
      "▢ 1 piece onion",
      "▢ 2 thumbs  ginger",
      "▢ 4 cloves garlic chopped",
      "▢ 6 pieces chili pepper",
      "▢ 3 1/2 tablespoons shrimp paste",
      "▢ 1 tablespoons cooking oil",
      "▢ Ground black pepper to taste"
    ],
    "instructions": [
      "Heat oil in a wok or pan. Add pork belly. Sear until enough oil is extracted from the fat.",
      "Add onion, garlic, ginger, and chili pepper. Continue cooking until the onion softens.",
      "Add shrimp paste (bagoong alamang). Saute for 1 minute.",
      "Pour coconut milk into the pan.  Cover and let boil.",
      "Add Knorr Pork Cube. Stir. Cover the pan and adjust the heat to the lowest setting. Continue cooking until the pork gets tender.",
      "Add long green beans. Cook for 5 minutes.",
      "Season with ground black pepper.",
      "Serve! Share and enjoy."
    ],
    "cooking_time": "N/A",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/bicol-express-gising-gising-recipe/",
    "image_url": "",
    "image_path": "",
    "category": "Vegetable Dishes"
  },
  {
    "title": "How to Cook Longsilog",
    "ingredients": [
      "▢ 1/2 lb. skinless longanisa",
      "▢ 2 pieces eggs",
      "▢ 4 cups rice leftover",
      "▢ 5 cloves garlic crushed",
      "▢ 1/2 cup water",
      "▢ 4 tablespoons cooking oil",
      "▢ Salt and ground black pepper to taste"
    ],
    "instructions": [
      "Heat 2 tablespoons of oil in a pan. Once the oil gets hot, fry the eggs. Remove from the pan. Set aside.",
      "Add remaining oil in the pan. Fry the longanisa until the outer part turns light brown (around 1 1/2 minutes).",
      "Pour-in water. Let boil. Continue boiling until the water evaporates.  Fry the longanisa in remaining oil until fully cooked. Remove from the pan and set aside.",
      "Using the remaining oil, cook garlic until it starts to turn light brown.",
      "Add rice. Stir-fry for 3 minutes. Season with salt and ground black pepper.",
      "Assemble the fried eggs, longanisa, and sinangag on a plate. Serve with spicy vinegar as a dipping sauce for the longanisa.",
      "Share and enjoy!"
    ],
    "cooking_time": "N/A",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/how-to-cook-longsilog/",
    "image_url": "",
    "image_path": "",
    "category": "Rice Dishes"
  },
  {
    "title": "Nilagang Baka Recipe",
    "ingredients": [
      "▢ 2 lbs. beef sirloin cubed",
      "▢ 2 bunches  baby bok choy or pechay",
      "▢ 1 piece  cabbage",
      "▢ 6 pieces Saba banana halved",
      "▢ 4 pieces baking potato quartered",
      "▢ 1 piece  white onion halved",
      "▢ 4 staks celery  chopped",
      "▢ 1 piece star anise optional",
      "▢ 4 cups beef broth",
      "▢ 4 cups water",
      "▢ Salt and pepper to taste"
    ],
    "instructions": [
      "Combine the water and beef broth in a large cooking pot. Bring to a boil.",
      "Add the onion, star anise, and celery. Reduce the heat in medium. Cover the pot and continue to boil for 20 minutes.",
      "Remove the onion, star anise, and celery from the boiling liquid using a skimmer or a strainer. You can discard these ingredients.",
      "Add the beef. Simmer for 60 to 90 minutes or until the beef becomes tender. You can add more water if necessary.",
      "Put-in the saba banana and potatoes. Cook for 10 minutes.",
      "Add the bok choy and cabbage. Sprinkle salt and pepper. Stir.",
      "Cover and turn the heat off. Let the pot stay with cover-on for 2 to 5 minutes to cook the vegetables.",
      "Transfer to a serving bowl.",
      "Serve. Share and enjoy!"
    ],
    "cooking_time": "1 hour",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/nilagang-baka-recipe/",
    "image_url": "",
    "image_path": "",
    "category": "Soups And Stews"
  },
  {
    "title": "Chicken Afritada Recipe",
    "ingredients": [
      "▢ 1 ½ lbs. Chicken cut into serving pieces",
      "▢ 2 piece potato cubed",
      "▢ 1 piece carrot sliced",
      "▢ 8 oz. tomato sauce",
      "▢ 3 pieces hotdog sliced",
      "▢ ½ cup green peas",
      "▢ 3 pieces bay leaves",
      "▢ 1 piece red onion chopped",
      "▢ 2 teaspoons garlic minced",
      "▢ 3 cups chicken broth",
      "▢ ½ teaspoon sugar",
      "▢ 3 tablespoons cooking oil",
      "▢ Salt and ground black pepper to taste"
    ],
    "instructions": [
      "Heat the oil in a cooking pot. Saute onion and garlic until the onion softens.",
      "Add chicken. Cook for 30 seconds. Turn it over and cook the other side for another 30 seconds.",
      "Pour tomato sauce and chicken broth. Cover. Let boil.",
      "Add dried bay leaves. Cover the cooking pot. Continue to cook in medium heat for 30 minutes.",
      "Add hotdogs and carrot. Cook for 3 minutes.",
      "Add potato. Cover the pot and cook for 8 minutes.",
      "Add green peas. Cook for 2 minutes.",
      "Season with salt and ground black pepper",
      "Serve!"
    ],
    "cooking_time": "50 minutes",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/chicken-afritada-recipe/",
    "image_url": "",
    "image_path": "",
    "category": "Chicken Dishes"
  },
  {
    "title": "Easy Utan Bisaya (Law-Uy)",
    "ingredients": [
      "▢ 3/4 lb squash",
      "▢ 2 pieces taro",
      "▢ 1 piece Knorr Shrimp Cube",
      "▢ 4 thumbs  ginger",
      "▢ 2 stalks  lemongrass",
      "▢ 1 piece Chinese eggplant sliced",
      "▢ 10 pieces string beans cut in 2 inch pieces",
      "▢ 12 pieces okra",
      "▢ 2 cups spinach",
      "▢ 3 1/2 cups water",
      "▢ Salt and ground black pepper to taste"
    ],
    "instructions": [
      "Boil water in a cooking pot. Add lemongrass and ginger. Cook for 5 minutes.",
      "Add taro and squash. Cover and continue boiling for 5 to 7 minutes.",
      "Remove lemongrass from the pot. Add okra, string beans, and eggplant. Stir. Cover and continue cooking for 7 minutes.",
      "Add Knorr Shrimp Cube. Stir and cook for 3 minutes.",
      "Add spinach. Cook for 2 minutes.",
      "Season with salt and ground black pepper.",
      "Transfer to a serving bowl. Serve.",
      "Share and enjoy!"
    ],
    "cooking_time": "N/A",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/easy-utan-bisaya-law-uy/",
    "image_url": "",
    "image_path": "",
    "category": "Other Filipino Dishes"
  },
  {
    "title": "Chicken Paksiw Recipe",
    "ingredients": [
      "▢ 1 lb. leftover chicken cut into pieces",
      "▢ 1 piece Knorr Chicken Cube",
      "▢ 1 cup lechon sauce",
      "▢ 5 cloves garlic chopped",
      "▢ 1 piece onion chopped",
      "▢ 1 teaspoon whole peppercorn",
      "▢ 4 pieces dried bay leaves",
      "▢ 1/2 cup white vinegar",
      "▢ 1/4 cup sugar",
      "▢ 1 cup water",
      "▢ Salt to taste",
      "▢ 3 tablespoons cooking oil"
    ],
    "instructions": [
      "Heat oil in a pan. Saute onion and garlic.",
      "Once the onion softens, add chicken. Stir and saute for 1 minute.",
      "Pour the lechon sauce into the pan and then add vinegar. Let the mixture boil before stirring.",
      "Pour water into the pan. Let it boil.",
      "Add Knorr Chicken Cube, bay leaves, and whole peppercorn. Stir. Cover the pan and then adjust the heat to the lowest setting. Continue cooking for 35 minutes.",
      "Take the cover off the pan. Continue cooking until the sauce evaporates and reduces to half.",
      "Add sugar and then season with salt.",
      "Transfer it to a serving bowl and serve with warm rice. Share and enjoy!"
    ],
    "cooking_time": "N/A",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/chicken-paksiw-recipe/",
    "image_url": "",
    "image_path": "",
    "category": "Pork Dishes"
  },
  {
    "title": "Chicken Igado",
    "ingredients": [
      "▢ 1 lb chicken liver",
      "▢ 1 lb chicken heart sliced into half",
      "▢ 1 cup green peas",
      "▢ 1/2 cup carrots Julienne",
      "▢ 1 piece red bell pepper cut into strips",
      "▢ 4 pieces dried bay leaves",
      "▢ 1 piece onion chopped",
      "▢ 5 cloves garlic crushed",
      "▢ 4 tablespoons soy sauce",
      "▢ 5 tablespoons vinegar",
      "▢ 1 cup water",
      "▢ 6 tablespoons cooking oil",
      "▢ Salt and pepper to taste"
    ],
    "instructions": [
      "Heat 3 tablespoons of oil in a cooking pot. Pan-fry chicken liver for 2 minutes. Turn it over and fry the opposite side. Transfer the fried liver on a clean plate. Set aside. Note: There will be liquid coming out of the liver. Let it evaporate completely and continue frying until the liver turns light brown. Do the same step until the liver is completely cooked. Do not over fry it though to keep it from tasting bitter.",
      "Wipe the same pan with a clean paper towel to remove most of the liver residue. Heat remaining cooking oil. Saute garlic until it starts to brown. Add onion and continue sautéing until it softens.",
      "Add chicken heart. Saute for 2 minutes.",
      "Pour soy sauce and vinegar into the pot. Cover the pot and let the mixture boil. Cook for 1 minute.",
      "Add bay leaves and water. Cover the pot. Continue cooking using low to medium heat for 35 minutes. Note: add more water if needed.",
      "Put the fried liver into the pot. Stir. Cover and cook for 3 minutes.",
      "Add carrot, bell pepper, and green peas. Cover and continue cooking for 2 minutes.",
      "Season with salt and ground black pepper.",
      "Transfer to a serving plate. Serve and enjoy!"
    ],
    "cooking_time": "N/A",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/chicken-igado/",
    "image_url": "",
    "image_path": "",
    "category": "Chicken Dishes"
  },
  {
    "title": "Biko Recipe",
    "ingredients": [
      "▢ 2 cups glutinous rice aka sticky rice or malagkit",
      "▢ 1 1/2 cups water",
      "▢ 2 cups brown sugar",
      "▢ 4 cups coconut milk",
      "▢ 1/2 tsp salt"
    ],
    "instructions": [
      "Combine the sticky rice and water in a rice cooker and cook until the rice is ready (we intentionally combined lesser amount of water than the usual so that the rice will not be fully cooked)",
      "While the rice is cooking, combine the coconut milk with brown sugar and salt in a separate pot and cook in low heat until the texture becomes thick. Stir constantly.",
      "Once the rice is cooked and the coconut milk-sugar mixture is thick enough, add the cooked rice in the coconut milk and sugar mixture then mix well. Continue cooking until all the liquid evaporates (but do not overcook).",
      "Scoop the cooked biko and place it in a serving plate then flatten the surface.",
      "Share and Enjoy!"
    ],
    "cooking_time": "50 minutes",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/filipino-asian-food-dessert-rice-cake-biko-recipe/",
    "image_url": "",
    "image_path": "",
    "category": "Other Filipino Dishes"
  },
  {
    "title": "Pork Steak Recipe (How to Cook Pork Chop Steak)",
    "ingredients": [
      "▢ 4  pieces pork chops",
      "▢ 5 tablespoons soy sauce",
      "▢ 2 pieces lime  or calamansi",
      "▢ 1/2 cup cooking oil",
      "▢ 2 pieces  onions sliced",
      "▢ 1 1/2 cups water",
      "▢ 1/2 teaspoon granulated white sugar",
      "▢ Salt and pepper to taste"
    ],
    "instructions": [
      "Combine pork chops, soy sauce, and lime juice in a large bowl or resealable bag. Marinate for at least 1 hour.4  pieces pork chops, 2 pieces lime, 5 tablespoons soy sauce",
      "Heat a pan then pour-in cooking oil.1/2 cup cooking oil",
      "Pan-fry the marinated pork chops in medium heat for 3 minutes per side.",
      "Remove excess oil. Pour-in the remaining marinade and water and let boil. Simmer for 45 minutes or until the pork is tender. Note: Add water as needed.1 1/2 cups water",
      "Add-in the sugar, salt, and pepper then stir.1/2 teaspoon granulated white sugar, Salt and pepper to taste",
      "Put-in the onions and cook for 3 minutes more.2 pieces  onions",
      "Turn-off heat and transfer to a serving plate.",
      "Serve. Share and enjoy!"
    ],
    "cooking_time": "1 hour",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/pork-steak-recip/",
    "image_url": "",
    "image_path": "",
    "category": "Pork Dishes"
  },
  {
    "title": "Crispy Kare-kare Recipe",
    "ingredients": [
      "▢ 4 lbs. pork belly",
      "▢ 5 cups water",
      "▢ 3 tablespoons salt",
      "▢ 3 cups cooking oil",
      "▢ 1/2 cup bagoong alamang",
      "▢ 2 cups roasted peanuts",
      "▢ 1 piece Knorr Pork Cube",
      "▢ 1/2 cup annatto seeds",
      "▢ 1 piece onion chopped",
      "▢ 3 cloves garlic minced",
      "▢ 1 ½ tablespoons toasted rice powder",
      "▢ 2 cups water",
      "▢ 3 tablespoons cooking oil",
      "▢ 2 bunches  pechay",
      "▢ 1 piece eggplant  sliced",
      "▢ 12 pieces string beans",
      "▢ 1 cup banana blossoms sliced"
    ],
    "instructions": [
      "Prepare the pork. Boil water in a large cooking pot. Add pork. Continue boiling for 35 minutes. Remove the pork from the pot and let it cook down. Rub salt all over and let it stay for 5 minutes.",
      "Heat oil in a large pan. Once the oil gets really hot, fry the pork belly (skin side down). Note: BE CAREFUL! Splash 1 1/2 tablespoons of water on the oil every 3 minutes or until the skin gets golden brown and very crispy.",
      "Flip the pork and continue frying until the opposite side turns golden brown. Remove pork from the cooking pot and place it over a wire rack to let the excess oil drip. Set aside.",
      "Start to make the sauce. Grind the peanuts using a food processor until the texture becomes paste-like. Set aside.",
      "Make annatto water by soaking annatto seeds in hot water for 5 minutes. Constantly stir until the water turns deep orange. Filter the water using a kitchen strainer. You may discard the seeds afterwards. Set aside.",
      "Heat oil in a pan. Saute garlic and onion. Once the onion softens, add the peanut paste. Stir and cook for 1 minute.",
      "Pour water and then stir until the mixture becomes smooth. Let the liquid boil.",
      "Add Knorr Pork Cube and annatto water. Cover and continue cooking for 3 minutes. Remove the cover and cook until the mixture reduces to your desired consistency. Add toasted rice powder. Mix well. Turn off the heat. Make sure to cover the pot to keep the sauce warm.",
      "Cook the vegetables by steaming. Arrange string bean, banana blossom, and eggplant on a steamer. Steam for 5 minutes. Add pechay and continue steaming for 2 to 3 minutes.",
      "Assemble your crispy kare-kare by combining the sauce, steamed vegetables, and crispy pork in one plate. Serve with rice and bagoong alamang. Share and enjoy!"
    ],
    "cooking_time": "N/A",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/crispy-kare-kare-recipe/",
    "image_url": "",
    "image_path": "",
    "category": "Pork Dishes"
  }
]