[
  {
    "title": "No Eggs – Oatmeal Chocolate Chip Cookies",
    "ingredients": [
      "▢ 1 cup light brown sugar",
      "▢ 1/4 cup white sugar",
      "▢ 1 tablespoon vanilla extract",
      "▢ 1 cup melted butter",
      "▢ 1 1/4 cup all-purpose flour",
      "▢ 1 1/2 teaspoon baking soda",
      "▢ 2 1/4 cup quick 1-minute oats",
      "▢ 3/4 cup sliced almond",
      "▢ 1 cup semi sweet chocolate chips"
    ],
    "instructions": [
      "Preheat oven to 350F",
      "In a mixing bowl, combine butter, light brown and white sugar, and vanilla extract. Mix well.",
      "Gradually add the flour and oats. Make sure that all the ingredients are well blended.",
      "Fold-in the chocolate chips and almond.",
      "Put a parchment paper over a baking tray. Scoop around 1/4 cup of cookie dough (the mixture that you mixed above) and drop it in over the parchment paper and make sure to make a 2 inch distance between each dough.",
      "Bake in the oven for 13 to 14 minutes.",
      "Remove from the oven and arrange in a cooling rack. Let the oatmeal chocolate chip cookies stay in the rack until it totally cools down.",
      "Serve with milk. Share and enjoy!"
    ],
    "cooking_time": "24 minutes",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/oatmeal-chocolate-chip-cookies/",
    "image_url": "",
    "image_path": "",
    "category": "Other Filipino Dishes"
  },
  {
    "title": "Pork and Potato Stew Recipe",
    "ingredients": [
      "▢ 2 lbs. pork sliced into cubes",
      "▢ ½ cup all-purpose flour",
      "▢ 3 tablespoons cooking oil",
      "▢ 1 medium yellow onion chopped",
      "▢ ½ cup chopped celery stalk",
      "▢ 1 teaspoon dried thyme",
      "▢ 1 teaspoon dried oregano",
      "▢ 3 pieces medium plum tomato wedged",
      "▢ 2 large baking potato sliced into cubes",
      "▢ 2 cups chicken stock.",
      "▢ Salt and ground black pepper to taste"
    ],
    "instructions": [
      "Heat the cooking oil in a cooking pot.",
      "Dredge the pork slices in all-purpose flour. Pan fry until the color turns medium brown.",
      "Add onion, tomato, and celery. Stir and cook for 5 minutes in medium heat.",
      "Add thyme and oregano.",
      "Pour-in the chicken stock; let boil. Cover and simmer for 45 minutes while stirring every 10 minutes.",
      "Add the potato. Cook for 10 to 12 minutes in medium heat.",
      "Once the texture thickens, add salt and pepper to taste.",
      "Transfer to a serving plate.",
      "Serve. Share and enjoy!"
    ],
    "cooking_time": "1 hour",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/pork-and-potato-stew-recipe/",
    "image_url": "",
    "image_path": "",
    "category": "Pork Dishes"
  },
  {
    "title": "Bok Choy Guisado Recipe",
    "ingredients": [
      "▢ 4 cups chopped baby bok choy",
      "▢ 10 pieces shrimp shell and head removed",
      "▢ 1/4 lb. pork sliced into small pieces",
      "▢ 1 medium yellow onion chopped",
      "▢ 1 teaspoon minced garlic",
      "▢ 3 tablespoons cooking oil",
      "▢ 2 tablespoons fish sauce",
      "▢ 3/4 cup chicken stock",
      "▢ 1/4 teaspoon ground black pepper"
    ],
    "instructions": [
      "Heat the cooking oil in a cooking pan or wide cooking pot.",
      "Once the oil is hot, saute the garlic and onion.",
      "Add the pork. Cook for 10 minutes or until medium brown.",
      "Put-in the shrimp. Stir and cook for 3 minutes.",
      "Add the bok choy. Stir-fry for 3 to 5 minutes.",
      "Pour-in the chicken broth, fish sauce, and ground black pepper. Let boil. Cook for 5 minutes.",
      "Transfer to a serving bowl. Serve with white rice.",
      "Share and enjoy!"
    ],
    "cooking_time": "35 minutes",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/bok-choy-guisado-recipe/",
    "image_url": "",
    "image_path": "",
    "category": "Pork Dishes"
  },
  {
    "title": "Simple Applesauce Recipe",
    "ingredients": [
      "▢ 6 medium apples peeled, cored, and sliced",
      "▢ 1 cup apple juice or apple cider",
      "▢ 3 tablespoons honey",
      "▢ 1/2 teaspoon cinnamon powder",
      "▢ 1/2 teaspoon lemon juice"
    ],
    "instructions": [
      "Combine apple, apple juice, and lemon juice in a cooking pot. Cover and let boil. Adjust the heat to low-medium then cook for 18 to 20 minutes. Add apple juice or water if the liquid evaporates quickly.",
      "Once the apples are soft, gradually put the honey in. Stir until all the ingredients are well blended.",
      "Add the cinnamon powder. Stir. At this point, you can use a immersion blender to puree the mixture or you can wait for the mixture to cool down and puree it in a blender.",
      "Serve. Share and enjoy!"
    ],
    "cooking_time": "25 minutes",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/simple-applesauce-recipe/",
    "image_url": "",
    "image_path": "",
    "category": "Other Filipino Dishes"
  },
  {
    "title": "Asian Style Spare Ribs",
    "ingredients": [
      "▢ 4 lbs. pork spare ribs sliced into individual pieces",
      "▢ 1/2 cup soy sauce",
      "▢ juice from 3 limes",
      "▢ 1 teaspoon garlic powder",
      "▢ 1/4 teaspoon ground black pepper",
      "▢ 3 tablespoons blackstrap molasses",
      "▢ 3/4 cup hoisin sauce",
      "▢ 1 teaspoon roasted sesame seeds."
    ],
    "instructions": [
      "Combine soy sauce, molasses, lime juice, garlic powder, and ground black pepper in a bowl. Stir until well blended.",
      "Put the sliced pork spare ribs in a resealable bag. Pour-in the soy sauce mixture. Let the air out, then seal the bag. Place it inside the refrigerator and marinate overnight.",
      "Preheat oven to 350F.",
      "Line a parchment paper or aluminum foil on an oval roaster (use the roaster with cover). Arrange the marinated pork spare ribs on top. Brush the spare ribs with hoisin sauce.",
      "Cover the roaster and roast the ribs for 50 to 60 minutes.",
      "Arrange the ribs in a serving plate. Brush more Hoisin sauce, if preferred. Sprinkle sesame seeds all over the ribs.",
      "Serve with homemade French fries or enjoy it with white rice. Share and enjoy."
    ],
    "cooking_time": "1 hour",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/asian-style-spare-ribs/",
    "image_url": "",
    "image_path": "",
    "category": "Pork Dishes"
  },
  {
    "title": "Kale and Tuna Laing Recipe",
    "ingredients": [
      "▢ 2 cups 1 can coconut milk",
      "▢ 2 cups 1 can coconut cream",
      "▢ 12 ounces canned tuna in water",
      "▢ 5 to 8 pieces dried red chili pepper",
      "▢ 3 cups dried chopped kale leaves",
      "▢ ¼ cup sliced ginger",
      "▢ 1 teaspoon minced garlic",
      "▢ ¼ cup spicy shrimp paste bagoong"
    ],
    "instructions": [
      "Combine the coconut milk, tuna (including the water), chili pepper, garlic, and ginger in a cooking pot.",
      "Heat-up the stove top and let the mixture boil. Cover and cook in medium heat for 10 minutes.",
      "Add the dried kale leaves. Do not stir. Cover and cook for 15 minutes in low to medium heat.",
      "Remove the cover and stir. Make sure that the kale absorbs the coconut milk. Cover again and continue to cook for another 15 minutes. You will need to add more coconut milk if it is starts to evaporate during the process.",
      "Add the coconut cream and shrimp paste. Stir. Cover and continue to cook in low to medium heat for 45 to 60 minutes. You can add more coconut milk or water during the process if needed.",
      "Transfer to a serving bowl. Serve with rice.",
      "Share and enjoy!"
    ],
    "cooking_time": "1 hour",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/kale-and-tuna-laing-recipe/",
    "image_url": "",
    "image_path": "",
    "category": "Other Filipino Dishes"
  },
  {
    "title": "Pork Nilaga with Kalabasa Recipe",
    "ingredients": [
      "▢ 2 lbs. pork shoulder sliced into cubes",
      "▢ 6 to 7 cups water",
      "▢ 1 piece beef or pork cube or 1 teaspoon beef powder",
      "▢ 1 small cabbage chopped",
      "▢ 3/4 cup sliced green onions",
      "▢ 1 large baking potato cubed",
      "▢ 2 cups calabaza squash kalabasa, cubed",
      "▢ 1 medium onion sliced",
      "▢ 2 tablespoons fish sauce patis",
      "▢ 1 tablespoon whole peppercorn"
    ],
    "instructions": [
      "Pour the water in a cooking pot. Bring to a boil.",
      "Add the onion and whole peppercorn. Cover and boil for 10 minutes.",
      "Add the pork. Stir, cover, and simmer for 45 to 60 minutes.",
      "Put-in the beef cube, calabaza squash and potato. Cook for 7 minutes.",
      "Add the cabbage and green onions. Continue to cook for 5 minutes.",
      "Add the fish sauce. Stir. Cook for 1 to 3 minutes more.",
      "Transfer to a serving bowl. Serve.",
      "Share and enjoy!"
    ],
    "cooking_time": "1 hour",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/pork-nilaga-with-kalabasa-recipe/",
    "image_url": "",
    "image_path": "",
    "category": "Soups And Stews"
  },
  {
    "title": "Pinoy Fruit Salad Recipe",
    "ingredients": [
      "▢ 2 cans 30 oz. fruit cocktail",
      "▢ 1 can 7.6 oz. table cream",
      "▢ 7 oz. 1/2 can  condensed milk",
      "▢ 12 pieces maraschino cherries"
    ],
    "instructions": [
      "Open the fruit cocktail and drain the syrup by pouring it on a colander. Let the liquid drain totally (around 30 minutes).",
      "Arrange the drained fruit cocktail in a mixing bowl. Add the table cream, condensed milk, and maraschino cherries.",
      "Gently fold the mixture until all the ingredients are well distributed. Cover the mixing bowl with sling wrap then refrigerate overnight.",
      "Remove from the fridge and transfer to a serving bowl.",
      "Serve. Share and enjoy!"
    ],
    "cooking_time": "40 minutes",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/pinoy-fruit-salad-recipe/",
    "image_url": "",
    "image_path": "",
    "category": "Other Filipino Dishes"
  },
  {
    "title": "Fried Embutido Recipe",
    "ingredients": [
      "▢ 1 serving cooked embutido pork or chicken, sliced into serving pieces",
      "▢ 2 fresh eggs",
      "▢ 1/8 teaspoon salt",
      "▢ 1/8 teaspoon ground black pepper",
      "▢ 4 tablespoons cooking oil"
    ],
    "instructions": [
      "Crack the eggs in a bowl. Add salt and pepper. Beat until all ingredient are well blended. Set aside.",
      "Heat the cooking oil in a pan.",
      "While the oil is starting to heat-up, dip the sliced embutido into the beaten egg mixture.",
      "Arrange the egg-coated embutido in the frying pan.",
      "Fry in medium heat for 2 to 4 minutes per side. Make sure to turn the embutido over if it starts to turn brown.",
      "Transfer to a serving plate. Serve with ketchup.",
      "Share and enjoy!"
    ],
    "cooking_time": "20 minutes",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/fried-embutido-recipe/",
    "image_url": "",
    "image_path": "",
    "category": "Pork Dishes"
  },
  {
    "title": "Bagnet Recipe",
    "ingredients": [
      "▢ 2 to 2 1/2 lbs. whole pork belly",
      "▢ 1 medium red onion",
      "▢ 1 tablespoon whole black peppercorn",
      "▢ 1 1/2 tablespoons salt",
      "▢ 6 cloves crushed garlic",
      "▢ 4 to 6 cups water",
      "▢ 3 cups cooking oil"
    ],
    "instructions": [
      "Arrange the pork belly in a wide and deep cooking pot. Pour-in the water. Make sure that the pork belly is fully submerged in water. Let boil.",
      "Once the water starts to boil, add the garlic, onion, 1 tablespoon salt, and whole black peppercorn. Simmer for 30 to 40 minutes.",
      "Remove the boiled pork belly from the cooking pot and place in a plate. Let it cool to room temperature.",
      "Rub the remaining 1/2 tablespoon of salt all over the boiled pork belly. Let is stay for 10 to 20 minutes.",
      "Heat the cooking oil in a deep cooking pot. When the oil gets hot, gently put-in the pork belly and deep-fry in medium heat until the pork belly turns golden brown and the texture gets crispy. The oil will splatter during this process, so be careful. Make sure that you do not cover the cooking pot completely while deep frying. You can put a splatter guard on top of the cooking pot to control the oil.",
      "Once the pork belly is golden brown and crispy, remove it from the cooking pot and arrange in a plate lined with paper towel. Turn the stove off and let the pork belly cool down to room temperature.",
      "When the pork belly cools down, heat-up the oil on more time. Deep fry the same pork belly for the second time in medium heat for 5 to 10 minutes or until it gets extra crispy.",
      "Remove from the cooking pot and place in a plate lined with paper towel. Let the towel absorb the excess oil.",
      "Slice the pork bagnet into serving pieces and serve with bagoong monamon (also known as bugguong munamon) or even guinamos or bagoong Balayan. Note: you can squeeze lemon or calamansi on the bagoong to make it taste better.",
      "Share and enjoy!"
    ],
    "cooking_time": "1 hour",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/bagnet-recipe/",
    "image_url": "",
    "image_path": "",
    "category": "Pork Dishes"
  },
  {
    "title": "Skewered Filipino Pork BBQ",
    "ingredients": [
      "▢ 4 lbs. pork shoulder sliced into thin pieces",
      "▢ 3/4 cup soy sauce",
      "▢ 3/4 cup banana ketchup",
      "▢ Juice from 2 lemons",
      "▢ 1 tablespoon garlic powder",
      "▢ 1/2 teaspoon ground black pepper",
      "▢ 1/2 cup brown sugar",
      "▢ 1/4 teaspoon salt"
    ],
    "instructions": [
      "Combine soy sauce, banana ketchup, lemon juice, salt, pepper, garlic powder, and brown sugar in a bowl. Mix well. You can also microwave the mixture for 1 minute (optional). This will melt the sugar and make it easier for the other ingredients to dilute quickly.",
      "Arrange the sliced pork in a resealable bag or in a bowl. Pour-in the soy sauce mixture. Make sure that the mixture is in room temperature.",
      "Massage the pork slices and make sure that it is completely soaked in the soy sauce mixture. Seal the bag or cover the bowl. Place inside the refrigerator and marinate for at least 5 hours.",
      "Skewer the marinated pork slices in a bamboo skewer (this is also known as barbecue stick).",
      "Heat-up the grill. Grill each skewered pork for 5 minutes per side in medium heat. Brush some basting sauce on each side before turning it over. Do this cycle twice or until the pork is fully cooked.",
      "Transfer to a serving plate. Serve with vinegar dip.",
      "Share and enjoy."
    ],
    "cooking_time": "55 minutes",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/filipino-skewered-pork-bbq/",
    "image_url": "",
    "image_path": "",
    "category": "Pork Dishes"
  },
  {
    "title": "Saging con Hielo Recipe",
    "ingredients": [
      "▢ 4 to 6 pieces ripe saba banana peeled",
      "▢ 3/4 cup brown sugar",
      "▢ 1 1/2 cups water",
      "▢ 1 teaspoon vanilla extract or vanilla essence",
      "▢ 1/4 teaspoon salt",
      "▢ 1 1/2 cups shaved ice",
      "▢ 1/4 cup evaporated milk"
    ],
    "instructions": [
      "Pour-in the water in a cooking pot. Let boil.",
      "Put-in the brown sugar. Stir.",
      "Add the vanilla extract (or essence) and salt. Stir once more. Cook for 1 minute.",
      "Add the saba banana. Cover the cooking pot. Adjust the heat to low and cook for 10 to 15 minutes. Let the liquid reduce to half. Turn-off the heat and allow the banana to cool.",
      "Transfer to a serving bowl. Top with shaved ice and pour evaporated milk.",
      "Serve. Share and enjoy!"
    ],
    "cooking_time": "30 minutes",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/saging-con-hielo-recipe/",
    "image_url": "",
    "image_path": "",
    "category": "Other Filipino Dishes"
  }
]