[
  {
    "title": "BBQ Chicken Wrap",
    "ingredients": [
      "▢ 2 4 oz. pieces boneless chicken breast",
      "▢ 1 teaspoon sea salt",
      "▢ 1/2 teaspoons vegetable oil",
      "▢ 1/2 cup BBQ sauce homemade or store bought",
      "▢ 1/2 cup sharp chaddar cheese",
      "▢ 2 pieces large flour tortillas",
      "▢ 2 cups chopped fresh romaine lettuce",
      "▢ 1/4 cup chopped purple cabbage",
      "▢ 3/4 cup chopped green cabbage",
      "▢ 1/4 cup carrots julienne"
    ],
    "instructions": [
      "Rub salt all over the chicken breasts. Let it stay for 10 minutes.",
      "Coat the chicken with vegetable oil.",
      "Heat-up the grill. Start to grill one side of the chicken for 3 minutes per side.",
      "Baste BBQ sauce on each side of the chicken and continue to grill for another 3 to 4 minutes per side. Remove from the grill and let it cool down.",
      "Slice the grilled chicken BBQ croswise into strips. Apply the remaining BBQ sauce on top.",
      "Meanwhile, lay a piece of flour tortilla flat on a large plate. Arrange half of each fresh vegetables (see recipe above) over the tortilla. Top with cheese and slices of chicken from one breast.",
      "Secure the contents by wrapping the tortilla all over it. Do this by folding a quarter of both sides (left and right) inwards. Roll the flour tortilla from bottom to top until the contents are secured.",
      "Serve with your favorite dressing.",
      "Share and enjoy!"
    ],
    "cooking_time": "22 minutes",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/bbq-chicken-wrap/",
    "image_url": "",
    "image_path": "",
    "category": "Chicken Dishes"
  },
  {
    "title": "Ginataang Manok Na May Luyang Dilaw",
    "ingredients": [
      "▢ 2 lbs. chicken thigh cut into serving pieces",
      "▢ 1 20g pack Knorr Ginataang Gulay mix",
      "▢ 1 cup hot pepper leaves dahon ng sili",
      "▢ ½ cup sliced turmeric luyang dilaw",
      "▢ 5 pieces Thai chili optional",
      "▢ 1 medium yellow onion diced",
      "▢ 5 cloves garlic crushed",
      "▢ 2 ½ cups water",
      "▢ 1/8 teaspoon crushed peppercorn",
      "▢ 3 tablespoons fish sauce",
      "▢ 3 tablespoons cooking oil"
    ],
    "instructions": [
      "Heat oil in a pan.",
      "Once the oil becomes hot, sauté garlic, onion, and turmeric (luyang dilaw) until the onion softens.",
      "Add chicken. Cook until all the sides turns light to medium brown.",
      "Pour 1 ½ cups water. Let boil. Cover and continue to boil in medium heat for 30 minutes.",
      "Combine Knorr Ginataang Gulay mix with 1 cup water. Stir until well blended.",
      "Pour the mixture into the pan. Let boil.",
      "Add crushed peppercorn and Thai chili. Stir. Cover and continue to cook until the sauce reduces to half.",
      "Add hot pepper leaves. Stir. Note: you can also use malunggay leaves or spinach",
      "Pour the fish sauce into the mixture. Stir and continue to cook uncovered for 5 minutes.",
      "Transfer to a serving plate. Serve as a pulutan or a main dish with a cup of rice.",
      "Share and enjoy."
    ],
    "cooking_time": "1 hour",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/ginataang-manok-na-may-luyang-dilaw/",
    "image_url": "",
    "image_path": "",
    "category": "Vegetable Dishes"
  },
  {
    "title": "Extremely Spicy Pork Adobo na Tuyo",
    "ingredients": [
      "▢ 2 lbs. pork belly cut into serving pieces",
      "▢ 1 Ghost Pepper",
      "▢ 2 teaspoons whole peppercorn",
      "▢ 6 cloves garlic crushed",
      "▢ 6 pieces dried bay leaves",
      "▢ 12 pieces Thai chili",
      "▢ ½ cup soy sauce",
      "▢ ¼ cup white vinegar",
      "▢ 2 cups beef broth"
    ],
    "instructions": [
      "Combine pork, soy sauce, whole peppercorn, and garlic in a bowl. Mix well. Cover the bowl with a clear plastic wrap. Place inside the refrigerator and marinate for at least 3 hours.",
      "Heat a pan on a stovetop. Once the pan is hot enough, pour the marinated pork along with the marinade. Cook until the pork browns.",
      "Pour beef broth into the pan. Let boil.",
      "Add the ghost pepper and Thai chilies. Cover the pan and continue to cook in medium heat for 15 minutes.",
      "Add bay leaves and vinegar. Let the liquid boil. Stir and then cover the pan. Continue to cook for 40 to 60 minutes or until the pork becomes tender. Note: you can add more broth or water if the liquid starts to dry while the pork is not that tender enough.",
      "Remove the cover from the pan. Continue to cook until the liquid totally evaporates. Cook a little bit longer in low to medium heat until oil gets extracted from the pork.",
      "Transfer to a serving plate. Serve for pulutan or as a main dish with warm rice.",
      "Share and enjoy!"
    ],
    "cooking_time": "4 hours",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/extremely-spicy-pork-adobo-na-tuyo/",
    "image_url": "",
    "image_path": "",
    "category": "Chicken Dishes"
  },
  {
    "title": "How to Make Kimchi at Home",
    "ingredients": [
      "▢ 2 lbs. Napa cabbage",
      "▢ 7 tablespoons coarse sea salt",
      "▢ 6 to 8 pints of cold water",
      "▢ 1 medium Daikon radish julienne",
      "▢ 4 tablespoons minced fresh ginger",
      "▢ 4 tablespoons minced garlic",
      "▢ 1 bunch scallions cut into 1 inch length pieces (discard lower end)",
      "▢ 5 tablespoons Gochugaru Korean red pepper flakes powder",
      "▢ 1/4 cup fish sauce",
      "▢ 1 tablespoon shrimp paste bagoong alamang",
      "▢ 2 teaspoons granulated white sugar"
    ],
    "instructions": [
      "Cut the lower end if the Napa Cabbage and then discard. Slice the cabbage into small squares (1.5 x 1.5 inch) by starting to slice the cabbage in half lengthwise and then continue by slicing crosswise until the desired shape and size is achieved.",
      "Place the chopped cabbage in a colander or a wide wire mesh. Wash with running water until clean.",
      "Arrange the cabbage in a large mixing bowl. Add salt. Gently mash salt all over the cabbage using your hands. Pour cold water until the cabbage is fully submerged. Cover the bowl with a clear plastic wrap. Let the cabbage soak for 18 to 24 hours.",
      "Discard the water and place the cabbage back on the colander or wire mesh. Wash with running water. Let all the liquid drip off. Set aside.",
      "Combine cabbage, scallions, ginger, garlic, Daikon radish in a large mixing bowl. Toss.",
      "Add all the spices and seasoning ingredients (see recipe above). Toss once more until all the ingredients are well blended.",
      "Arrange in a large mason jar or Kimchi container. Cover the container tightly and place in a dark spot in room temperature for 20 to 28 hours. Note: The ingredients are starting to ferment at this point.",
      "Let the air escape from the container by opening it. Seal it once more and place inside the refrigerator to chill for 3 days.",
      "Serve as a side dish with your favorite food, or use it as an ingredient to make other dishes such as Kimchi fried rice.",
      "Share and enjoy!"
    ],
    "cooking_time": "2 days",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/how-to-make-kimchi-at-home/",
    "image_url": "",
    "image_path": "",
    "category": "Seafood"
  },
  {
    "title": "How to Cook Sinampalukang Manok",
    "ingredients": [
      "▢ 2 lbs. chicken cut into serving pieces",
      "▢ 3/4 cups tamarind flower buds or tamarind leaves",
      "▢ 1 large red onion",
      "▢ 4 pieces long green pepper siding pansigang",
      "▢ 3 thumbs ginger sliced",
      "▢ 4 cloves garlic crushed",
      "▢ 1 20 g. Knorr Sinigang sa Sampaloc Mix, original",
      "▢ 1 Knorr Chicken Cube",
      "▢ 3 tablespoons fish sauce",
      "▢ 6 cups water"
    ],
    "instructions": [
      "Heat cooking pot and then sear the chicken. Continue to cook until most of the chicken fat are extracted.",
      "Remove the chicken from the pot. Set aside.",
      "Using the extracted oil, sauce garlic, onion, and ginger.",
      "Once the onion becomes soft, add the chicken back to the pot.",
      "Pour water. Let boil. Seal the tamarind flower buds in a cheesecloth and tie using a kitchen twine.",
      "Add the cheese cloth with tamarind flower buds in the pot. Stir.",
      "Add Knorr chicken cube and long green pepper. Cover the pot. Cook in medium heat until the chicken gets tender.",
      "Remove the tamarind flower buds. Add Knorr Singing Mix. Stir.",
      "Add fish sauce. Cook for 5 minutes.",
      "Transfer to a serving plate. Serve.",
      "Share and enjoy!"
    ],
    "cooking_time": "1 hour",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/how-to-cook-sinampalukang-manok/",
    "image_url": "",
    "image_path": "",
    "category": "Seafood"
  },
  {
    "title": "Spicy Honey Chicken with Steamed Vegetables",
    "ingredients": [
      "▢ 2 4 oz. boneless chicken breast",
      "▢ 2 tablespoons honey",
      "▢ 1 1/2 teaspoons white vinegar",
      "▢ 1 teaspoon garlic powder",
      "▢ 1 teaspoon cayenne pepper powder",
      "▢ 1/4 teaspoon ground cumin",
      "▢ 2 teaspoons smoked paprika",
      "▢ 1/8 teaspoon ground black pepper",
      "▢ 1/4 teaspoon salt",
      "▢ 1 small yellow squash. sliced",
      "▢ 1 small zucchini sliced",
      "▢ 1 medium carrot sliced",
      "▢ 1 cup broccoli florets",
      "▢ 1 cup cauliflower sliced",
      "▢ 2 cups water for steaming"
    ],
    "instructions": [
      "Combine all chicken rub ingredients in bowl. Mix well. Rub all over the chicken breasts. Let it stay for 15 minutes.",
      "Set the oven to broil mode.",
      "Arrange the chicken on a baking tray.Broil each side for 4 minutes.",
      "Combine honey and vinegar in a small bowl. Stir until well blended. Brush both side of the chicken with honey mixture.",
      "Put back in the oven. Continue to broil each side for 4 to 5 minutes or until done.",
      "Remove from the oven and arrange in a plate.",
      "Meanwhile pour water on and steamer. Arrange the steamed vegetable ingredients in the steamer and steam for 8 to 12 minutes.",
      "Serve with the spicy honey chicken.",
      "Share and enjoy!"
    ],
    "cooking_time": "30 minutes",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/spicy-honey-chicken-steamed-vegetables-recipe/",
    "image_url": "",
    "image_path": "",
    "category": "Chicken Dishes"
  },
  {
    "title": "How To Cook Super Crispy Lechon Kawali",
    "ingredients": [
      "▢ 3 lbs. pork belly",
      "▢ 5 pieces dried bay leaves",
      "▢ 1 1/2 tablespoons whole pepperorn",
      "▢ 3 pints water",
      "▢ 2 pints cooking oil",
      "▢ 1 tablespoon salt"
    ],
    "instructions": [
      "Boil water in a cooking pot.",
      "Add dried bay leaves and whole peppercorn. Cook for 2 minutes.",
      "Add pork belly. Cover and cook in medium heat for 30 minutes or until tender. Turn the meat over (if necessary) to equally cook the opposite side.",
      "Remove the pork belly from the cooking pot. Place it in a clean plate. Let it cool down until you can safely handle it with your hands.",
      "Rub salt all over the pork. Let it stay for 15 minutes.",
      "Heat oil in a deep cooking pot. Once the oil gets hot (320F to 350F), put the boiled pork belly in skin side facing down. Deep fry until the skin turns brown. Note: there is no definite time for this step. Use the sound of the oil as your queue. When the oil starts to calm down a bit, check the pork belly to see if the skin is brown.",
      "Turn the pork belly over and deep fry the opposite side for 5 minutes.",
      "Remove the entire pork belly slab from the cooking pot. Place it in a plate with grates or lined with paper towel. Let it rest for 10 to 15 minutes. Note: turn off the stove during this time.",
      "Turn on the stove to heat the oil. Once the oil is hot enough, put the pork belly back into the pot skin side facing down. Deep fry for 3 to 6 minutes or until golden brown.",
      "Remove from the cooking pot. Put on a plate and let the excess oil drip.",
      "Test for crispiness by hitting the crackling (crispy skin) lightly with a fork or knife. It should create a sound. Chop the super crispy lechon kawali into bite-sized pieces.",
      "Transfer to a serving plate. Serve with your favorite dipping sauce and a cup of warm rice.",
      "Share and enjoy!"
    ],
    "cooking_time": "1 hour",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/how-to-cook-super-crispy-lechon-kawali/",
    "image_url": "",
    "image_path": "",
    "category": "Pork Dishes"
  },
  {
    "title": "Burong Mustasa (Pickled Flat Mustard Greens)",
    "ingredients": [
      "▢ 8 ounces fresh flat mustard greens",
      "▢ 2 tablespoons coarse sea salt",
      "▢ 3 tablespoons rice",
      "▢ 1 ½ cups water"
    ],
    "instructions": [
      "Wash the flat mustard leaves and pat dry. Soak under the sun for 1 hour or until wilted.",
      "Meanwhile, prepare the rice water by combining rice and water in a pot. Cover and cook the rice in medium heat until soft.",
      "Combine salt and mustard leaves in a bowl. Gently mash the mixture. Arrange in a resealable jar.",
      "Place a mesh strainer over the jar. Pour the rice water from the pot. Note: the soft rice should be filtered by the mesh. We only need the water for this process.",
      "Cover the jar. Let it stay in room temperature for 4 to 6 days.",
      "Serve as an appetizer or use an ingredient to cook fish, egg, and other dishes. You can stock it in cooler temperature (50 to 55F) for the flavor to develop further.",
      "Share and enjoy!"
    ],
    "cooking_time": "1 hour",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/burong-mustasa-pickled-flat-mustard-greens/",
    "image_url": "",
    "image_path": "",
    "category": "Seafood"
  },
  {
    "title": "Buttermilk Waffles",
    "ingredients": [
      "▢ 2 cups all-purpose flour",
      "▢ 1 pint buttermilk",
      "▢ 2 eggs",
      "▢ 1 tablespoon granulated white sugar",
      "▢ 2 teaspoons baking powder",
      "▢ 1 teaspoon baking soda",
      "▢ 1/4 cup butter melted",
      "▢ 2 teaspoons vanilla extract",
      "▢ 1/2 teaspoon salt"
    ],
    "instructions": [
      "Preheat waffle maker.",
      "Combine all dry ingredients in a bowl starting with flour, sugar, baking powder, baking soda, and salt. Mix well using a wire whisk.",
      "Add eggs, butter, and vanilla extract. Whisk until texture becomes smooth.",
      "Pour batter into the waffle maker. Close and secure and cook for 2 minutes or a little bit more if you want it crisp on the outside.",
      "Transfer to a serving plate. Top with whipped butter and syrup.",
      "Serve. Share and enjoy!"
    ],
    "cooking_time": "12 minutes",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/buttermilk-waffles-recipe/",
    "image_url": "",
    "image_path": "",
    "category": "Other Filipino Dishes"
  },
  {
    "title": "Super Tender Juicy Chicken Nuggets",
    "ingredients": [
      "▢ 1 1/2 lbs. boneless chicken breast sliced into strips",
      "▢ 2 eggs beaten",
      "▢ 1/2 cup all-purpose flour",
      "▢ 3/4 cups bread crumbs",
      "▢ 1 1/2 teaspoons salt",
      "▢ 2 cups cooking oil"
    ],
    "instructions": [
      "Rub salt all over the chicken.",
      "Arrange the chicken in resealable bags. Vacuum seal using the water displacement method. (check this post to see how)",
      "Sous Vide cook for 1 1/2 hours at 140F.",
      "Slice the cooked chicken breasts into squares.",
      "Place the each piece in a small oval cookie cutter and mold by pressing it using your thumb.",
      "Heat oil in a pot.",
      "Dredge each chicken nugget in flour then dip in beaten egg. Roll over breadcrumbs until coated.",
      "Heat oil in a cooking pot.",
      "Once the oil gets hot, quickly deep fry the nuggets in medium heat until the color turns golden brown. This will take around 2 minutes. Note: No need to fry the chicken longer as the inside is already pre-cooked.",
      "Arrange the tender juicy chicken nuggets in a plate lined with paper towel.",
      "Serve with your favorite dip. Share and enjoy!"
    ],
    "cooking_time": "1 hour",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/super-tender-juicy-chicken-nuggets/",
    "image_url": "",
    "image_path": "",
    "category": "Chicken Dishes"
  },
  {
    "title": "Gotong Batangas Recipe",
    "ingredients": [
      "▢ 1/2 lb. honeycomb tripe",
      "▢ 1/2 lb. blanket tripe",
      "▢ 1/2 lb. beef heart",
      "▢ 1/4 lb. small intestine",
      "▢ 1/2 lb. beef tendon",
      "▢ 2 large red onions chopped",
      "▢ 3 pieces Thai chili",
      "▢ 2 quarts rice wash",
      "▢ 1/2 cup annatto seeds diluted in water",
      "▢ 1 tablespoon salt",
      "▢ 1 teaspoon crushed whole peppercorn",
      "▢ 2 teaspoons garlic powder",
      "▢ 1 beef bouillon",
      "▢ 1/2 cup chopped green onions",
      "▢ 2 quarts water"
    ],
    "instructions": [
      "Pour water in a large cooking pot. Let boil.",
      "Add all the beef innards. Cover and cook in medium heat for 30 minutes.",
      "Discard the water. Pour rich washing into the pot. Let boil.",
      "Add salt, crushed peppercorn, garlic powder, onion, chili, and annatto water. Stir.",
      "Add beef bouillon. Cover and cook in low heat for 4 hours.",
      "Remove the innards from the cooking pot. Slice into serving pieces.",
      "Arrange in a bowl. Pour hot broth in the bowl and top with chop green onions and chili.",
      "Serve with a dipping sauce composed of chopped onion, soy sauce, calamansi, and chili.",
      "Share and enjoy!"
    ],
    "cooking_time": "4 hours",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/gotong-batangas-recipe/",
    "image_url": "",
    "image_path": "",
    "category": "Soups And Stews"
  },
  {
    "title": "Grilled Liempo with Fried Tofu",
    "ingredients": [
      "▢ 1 lb. grilled liempo chopped",
      "▢ 6 ounces deep fried extra firm tofu cubed",
      "▢ Spiced Vinegar",
      "▢ 3/4 cup white vinegar",
      "▢ 4 pieces chili peppers",
      "▢ 1 small red onion sliced",
      "▢ 2 tablespoons chopped green onions",
      "▢ • 1/2 teaspoon granulated white sugar",
      "▢ • 2 tablespoons soy sauce",
      "▢ • A dash of ground black pepper"
    ],
    "instructions": [
      "Prepare the spiced vinegar by combining all of its ingredients listed above. Stir and ensure that it gets well blended.",
      "Place the chopped pork belly and cubed fried tofu in a large bowl. Pour the spiced vinegar into the bowl. Toss until pork and tofu gets completely coated.",
      "Transfer to a serving bowl. Sprinkle green onions on top.",
      "Serve. Share and enjoy!"
    ],
    "cooking_time": "35 minutes",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/grilled-liempo-with-fried-tofu/",
    "image_url": "",
    "image_path": "",
    "category": "Pork Dishes"
  }
]