[
  {
    "title": "Oatmeal Cookies Recipe",
    "ingredients": [
      "▢ 1 cup oats",
      "▢ 3/4 cup all-purpose flour",
      "▢ 1/2 teaspoon baking powder",
      "▢ 1/2 teaspoon ground cinnamon",
      "▢ 1/2 cup butter softened",
      "▢ 3/4 cup light brown sugar",
      "▢ 1 teaspoon vanilla extract",
      "▢ 1 piece raw egg",
      "▢ 1/4 teaspoon salt",
      "▢ 1/2 cup raisins"
    ],
    "instructions": [
      "Combine flour, baking powder, ground cinnamon, and salt then mix well. Set aside.",
      "Put the butter in a mixing bowl then cream using an electric mixer.",
      "Gradually add the light brown sugar while beating. Continue beating until the texture becomes fluffy.",
      "Add-in the vanilla extract then continue mixing for 2 to 3 minutes.",
      "Put-in the egg then beat in low-speed for another minute.",
      "Gradually add the oats and mix until fully distributed.",
      "Gradually add the dry ingredient mixture (flour, baking powder, salt, ground cinnamon) then mix again.",
      "Add the raisins and incorporate with the other ingredients.",
      "Preheat the oven to 350 degrees Fahrenheit.",
      "Place a wax or parchment paper on top of the cookie sheet or baking tray. Scoop some of the mixture and arrange on top of the wax/parchment paper. Flatten the mixture to a thickness of about 1/2 inch.",
      "Bake for 10 to 12 minutes.",
      "Remove the cookie from the oven and let cool for a few minutes.",
      "Transfer to a cooling grid to completely cool.",
      "Serve. Share and enjoy!"
    ],
    "cooking_time": "20 minutes",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/oatmeal-cookies/",
    "image_url": "",
    "image_path": "",
    "category": "Other Filipino Dishes"
  },
  {
    "title": "Homemade Mashed Potato",
    "ingredients": [
      "▢ 2 lbs. baking potatoes peeled and cubed",
      "▢ 3/4 cup fresh milk",
      "▢ 3 tablespoons butter melted",
      "▢ 2 teaspoons salt",
      "▢ 3 to 4 cups of water"
    ],
    "instructions": [
      "Combine potatoes, 1 teaspoon salt, and water in a cooking pot and bring to a boil. Cook for 8 to 12 minutes or until the potatoes are tender.",
      "Turn off the heat and drain the water by placing the potatoes in a colander.",
      "Transfer the potatoes in a large mixing bowl then add the remaining 1 teaspoon of salt. Mash using an electric mixer. You may also use fork or potato ricer for this procedure.",
      "Pour-in the melted butter then mix again until everything is well incorporated.",
      "Gradually add the fresh milk while mixing; continue mixing until all the ingredients are well distributed.",
      "Transfer to a serving plate and top with KFC Style Gravy.",
      "Serve. Share and enjoy!"
    ],
    "cooking_time": "22 minutes",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/how-to-make-mashed-potatoes-recipe/",
    "image_url": "",
    "image_path": "",
    "category": "Other Filipino Dishes"
  },
  {
    "title": "KFC Style Gravy Recipe",
    "ingredients": [
      "▢ 3 tablespoons butter or vegetable shortening",
      "▢ 5 tablespoons all-purpose flour",
      "▢ 1 piece chicken cube",
      "▢ 2  cups water"
    ],
    "instructions": [
      "Heat a saucepan and put-in the butter. Let the butter melt under low heat.",
      "Add 2 tablespoons of all-purpose flour and cook in low heat while continuously stirring for 7 to 8 minutes or until the color turns medium brown. There is a tendency that the flour might burn when overcooked or if high heat is applied. Be extra cautious.",
      "Add the remaining flour and continue stirring.",
      "Gradually add water and chicken cube. Continuous stirring is needed to prevent lumps from forming.",
      "Put the heat to medium and bring the mixture to a boil. Cook for 5 minutes more while stirring once in a while until the texture thickens.",
      "Serve hot with fried chicken or mashed potato.",
      "Share and enjoy!"
    ],
    "cooking_time": "20 minutes",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/how-to-make-kfc-style-gravy-recipe/",
    "image_url": "",
    "image_path": "",
    "category": "Chicken Dishes"
  },
  {
    "title": "Peach Refrigerator Cake",
    "ingredients": [
      "▢ 30 ounces sliced peaches",
      "▢ 14 ounces condensed milk 1 can",
      "▢ 8 ounces table or all purpose cream",
      "▢ 8 to 12 pieces graham crackers"
    ],
    "instructions": [
      "Combine condensed milk and table cream and mix thoroughly. Refrigerate for 3 hours to thicken the mixture.",
      "Arrange a layer of graham crackers in a baking pan or any container of your choice.",
      "Pour half of the condensed milk and table cream mixture over the arranged graham crackers and spread until the crackers all well covered.",
      "Arrange some sliced peaches on top of the mixture (you may slice the peaches in half to make it thinner).",
      "Place another layer of graham crackers over the peaches.",
      "Pour-in the remaining mixture over the second layer of graham crackers and spread evenly.",
      "Top the mixture with the remaining sliced peaches.",
      "Refrigerate overnight.",
      "Serve for dessert. Share and enjoy!"
    ],
    "cooking_time": "25 minutes",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/dessert-peach-refrigerator-cake-recipe/",
    "image_url": "",
    "image_path": "",
    "category": "Other Filipino Dishes"
  },
  {
    "title": "Cheesy Broccoli Soup Recipe",
    "ingredients": [
      "▢ 2 tablespoons butter",
      "▢ 1/4 cup chopped onion",
      "▢ 1/8 teaspoon ground black pepper",
      "▢ 2 tablespoons all-purpose flour",
      "▢ 2 3/4 cups milk",
      "▢ 3/4 cups sharp cheddar cheese grated",
      "▢ 8 ounces broccoli chopped"
    ],
    "instructions": [
      "Heat a cooking pan and put-in the butter. Let the butter melt.",
      "Add-in the onions and cook until it becomes soft.",
      "Put-in the flour and stir while cooking.",
      "Pour-in the milk and let boil. Simmer for 2 minutes in medium heat.",
      "Add the ground black pepper and stir.",
      "Put-in the broccoli then cook for 3 to 5 minutes.",
      "Add the cheese and stir until it melts.",
      "Turn off the heat and transfer to a serving bowl.",
      "Serve hot. Share and enjoy!"
    ],
    "cooking_time": "25 minutes",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/how-to-make-cheesy-broccoli-soup/",
    "image_url": "",
    "image_path": "",
    "category": "Soups and Stews"
  },
  {
    "title": "Egg Pie Recipe",
    "ingredients": [
      "▢ >>Pie Crust",
      "▢ 2 1/2 cups all-purpose flour",
      "▢ 1 teaspoon salt",
      "▢ 1 cup unsalted butter chilled and cut into cubes",
      "▢ 1/4 to 1/2 cup cold water",
      "▢ 2 tablespoon granulated sugar",
      "▢ >>Filling",
      "▢ 1 3/4 cups evaporated milk",
      "▢ 3 pieces raw eggs",
      "▢ 1 piece egg white separated from the yolk",
      "▢ 1 teaspoon vanilla extract",
      "▢ 1 cup granulated sugar"
    ],
    "instructions": [
      "Create the crust by combining the flour, sugar, and salt then mix well.",
      "Add the butter in the middle and mix using a pastry mixer.",
      "Gradually pour the cold water while mixing the ingredients. Continue mixing until all the ingredients are well incorporated.",
      "Gather the dough and mold it into a ball-shaped figure.",
      "Refrigerate the dough for at least 30 minutes to harden the butter.",
      "Sprinkle flour on a clean flat surface and flatten the refrigerated dough using a rolling pin. The flattened dough should be wide enough to cover a 9 inch circular baking pan.",
      "Arrange the flattened dough on top of the baking pan and cut the extra edge using a pair of scissors.",
      "Refrigerate while doing the filling.",
      "Start making the filling by scalding the evaporated milk. This is done by heating it in the microwave oven for 2 minutes.",
      "In a large mixing bowl, combine the 3 raw eggs and the separated egg yolk then whisk.",
      "Gradually add the granulated sugar while whisking.",
      "Put-in the vanilla extract then whisk until every ingredient is properly distributed.",
      "Pour-in the scalded milk then mix thoroughly.",
      "Beat the separated egg white using an electric mixer until it forms soft peaks.",
      "Fold the processed egg white in the milk-eggs-sugar mixture.",
      "Preheat oven to 350 degrees Fahrenheit.",
      "Pour the filling mixture on the refrigerated pie crust.",
      "Bake for 15 minutes at 350 degrees Fahrenheit then lower the heat to 325 degrees Fahrenheit and continue baking for 30 to 40 minutes.",
      "Remove the egg pie from the oven and let cool.",
      "Serve for dessert. Share and enjoy!"
    ],
    "cooking_time": "50 minutes",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/filipino-egg-pie-recipe/",
    "image_url": "",
    "image_path": "",
    "category": "Other Filipino Dishes"
  },
  {
    "title": "Potato and Leek Soup Recipe",
    "ingredients": [
      "▢ 1/8 cup butter",
      "▢ 4 pieces baking potatoes diced",
      "▢ 1 medium sized onion diced",
      "▢ 1 bunch onion leeks (white portion) chopped in half inch length",
      "▢ 1 teaspoon green onion leeks minced (for garnish)",
      "▢ 4 cups chicken stock",
      "▢ 1 cup whipping cream",
      "▢ 1/2 cup fresh milk",
      "▢ Salt and pepper to taste"
    ],
    "instructions": [
      "Heat a cooking pot or saucepan and put-in the butter. Allow the butter to melt.",
      "Add the potatoes, onions, and white onion leeks. Let the vegetable cook under medium heat for at least 8 minutes (stir once in a while for the vegetables to be uniformly cooked).",
      "Add salt and pepper.",
      "Pour-in the chicken stock and let boil. Simmer for 5 to 7 minutes.",
      "Turn-off the heat and allow the mixture to cool. Put the mixture in a blender then hit the liquefy button to make the mixture smooth.",
      "Put the mixture back in the heated cooking pot then add the milk and whipping cream and stir. Cook while stirring for a couple of minutes more.",
      "Transfer to a soup bowl and garnish with minced leeks on top.",
      "Serve. Share and enjoy!"
    ],
    "cooking_time": "30 minutes",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/how-to-make-potato-and-leek-soup-recipe/",
    "image_url": "",
    "image_path": "",
    "category": "Chicken Dishes"
  },
  {
    "title": "Crispy Homemade French Fries",
    "ingredients": [
      "▢ 7 pieces baking potatoes",
      "▢ A dash of salt",
      "▢ 4 cups cooking oil"
    ],
    "instructions": [
      "Peel the potatoes. Use a vegetable peeler to save time.",
      "Slice the potatoes into long thin pieces.",
      "Soak the potatoes in ice water for 30 minutes.",
      "Drain the water and dry the potatoes using a paper towel.",
      "Deep fry the potatoes for 10 minutes or until the color turns light brown. Do not put too many potatoes in a batch as it will take more time for it to be cooked.",
      "Remove the potatoes from the deep fryer or cooking pot and allow to cool for 5 minutes.",
      "Put the fried potatoes back in the fryer and fry for another 3 minutes.",
      "Remove the fried potatoes and transfer to a plate with paper towels. Sprinkle some salt to taste.",
      "Serve. Share and enjoy!"
    ],
    "cooking_time": "45 minutes",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/how-to-make-homemade-crispy-french-fries-recipe/",
    "image_url": "",
    "image_path": "",
    "category": "Other Filipino Dishes"
  },
  {
    "title": "Pastillas de leche",
    "ingredients": [
      "▢ 2 cups powdered milk sifted",
      "▢ 1 can 14 ounces condensed milk",
      "▢ ½ cup granulated sugar sifted"
    ],
    "instructions": [
      "Place the condensed milk in a large mixing bowl.",
      "Gradually fold-in the powdered milk. The texture of the mixture will be similar to dough once all the powdered milk is completely added.",
      "Scoop some of the mixture and mold into cylinders.",
      "Roll each molded cylindrical mixture on granulated sugar.",
      "Wrap in paper or cellophane.",
      "Serve for dessert. Share and enjoy!"
    ],
    "cooking_time": "11 minutes",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/milk-candy-pastillas-de-leche-recipe/",
    "image_url": "",
    "image_path": "",
    "category": "Desserts"
  },
  {
    "title": "Lechon Paksiw Recipe",
    "ingredients": [
      "▢ 4 lbs. leftover Lechon or Lechon kawali",
      "▢ 3 cups Lechon sauce here is the link to our homemade authentic Lechon sauce recipe",
      "▢ 2 cups beef stock",
      "▢ 6 cloves garlic crushed",
      "▢ 2 large onions chopped",
      "▢ 1 teaspoon whole peppercorn",
      "▢ 8 pieces dried bay leaves",
      "▢ 1/2 cup soy sauce",
      "▢ 3/4 cups vinegar",
      "▢ 3/4 cups sugar",
      "▢ salt to taste"
    ],
    "instructions": [
      "Heat a cooking pot and pour-in the beef stock. Bring to a boil.",
      "Put-in the garlic and onions then cook until the texture becomes soft.",
      "Add the whole peppercorns, dried bay leaves, and soy sauce.",
      "Put-in the leftover Lechon and simmer for 30 to 35 minutes.",
      "Add the vinegar and bring to a boil. Simmer for 10 minutes.",
      "Add the sugar and Lechon sauce then simmer for another 5 minutes.",
      "Dash-in some salt to taste then stir.",
      "Turn off the heat and transfer to a serving plate.",
      "Serve hot with rice. Share and enjoy!"
    ],
    "cooking_time": "55 minutes",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/lechon-paksiw-recipe/",
    "image_url": "",
    "image_path": "",
    "category": "Pork Dishes"
  },
  {
    "title": "Lechon Sauce Recipe",
    "ingredients": [
      "▢ 1 1/4 cup pig liver paste use a food processor to liquefy slices of liver",
      "▢ 2/3 cup bread crumbs",
      "▢ 3/4 cup apple cider vinegar or white vinegar",
      "▢ 2 1/2 cups water",
      "▢ 2/3 cups brown sugar",
      "▢ 2 tablespoons garlic minced",
      "▢ 1/2 cup onion minced",
      "▢ 2 tablespoons bacon fat or cooking oil",
      "▢  Salt and pepper to taste"
    ],
    "instructions": [
      "Heat a pan and put-in the bacon fat or cooking oil.",
      "When the oil is hot enough, sauté the garlic and onions until the texture becomes soft.",
      "Put-in the liver paste and cook for about 5 minutes in medium heat while stirring.",
      "Add the vinegar and bring to a boil. Stir for a minute.",
      "Pour-in water and bring to a boil.",
      "Stir-in the brown sugar and cook for 2 minutes.",
      "Add the breadcrumbs and cook for another 2 minutes while stirring constantly.",
      "Add salt and pepper to taste.",
      "Turn off the heat and allow the sauce to cool down.",
      "Place the sauce in a blender then blend for a minute.",
      "Transfer the sauce in a serving bowl.",
      "Serve along with Lechon. Share and enjoy!"
    ],
    "cooking_time": "30 minutes",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/sarsa-ng-lechon-sauce-recipe/",
    "image_url": "",
    "image_path": "",
    "category": "Pork Dishes"
  },
  {
    "title": "Polvoron Recipe",
    "ingredients": [
      "▢ 4 cups all purpose flour",
      "▢ 2 cups powdered milk",
      "▢ 3/4 cup pinipig crushed",
      "▢ 1 1/8 cup butter softened",
      "▢ 1 1/2 cup granulated sugar"
    ],
    "instructions": [
      "Heat a frying pan or a wok then put-in the flour. Toast the flour until you smell the aroma and the color turns light brown. Make sure to stir while toasting to prevent the flour from being burnt.",
      "Once the flour is toasted, let it cool down for about 20 minutes then transfer to a mixing bowl.",
      "Add the powdered milk then stir using a balloon whisk.",
      "Put-in the granulated sugar then stir again.",
      "Add-in the crushed pinipig then stir until very ingredient is well distributed.",
      "Pour-in the softened butter and mix well. You may use your clean hands in doing the procedure. After mixing, let it stand for at least 10 minutes to allow the butter to cool. This will make the mixture more intact.",
      "Using a polvoron molder, scoop the mixture and put it on top of a pre-cut Japanese paper or cellophane then wrap.",
      "Serve. Share and enjoy!"
    ],
    "cooking_time": "17 minutes",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/dessert-candy-polvoron-recipe/",
    "image_url": "",
    "image_path": "",
    "category": "Other Filipino Dishes"
  }
]