[
  {
    "title": "Longanisa Lumpiang Shanghai",
    "ingredients": [
      "▢ 1 ½ lb. ground pork",
      "▢ 2 pieces longanisa",
      "▢ 1 piece Knorr Pork Cube",
      "▢ 1 piece carrot minced",
      "▢ ¾ cup green onion chopped",
      "▢ ¾ cup singkamas minced",
      "▢ 1 piece onion minced",
      "▢ ¼ teaspoon garlic powder",
      "▢ 1 piece egg",
      "▢ 1 ½ teaspoons salt",
      "▢ ½ teaspoon ground black pepper",
      "▢ 20 pieces lumpia wrapper",
      "▢ 2 cups cooking oil",
      "▢ 4 tablespoons sugar",
      "▢ ¼ teaspoon soy sauce optional",
      "▢ 2 1/2 tablespoons tomato ketchup",
      "▢ 1/3 cup white vinegar",
      "▢ 1 teaspoon cornstarch dissolved in 7 teaspoons of water"
    ],
    "instructions": [
      "Combine ground pork and longanisa. Add carrot, onion, singkamas, and green onion. Season with garlic powder, salt, and ground black pepper. Mix well.1 ½ lb. ground pork, 2 pieces longanisa, 1 piece carrot, ¾ cup green onion, ¾ cup singkamas, 1 piece onion, 1 ½ teaspoons salt, ½ teaspoon ground black pepper, ¼ teaspoon garlic powder",
      "Grate a piece of Knorr Pork Cube using a cheese grater. Add egg. Mix until all ingredients are well blended.1 piece Knorr Pork Cube, 1 piece egg",
      "Scoop a tablespoon of mixture. Place it on a piece of lumpia wrapper. Secure the filling by wrapping. Note: see video below for guidance.20 pieces lumpia wrapper",
      "Heat oil in a deep pot or deep fryer. Deep-fry the lumpia for to 12 minutes using medium heat (320F).2 cups cooking oil",
      "Once the lumpia turns golden brown, remove from the fryer. Set aside.",
      "Make the sweet and sour sauce by combining sugar, ketchup, soy sauce, and vinegar in a pot. Apply heat and boil. Pour cornstarch and water mixture. Stir until thick. Set aside.4 tablespoons sugar, ¼ teaspoon soy sauce, 2 1/2 tablespoons tomato ketchup, 1/3 cup white vinegar, 1 teaspoon cornstarch dissolved in 7 teaspoons of water",
      "Arrange the lumpia is a serving plate. Serve with sweet and sour sauce. Share and enjoy!"
    ],
    "cooking_time": "N/A",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/longanisa-lumpiang-shanghai/",
    "image_url": "",
    "image_path": "",
    "category": "Vegetable Dishes"
  },
  {
    "title": "Pork Barbecue",
    "ingredients": [
      "▢ 3 lbs. pork shoulder sliced into thin pieces",
      "▢ 2 sachets Knorr SavorRich Pork Liquid Seasoning",
      "▢ 2 tablespoons brown sugar",
      "▢ ½ cup banana ketchup",
      "▢ 3 pieces calamansi",
      "▢ 6 cloves garlic crushed",
      "▢ ½ cup soy sauce",
      "▢ ½ teaspoon ground black pepper"
    ],
    "instructions": [
      "Arrange pork slices in a large bowl. Add Knorr SavorRich, soy sauce, ketchup, sugar, garlic, and ground black pepper. Mix well. Cover and refrigerate for at least 3 hours. Note: marinating the meat longer will provide better results.",
      "Skewer the marinated meat on a bamboo skewer (also called barbecue stick). Set aside.",
      "Heat-up the grill. Start to grill the pork barbecue for 3 to 5 minutes per side. Continue this step until pork is thoroughly cooked. Note: baste with a mixture of soy sauce, banana ketchup, and vegetable oil after turning the barbecue over.",
      "Serve with warm rice and a dip of spicy vinegar. Enjoy!"
    ],
    "cooking_time": "N/A",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/pork-barbecue/",
    "image_url": "",
    "image_path": "",
    "category": "Pork Dishes"
  },
  {
    "title": "Chicken and Pork Embutido",
    "ingredients": [
      "▢ 1 lb. ground chicken",
      "▢ 1 lb. ground pork",
      "▢ ¾ cup Lady’s Choice Mayonnaise",
      "▢ ¾ cup sweet pickle relish",
      "▢ 1 cup raisins",
      "▢ ¾ cup breadcrumbs",
      "▢ 1 piece carrot  minced",
      "▢ 1 piece onion minced",
      "▢ 2 pieces eggs raw",
      "▢ ¼ teaspoon ground black pepper",
      "▢ 2 teaspoons salt",
      "▢ 5 pieces hotdogs cooked and sliced",
      "▢ 5 pieces eggs hard-boiled, sliced into wedges"
    ],
    "instructions": [
      "Combine ground chicken and pork in a mixing bowl. Mix well.",
      "Add sweet relish, raisin, onion, and carrot, and Lady’s Choice Mayonnaise. Mix all together.",
      "Crack the eggs into the bowl. Add salt and ground black pepper. Continue to mix until well blended.",
      "Gradually add breadcrumbs. Fold until mixture has the proper consistency. Note: add more breadcrumbs if mixture is still wet.",
      "Lay a piece of 12 x 8 inches of aluminum foil on a flat surface. Scoop around ¾ cups of meat mixture and spread it on the foil. Arrange hotdog and egg slices side-by-side. Roll the foil to cover the filling. Tighten and secure by twisting the ends of the foil (see video for details). Perform these steps until all meat mixture are consumed.",
      "Boil 1 1/2 quarts water. Arrange the wrapped embutido in a steamer. Steam for 1 hour.",
      "Remove the embutido from the steamer. Let it cool down for 30 minutes. Refrigerate for at least 3 hours before serving. Share and enjoy!"
    ],
    "cooking_time": "N/A",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/chicken-and-pork-embutido/",
    "image_url": "",
    "image_path": "",
    "category": "Pork Dishes"
  },
  {
    "title": "Sizzling Crispy Sisig",
    "ingredients": [
      "▢ 1 ½ lbs. pork belly boiled for 1 hour",
      "▢ ½ cup Lady’s Choice Mayonnaise",
      "▢ 2 pieces onion chopped",
      "▢ 4 pieces Thai chili pepper chopped",
      "▢ 2 pieces long green pepper chopped",
      "▢ 16 grams Knorr SavorRich Pork equivalent to 1 sachet",
      "▢ ½ teaspoon ground black pepper",
      "▢ 2 tablespoons soy sauce",
      "▢ ¼ cup margarine",
      "▢ 2 cups cooking oil"
    ],
    "instructions": [
      "Heat oil in a deep cooking pot or deep fryer. Fry the boiled pork belly until golden brown and crispy. Chop the crispy pork belly into small pieces. Set aside.",
      "Heat half of the margarine in a pan. Sauté half of the onions until soft. Add chopped pork. Saute for 30 seconds.",
      "Add Knorr SavorRich. Stir and then add chili peppers and season with ground black pepper and soy sauce. Cook for 1 minute.",
      "Add Lady’s Choice Mayonnaise. Stir and add remaining onion. Set aside.",
      "Heat a metal plate (sizzling plate) on a stovetop. Melt remaining margarine. Transfer the crispy pork sisig into the metal plate. Let it stay for 30 seconds.",
      "Serve with warm rice and your favorite beverage. Enjoy!"
    ],
    "cooking_time": "N/A",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/sizzling-crispy-sisig/",
    "image_url": "",
    "image_path": "",
    "category": "Pork Dishes"
  },
  {
    "title": "Kare-Kare Recipe (Beef Tripe)",
    "ingredients": [
      "▢ 2 lbs. beef tripe sliced",
      "▢ 1 piece Knorr Beef Cube",
      "▢ 1 bunch baby bok choy",
      "▢ 15 pieces snake beans cut into 2-inch pieces",
      "▢ 1 piece Chinese eggplant sliced",
      "▢ 1 ½ cup peanut processed until smooth and creamy",
      "▢ ½ cup annatto seeds",
      "▢ 1 piece onion minced",
      "▢ 5 cloves garlic minced",
      "▢ 1 ½ tablespoons glutinous rice flour",
      "▢ 6 cups water",
      "▢ 3 tablespoons cooking oil",
      "▢ Ground black pepper and shrimp paste bagoong alamang to taste"
    ],
    "instructions": [
      "Combine 4 cups water and tripe in a pot. Boil for 1 hour. Discard water and set the tripe aside.",
      "Boil 1 ½ cups water in a small pot. Add annatto seeds. Continue to boil for 2 minutes. Set aside.",
      "Heat oil in a pot. Saute onion and garlic until onion softens.",
      "Add tripe. Saute for 1 minute.",
      "Pour annatto water into the pot while filtering using a kitchen sieve. Let boil.",
      "Add Knorr Beef Cube. Stir and then add peanut paste. Pour remaining water. Boil for 8 minutes.",
      "Combine rice flour and ¼ cup water. Stir until blended. Pour mixture into the pot. Stir and continue to cook until the texture of the sauce thickens based on your preference.",
      "Add snake beans and eggplant. Cook for 5 minutes.",
      "Add baby bok choy or pechay. Cook for 1 minute.",
      "Season with ground black pepper.",
      "Serve with bagoong alamang over warm rice."
    ],
    "cooking_time": "N/A",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/kare-kare-recipe-beef-tripe/",
    "image_url": "",
    "image_path": "",
    "category": "Vegetable Dishes"
  },
  {
    "title": "No-Bake Filipino Style Lasagna",
    "ingredients": [
      "▢ 9 pieces lasagna",
      "▢ 3/4 cup cheddar cheese shredded",
      "▢ Water for boiling lasagna",
      "▢ 3/4 lb ground pork",
      "▢ 3 pieces hotdog sliced",
      "▢ 15 ounces tomato sauce",
      "▢ 1 cup water",
      "▢ 1 piece onion chopped",
      "▢ 4 cloves garlic minced",
      "▢ 3 tablespoons cooking oil",
      "▢ 1 tablespoon sugar",
      "▢ Salt and ground black pepper to taste",
      "▢ 1/4 cup salted butter",
      "▢ 2 cups fresh milk",
      "▢ 3 1/2 tablespoons all-purpose flour",
      "▢ 1/2 cup cheddar cheese shredded"
    ],
    "instructions": [
      "Prepare the meat sauce by heating oil in a cooking pot.",
      "Saute onion and garlic until onion softens.",
      "Add ground pork. Cook until it turns light brown.",
      "Put the hotdog into the pot and saute with the rest of the ingredients for 1 minute.",
      "Pour tomato sauce and water. Let boil. Cover and cook between low to medium heat for 40 minutes.",
      "Add sugar and season with ground black pepper and salt. Set aside.",
      "Boil around 1 ¼ pint water in a cooking pot. Add ½ teaspoon salt. Put the lasagna in boiling water and continue to boil based on the package instructions. Note: I boiled the lasagna for 10 minutes as indicated in the carton instructions. Drain the water. Set lasagna aside.",
      "Prepare the white sauce by melting butter in a saucepan. Add half of the flour. Stir until blended. Add remaining flour and continue to stir. Gradually pour milk while stirring until the white sauce thickens. Add ½ cup cheddar cheese. Stir until melted.",
      "Assemble the lasagna by spreading meat sauce on an 8x8 baking pan. Layer the lasagna and then spread meat sauce over the lasagna. Spread the white sauce next and sprinkle some shredded cheese on top. Arrange the second layer of lasagna and top with meat sauce, white sauce, and cheese in the order mentioned. Arrange the third layer of lasagna. Top with white sauce first followed by the meat sauce. Sprinkle cheese all over.",
      "Cover the pan with aluminum foil. Note: Make sure that the foil does not touch the toppings of the lasagna. Place in a turbo broiler. Broil in 400F for 35 minutes. Remove the foil, set the temp to 350F and continue to broil for 12 minutes.",
      "Remove the lasagna from the broiler. Slice and serve."
    ],
    "cooking_time": "N/A",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/no-bake-filipino-style-lasagna/",
    "image_url": "",
    "image_path": "",
    "category": "Pork Dishes"
  },
  {
    "title": "Yang Chow Fried Rice Recipe",
    "ingredients": [
      "▢ 6 cups cooked white rice refrigerated overnight",
      "▢ 1 cup barbecued pork chopped",
      "▢ 1 1/2 tablespoons soy sauce",
      "▢ 2 teaspoons salt",
      "▢ 8 to 10 pieces shrimps shelled and deveined",
      "▢ 3/4 cup green peas",
      "▢ 1/4 cup green onion chopped",
      "▢ 2 pieces raw eggs beaten",
      "▢ 1 teaspoon sugar",
      "▢ 1 teaspoon ginger minced",
      "▢ 1 teaspoon garlic minced",
      "▢ 3 tablespoons cooking oil"
    ],
    "instructions": [
      "Heat cooking oil and sauté ginger and garlic.",
      "Add shrimps and cook for a minute. Remove the shrimps and set aside.",
      "Pour-in the beaten egg mixture and cook.",
      "When the egg is cooked, divide into small pieces. Add the rice and mix well.",
      "Put-in the soy sauce, sugar, and salt. Mix with the other ingredients.",
      "Add barbecued pork. Cook for 3 minutes.",
      "Add green peas and shrimp. Cook for another 3 minutes.",
      "Put-in the green onions. Cook for 2 minutes while mixing with the other ingredients.",
      "Turn the heat off and then transfer to a serving plate.",
      "Serve. Share and enjoy!"
    ],
    "cooking_time": "35 minutes",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/yang-chow-fried-rice/",
    "image_url": "",
    "image_path": "",
    "category": "Pork Dishes"
  },
  {
    "title": "Quick and Easy Fried Chicken",
    "ingredients": [
      "▢ 1 ½ lbs. chicken drumsticks",
      "▢ 16 ml Knorr SavorRich Chicken Liquid Seasoning",
      "▢ ½ cup all-purpose flour",
      "▢ 5 tablespoons soy sauce",
      "▢ 2 pieces calamansi",
      "▢ 1/8 teaspoon ground black pepper",
      "▢ 2 cups cooking oil"
    ],
    "instructions": [
      "Create slits on the chicken drumsticks by slicing all the way to the bone.",
      "Place the chicken inside a resealable bag. Add soy sauce, calamansi juice, Knorr SavorRich, and ground black pepper. Seal the bag and then shake until all ingredients are well blended. Push the air out of the bag and seal again. Marinate for 10 minutes.",
      "Heat oil in a pot.",
      "Place the flour in a container with cover. Put the marinated chicken in the container (one to two pieces at a time). Cover and shake until the chicken get completely coated with flour. Shake-off excess flour.",
      "Deep-fry the chicken for 14 minutes.",
      "Remove from the pot and let the chicken rest for 5 minutes.",
      "Serve with rice or any of your favorite side dishes."
    ],
    "cooking_time": "N/A",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/quick-and-easy-fried-chicken/",
    "image_url": "",
    "image_path": "",
    "category": "Chicken Dishes"
  },
  {
    "title": "Chicken Alfredo Recipe",
    "ingredients": [
      "▢ 12 ounces boneless chicken breast",
      "▢ 1 piece Knorr Chicken Cube",
      "▢ 1 lb. fettuccine cooked according to package instructions",
      "▢ 2 cups heavy cream",
      "▢ ¾ cup Parmesan cheese grated",
      "▢ 6 tablespoons butter",
      "▢ 2 tablespoons parsley chopped",
      "▢ Salt and ground black pepper to taste",
      "▢ 2 tablespoons olive oil"
    ],
    "instructions": [
      "Cook fettuccine according to package instructions. Drain water and set aside.",
      "Season chicken with salt and pepper. Let it stay for 10 minutes.",
      "Melt 3 tablespoons butter in a pan. Add olive oil.",
      "Pan-fry chicken for 3 minutes per side. Remove chicken from the pan. Slice into serving pieces. Set aside.",
      "Melt the remaining butter in the pan. Pour heavy cream. Stir and let boil.",
      "Add Knorr Chicken Cube. Put the Parmesan cheese into the pan along with the chicken. Cook for 2 minutes.",
      "Add fettucine. Toss. Add parsley and season with ground black pepper.",
      "Serve warm. Share and enjoy!"
    ],
    "cooking_time": "N/A",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/chicken-alfredo-recipe/",
    "image_url": "",
    "image_path": "",
    "category": "Chicken Dishes"
  },
  {
    "title": "Pinoy Style Baked Macaroni with White Sauce",
    "ingredients": [
      "▢ 1 lb. elbow macaroni",
      "▢ 1 piece Knorr Beef Cube",
      "▢ ½ lb. ground beef",
      "▢ ½ lb. ground pork",
      "▢ ½ cup red bell pepper chopped",
      "▢ ½ cup green bell pepper chopped",
      "▢ 15 ounces tomato sauce",
      "▢ 1 piece onion",
      "▢ 4 cloves garlic chopped",
      "▢ 2 teaspoons sugar",
      "▢ Salt and ground black pepper to taste",
      "▢ 3 tablespoons cooking oil",
      "▢ ¾ cup water",
      "▢ ¼ cup butter salted",
      "▢ 2 cups milk",
      "▢ 3 ½ tablespoons all-purpose flour",
      "▢ ¾ cups cheddar cheese shredded"
    ],
    "instructions": [
      "Prepare the macaroni by cooking according to package instructions. Drain the liquid and set the macaroni aside.",
      "Make the meat sauce. Heat oil in a pan. Sauté onion and garlic. Once onion softens, sauté ground beef and ground pork until it browns.  Add hotdog and bell peppers. Cook for 1 minute.",
      "Add Knorr Beef cube. Stir and then pour tomato sauce and water. Cover the pot and boil for 20 to 25 minutes using low to medium heat. Note: add more water if needed. Season with sugar, salt, and ground black pepper. Set aside.",
      "Make the white sauce by melting butter in a saucepan. Add all-purpose flour. Stir and cook for 1 minute. Gradually pour milk while stirring.  Add half of the cheese. Stir and continue cooking until the sauce thickens.",
      "Combine macaroni and meat sauce in a bowl. Add the remaining cheese. Toss.",
      "Preheat oven to 350F. Transfer the macaroni with meat sauce in a baking pan. Pour white sauce on top and then spread evenly.",
      "Bake for 15 to 20 minutes.",
      "Serve. Share and enjoy!"
    ],
    "cooking_time": "N/A",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/pinoy-style-baked-macaroni-with-white-sauce/",
    "image_url": "",
    "image_path": "",
    "category": "Pork Dishes"
  },
  {
    "title": "Chicken and Egg Macaroni Salad",
    "ingredients": [
      "▢ 6 ounces boneless chicken breast",
      "▢ 1 1/2 cups Lady’s Choice Mayonnaise",
      "▢ 2 cups elbow macaroni",
      "▢ 3/4 cups raisins",
      "▢ 5 ounces cheddar cheese cubed",
      "▢ 1/2 cup pineapple chunks optional",
      "▢ 3 pieces eggs boiled and cubed",
      "▢ 1 piece onion minced",
      "▢ 3 tablespoons parsley chopped",
      "▢ 1/2 teaspoon sugar",
      "▢ 1/4 teaspoon ground black pepper",
      "▢ 1/4 teaspoon salt"
    ],
    "instructions": [
      "Combine 5 cups water and chicken in a cooking pot. Let the liquid boil. Continue to cook the chicken for 15 to 18 minutes using medium heat. Remove the chicken from the pot. Let it cool down and then slice into cubes. Set aside.",
      "Cook macaroni according to package instructions using the remaining water. Drain water and place macaroni on a large bowl.",
      "Make the salad dressing by combining Lady’s Choice Mayonnaise, onion, sugar, salt, and ground black pepper. Stir until well blended. Set aside.",
      "Combine cooked macaroni, cheese, raisins, pineapple, and chicken. Toss.",
      "Add eggs and salad dressing. Continue to toss until all ingredients are well distributed.",
      "Sprinkle the chopped parsley. Toss. Refrigerate the salad for at least 1 hour.",
      "Transfer to a serving bowl. Serve. Share and enjoy!"
    ],
    "cooking_time": "N/A",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/chicken-and-egg-macaroni-salad/",
    "image_url": "",
    "image_path": "",
    "category": "Chicken Dishes"
  },
  {
    "title": "Pinoy Fried Chicken Recipe",
    "ingredients": [
      "▢ 2 lbs. chicken drumstick",
      "▢ 32 grams Knorr SavorRich Chicken Liquid seasoning",
      "▢ 3 tablespoons cooking wine (or rhum)",
      "▢ 1 teaspoon ground nutmeg",
      "▢ 1 teaspoon onion powder",
      "▢ 1 tablespoon patis",
      "▢ 2 cups cooking oil"
    ],
    "instructions": [
      "Combine chicken, onion powder, nutmeg, cooking wine, patis, and Knorr SavorRich. Mix well and make sure that the chicken gets completely coated. Transfer everything to a resealable bag. Seal the bag and marinate overnight inside the refrigerator.",
      "Arrange the marinated chicken drumsticks on a steamer. Boil water and steam the chicken for 45 minutes.",
      "Remove the chicken from the steamer. Arrange over a wire rack. Air dry for 1 hour.",
      "Heat oil in a cooking pot or deep fryer. Fry the chicken until color turns golden brown.",
      "Arrange on a serving plate. Serve with banana ketchup. Serve and enjoy!"
    ],
    "cooking_time": "N/A",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/pinoy-fried-chicken-recipe/",
    "image_url": "",
    "image_path": "",
    "category": "Chicken Dishes"
  }
]