[
  {
    "title": "Grilled Isaw (Intestine) Recipe",
    "ingredients": [
      "▢ 1 lb pig's large intestine well cleaned",
      "▢ 1/2 cup vinegar",
      "▢ 2 tbsp whole pepper corn",
      "▢ 2 tbsp salt",
      "▢ 4 to 6 pieces dried bay leaves",
      "▢ 4 cups water"
    ],
    "instructions": [
      "Pour the water in a cooking pot and bring to a boil.",
      "Put-in the salt, whole pepper corn, and dried bay leaves",
      "Add the large intestines then simmer for a few minutes",
      "Add vinegar then simmer until the intestines are tender (about 30 minutes). Set aside until the temperature goes down.",
      "Cut the intestines crosswise (about 1 inch in length)",
      "Skewer the intestine (about 3 to 4 pieces per skewer)",
      "Grill the intestine while basting with the mixture of cooking oil, banana catsup, and soy sauce",
      "Serve with vinegar and chili dip"
    ],
    "cooking_time": "1 hour",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/filipino-street-food-inihaw-bituka-grilled-isaw-recipe/",
    "image_url": "",
    "image_path": "",
    "category": "Street Food"
  },
  {
    "title": "Buchi Recipe",
    "ingredients": [
      "▢ 1 1/2 cups sweet rice flour",
      "▢ 3/4 cup water",
      "▢ 1/4 cup sweet red bean paste",
      "▢ 1/2 cup sesame seeds",
      "▢ 2 to 3 cups cooking oil"
    ],
    "instructions": [
      "In a mixing bowl, combine the sweet rice flour and water then mix wel (This should form a dough).",
      "Separate the dough into individual pieces",
      "Roll each individual piece of dough until a spherical (round) shape is formed",
      "Press the center of the spherical dough until the shape becomes concave (there should be a hollow spot in the center).",
      "Scoop the sweet red bean paste using an ordinary teaspoon or measuring spoon then fill it in the hollow space of the dough (amount is up to you, just don't overfill).",
      "Seal the dough and roll it once more until the shape is spherical",
      "Place the sesame seeds in a bowl then roll the sphere shaped dough over it. Make sure that the seeds stick on the dough",
      "Heat the pan and pour-in the cooking oil.",
      "When the cooking oil is very hot, deep fry the dough until the sesame seed's color turns golden brown (about 2 to 3 minutes)",
      "Remove the cooked buchi from the pan and drain excess oil.",
      "Serve and Enjoy!"
    ],
    "cooking_time": "22 minutes",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/asian-recipe-rice-ball-mochiko-butsi-buchi-recipe/",
    "image_url": "",
    "image_path": "",
    "category": "Other Filipino Dishes"
  },
  {
    "title": "Cashew Chicken Recipe",
    "ingredients": [
      "▢ 1 lb boneless chicken breast cut into thin slices",
      "▢ 1 piece raw egg beaten",
      "▢ 1 cup cornstarch",
      "▢ 1 piece onion sliced",
      "▢ 1/2 cup red bell pepper cut into strips",
      "▢ 1 1/2 cups broccoli cut into bite sized pieces",
      "▢ 2 tbsp soy sauce",
      "▢ 2 tbsp cooking rice wine",
      "▢ 1 tbsp oyster sauce",
      "▢ 1/2 cup cashew nuts roasted",
      "▢ 1/2 cup green onions sliced",
      "▢ 1/4 cup cooking oil"
    ],
    "instructions": [
      "Beat the egg and pour-over the chicken then mix well until properly distributed",
      "Heat the pan and pour the cooking oil",
      "Dip the chicken (coated with egg) in corn starch and stir fry until the color of the chicken turns golden brown. Set aside",
      "In the same pan, add some cooking oil and allow to heat-up",
      "Stir-fry the onion, red bell pepper, and broccoli",
      "Add the cooking rice wine, soy sauce, and oyster sauce then allow to cook for a few minutes",
      "Add the stir-fried chicken and cook for 2 minutes while mixing with the rest of the ingredients",
      "Add the cashew nuts,green onion, salt, and ground black pepper",
      "Serve hot. Share and Enjoy!"
    ],
    "cooking_time": "35 minutes",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/asian-chinese-filipino-food-stir-fry-cashewed-chicken-recipe/",
    "image_url": "",
    "image_path": "",
    "category": "Chicken Dishes"
  },
  {
    "title": "Chili Crab Recipe",
    "ingredients": [
      "▢ 2 lbs crab cut in half",
      "▢ 2 tbsp cooking oil",
      "▢ 2 tbsp garlic minced",
      "▢ 3 tbsp ginger minced",
      "▢ 1 tbsp crushed red pepper or 3 pieces sliced red chili",
      "▢ 2 tbsp hoisin sauce",
      "▢ 1/2 cup tomato catsup or tomato sauce",
      "▢ 1/4 cup sweet chili sauce",
      "▢ 2 tbsp fish sauce",
      "▢ 1/2 tsp sesame oil",
      "▢ 1/4 cup water",
      "▢ 3 tbsp green onions or scallions thinly sliced crosswise"
    ],
    "instructions": [
      "Heat a cooking pot and pour the cooking oil",
      "Saute the garlic, ginger, and crushed red pepper",
      "Add the crab and cook for 3 to 4 minutes",
      "Put-in the hoisin sauce, tomato ketchup, sweet chili sauce, fish sauce,and sesame oil then mix with the other ingredients",
      "Pour-in the water and bring to a boil then simmer for 10 to 15 minutes or until the sauce gets thick",
      "Garnish with green onions on top",
      "Serve hot. Share and Enjoy!"
    ],
    "cooking_time": "40 minutes",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/spicy-asian-food-chili-crab-dish-recipe/",
    "image_url": "",
    "image_path": "",
    "category": "Seafood"
  },
  {
    "title": "Easy Steamed Fish Recipe",
    "ingredients": [
      "▢ 1 piece Grouper lapu-lapu fish, cleaned, scales removed, and salted",
      "▢ 1 piece lemon or dayap",
      "▢ 1/4 cup lemon juice",
      "▢ 1/4 cup sugar",
      "▢ 1/4 cup cilantro",
      "▢ 3 tablespoon ginger cut into strips",
      "▢ 1 teaspoon lemon zest either grated or thinly sliced",
      "▢ 1/2 cup water"
    ],
    "instructions": [
      "Place the fish over an aluminum foil (the foil must be large enough to cover the entire fish)",
      "Stuff the fish with slices of lemon and 2 tbsp ginger strips then securely close the foil.",
      "Place the foil with fish in a steamer and steam for 20 to 30 minutes (this will depend on the size of the fish)",
      "While steaming, heat a saucepan and put-in the lemon juice.",
      "Add the sugar and stir until it fully dissolves in the lemon juice.",
      "Add water and bring to a boil.",
      "Put-in the lemon zest and 1 tbsp ginger strips then simmer until sauce becomes somewhat thick",
      "Remove the fish from the steamer and aluminum foil cover and place in a serving plate.",
      "Pour over the sauce and garnish with cilantro",
      "Serve hot. Share and enjoy."
    ],
    "cooking_time": "40 minutes",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/asian-food-dish-steamed-fish-lapu-lapu-recipe/",
    "image_url": "",
    "image_path": "",
    "category": "Seafood"
  },
  {
    "title": "Pichi-Pichi Recipe",
    "ingredients": [
      "▢ 2 cups cassava grated",
      "▢ 1 cup sugar",
      "▢ 2 cups water",
      "▢ 1 cup coconut grated",
      "▢ 1/2 tsp lye water",
      "▢ 1/2 tsp buko-pandan essence"
    ],
    "instructions": [
      "In a mixing bowl, combine cassava, sugar, and water then mix thoroughly",
      "Add lye water while continuously stirring the mixture",
      "Put-in the buko-pandan essence then mix again",
      "Once the mixture is evenly distributed, pour in individual cup molds and place in a steamer",
      "Steam the mixture for 45 minutes to 1 hour (or until the color turns translucent)",
      "Allow the steamed pichi-pichi to cool down (at least 40 minutes to 1 hour ; you can even place it in the fridge after letting it cool down at least 15 minutes) then remove from the molds",
      "Roll the each piece over the grated coconut",
      "Place in a serving plate then serve. Share and Enjoy!"
    ],
    "cooking_time": "1 hour",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/filipino-asian-dessert-cassava-pichi-pichi-recipe/",
    "image_url": "",
    "image_path": "",
    "category": "Other Filipino Dishes"
  },
  {
    "title": "Garlic Fried Rice",
    "ingredients": [
      "▢ 6 cups rice steamed",
      "▢ 3 tbsp garlic minced",
      "▢ 2 tsp salt",
      "▢ 3 tbsp cooking oil"
    ],
    "instructions": [
      "Combine rice and salt then mix well.",
      "Heat the pan and pour the cooking oil.",
      "When the oil is hot enough, put-in the garlic and cook until color turns brown and texture is crispy",
      "Add half of the rice. Mix the rice well with the garlic while frying. (this is applicable for large rice quantities. If you are frying less than 4 cups of rice then you can put all the rice at once assuming that your pan is large enough to handle the volume)",
      "Add the remaining half then cook for 5 minutes or until the rice is done.",
      "Remove from the pan and place in a serving plate. Garnish with fried garlic on top.",
      "Serve hot with your favorite main dish. Share and Enjoy!",
      "Number of servings (yield): 6"
    ],
    "cooking_time": "25 minutes",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/how-to-cook-garlic-fried-steamed-rice-dish-recipe/",
    "image_url": "",
    "image_path": "",
    "category": "Other Filipino Dishes"
  },
  {
    "title": "Kwek – Kwek Recipe (Fried Orange Quail Eggs)",
    "ingredients": [
      "▢ 12 to 18 pieces boiled quail eggs",
      "▢ 1 cup flour",
      "▢ 3 tbsp cornstarch",
      "▢ 3/4 to 1 cup water",
      "▢ 1 tbsp anatto powder pinulbos na atsuete",
      "▢ 1/2 tsp salt",
      "▢ 1/2 tsp ground black pepper",
      "▢ 2 cups cooking oil"
    ],
    "instructions": [
      "Place the cornstarch in a container and dredge the boiled quail eggs. Set aside.",
      "In a mixing bowl, combine flour, salt, and pepper then mix thoroughly.",
      "Dilute the anatto powder in warm water then pour-in the mixing bowl with the other ingredients. Mix well.",
      "Place all the quail eggs in the mixing bowl and coat with the batter.",
      "Heat the pan and pour the cooking oil.",
      "When the oil is hot enough, deep-fry the quail eggs by scooping them from the mixing bowl using a spoon. Make sure that each is coated with batter.",
      "After a few minutes, remove the fried quail eggs from the pan and place in a serving plate.",
      "Serve with vinegar or fish ball sauce while still crispy.",
      "Share and Enjoy!"
    ],
    "cooking_time": "10 minutes",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/pinoy-street-food-orange-egg-tokneneng-qwek-kwek-kwek-recipe/",
    "image_url": "",
    "image_path": "",
    "category": "Street Food"
  },
  {
    "title": "Champorado Recipe",
    "ingredients": [
      "▢ 8 tbsp cocoa powder or about 4 pieces tableya",
      "▢ 1 cup glutinous rice malagkit",
      "▢ 1/2 cup sugar",
      "▢ 3 1/2 cups water",
      "▢ condensed milk optional"
    ],
    "instructions": [
      "Pour 2 1/2 cups of water in a pot and bring to a boil",
      "Put-in the glutinous rice and allow water to re-boil for a few minutes",
      "Dilute the cocoa powder in 1 cup warm water then pour-in the pot. Stir continuously",
      "Once the glutinous rice is cooked (about 12 to 18 minutes of cooking with constant stirring), add the sugar and cook for another 5 minutes or until the texture becomes thick.",
      "Remove from the pot and place in a serving bowl.",
      "Serve hot with a swirl of condensed milk on top."
    ],
    "cooking_time": "30 minutes",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/filipino-food-tsampurado-champorado-champurado-chocolate-rice-porridge-recipe/",
    "image_url": "",
    "image_path": "",
    "category": "Rice Dishes"
  },
  {
    "title": "Kutsinta Recipe",
    "ingredients": [
      "▢ 1 1/2 cup rice flour",
      "▢ 1/2 cup all-purpose flour",
      "▢ 1 cup brown sugar",
      "▢ 3 cups water",
      "▢ 1 1/2 tsp lye water",
      "▢ 2 tsp anatto seeds"
    ],
    "instructions": [
      "In a mixing bowl, combine all the dry ingredients starting from the rice flour, all-purpose flour, and brown sugar then mix all the ingredients.",
      "While mixing, add water gradually and continue to mix until all ingredients are completely distributed.",
      "Add lye water and anatto water (soak the anatto seed in 3 tbsp water) then continue mixing.",
      "Place the mixture into individual molds and steam for 40 minutes to an hour.",
      "Serve with grated or shredder coconut on top. Share and Enjoy!"
    ],
    "cooking_time": "1 hour",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/filipino-food-kakanin-cuchinta-kutsinta-recipe/",
    "image_url": "",
    "image_path": "",
    "category": "Other Filipino Dishes"
  },
  {
    "title": "Ensaymada Recipe",
    "ingredients": [
      "▢ 5 cups all-purpose flour",
      "▢ ¾  cup butter melted",
      "▢ ¾ cup white sugar",
      "▢ 1 tsp salt",
      "▢ 1 cup grated cheddar cheese",
      "▢ 3 pieces raw eggs",
      "▢ 1 pouch rapid rise yeast about 2 ¼ tsp",
      "▢ 1 cup fresh milk warm"
    ],
    "instructions": [
      "Combine warm milk, yeast, and ½ cup sugar and stir until yeast and sugar dissolves in milk. Set aside to let yeast activate (approximately 10 minutes)",
      "In a mixing bowl, combine all the dry ingredients starting from the flour, sugar, and salt then mix thoroughly.",
      "Add the eggs, 1/2  cup butter, and activated yeast mixture (these are the ingredients that we combined in number 1) to the mixed dry ingredients. Mix thoroughly until all ingredients are evenly distributed and a dough is formed.",
      "Knead the dough until texture becomes fine.",
      "Put the dough back on the mixing bowl and cover the top with cloth. Allow the dough to rise for 2 hours.",
      "Put the dough on a flat surface and flatten. Punch the dough lightly to release the air inside.",
      "Using a dough slicer, divide the dough into four pieces.",
      "Roll each piece until shape becomes cylindrical.",
      "Cut the cylindrical dough into individual serving pieces (1 serving piece should weigh at least 80 grams).",
      "Put the sliced individual serving piece in a flat surface and flatten using a rolling pin.",
      "Combine ¼ cup melted butter with ¼ cup white sugar. Using a brush, paint the mixture on the flattened dough. Make sure to paint only the center part of the flat dough.",
      "Sprinkle some cheese over the painted area then seal the dough by folding opposite directions and rolling it until a long cylindrical shape is formed (about 14 inches in length).",
      "Start forming the spiral Ensaymada shape by crossing the two opposite ends of the dough. The first end should be placed under dough while the other end should be inserted in the middle. (see video for better comprehension)",
      "Place the dough in a baking tray with wax paper and cover with cloth. Set aside to rise for another 45 minutes",
      "Pre-heat the oven at 350 degrees Fahrenheit for 10 minutes. Remove cloth on top of the tray and bake the dough for 15 minutes at 350 degrees Fahrenheit.",
      "Remove the baked Ensaymada from the oven. Using the remaining melted butter and sugar mixture, paint the top of the baked ensaymada and sprinkle additional cheese.",
      "Serve hot. Share and Enjoy!"
    ],
    "cooking_time": "35 minutes",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/filipino-pastry-bread-baking-ensemada-ensaimada-ensaymada-recipe/",
    "image_url": "",
    "image_path": "",
    "category": "Other Filipino Dishes"
  },
  {
    "title": "Max’s style Fried Chicken",
    "ingredients": [
      "▢ 1 whole spring chicken cornish game hen",
      "▢ 6 pieces dried bay leaves",
      "▢ 1/4 cup chopped cilantro or parsley",
      "▢ 4 cups water",
      "▢ 3 cups cooking oil",
      "▢ 2 tsp salt",
      "▢ 1 tsp ground black pepper"
    ],
    "instructions": [
      "In a steamer, pour the water and bring to a boil.",
      "Add the dried bay leaves and chopped cilantro in the boiling water",
      "Steam the chicken for 45 minutes",
      "Remove the chicken from the steamer and allow the excess liquid to drip. Let the chicken cool down.",
      "Rub salt and pepper all over the chicken.",
      "In a deep-fryer or tall pot, pour the cooking oil and apply heat.",
      "When the cooking oil is hot enough, deep-fry the chicken for about 12 minutes. (If the chicken is not entirely immersed in oil, flip the chicken to fry the other side for another 12 minutes or until color turns golden brown)",
      "Remove the chicken from the fryer and allow oil to drip.",
      "Serve hot with fried kamote (fried sweet potato). Share and Enjoy!"
    ],
    "cooking_time": "1 hour",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/filipino-food-max-style-fried-chicken-recipe/",
    "image_url": "",
    "image_path": "",
    "category": "Chicken Dishes"
  }
]