[
  {
    "title": "Vegetarian Pancit Canton Recipe",
    "ingredients": [
      "▢ 2 ounces Shiitake mushroom dried",
      "▢ 8 ounces Pancit Canton",
      "▢ 3 tablespoons vegetarian oyster sauce",
      "▢ 4 tablespoons soy sauce",
      "▢ 1 piece onion sliced",
      "▢ 4 cloves garlic crushed",
      "▢ 2 stalks celery chopped",
      "▢ 2 cups water",
      "▢ 3 tablespoons parsley chopped",
      "▢ 1 ½ cups cabbage shredded",
      "▢ 1 piece carrot julienne",
      "▢ 15 pieces snap peas",
      "▢ 6 tablespoons cooking oil",
      "▢ Ground black pepper to taste"
    ],
    "instructions": [
      "Combine dried mushrooms and warm water in a bowl. Soak until mushroom softens. Slice mushrooms. Save aside the water for later.",
      "Heat 3 tablespoons of cooking oil in a pot. Stir-fry snap peas, cabbage, and carrot for 1 ½ minutes. Remove and set aside.",
      "On the same pot, add remaining oil. Saute onion, garlic, and celery until onion softens.",
      "Add mushrooms. Saute for 2 minutes.",
      "Add oyster sauce and soy sauce. Pour water used to soak mushrooms. Let boil. Cover and cook in medium heat for 10 minutes.",
      "Add parsley. Stir.",
      "Add pancit canton. Cover and cook for 2 minutes. This will allow the noodles to absorb steam to make it softer.",
      "Toss the noodles. Cover the pot and continue to cook in low heat for 3 minutes.",
      "Add stir-fried vegetables. Toss.",
      "Season with ground black pepper. Toss and transfer to a serving plate."
    ],
    "cooking_time": "30 minutes",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/vegetarian-pancit-canton-recipe/",
    "image_url": "",
    "image_path": "",
    "category": "Noodles"
  },
  {
    "title": "Chicken Sotanghon Soup",
    "ingredients": [
      "▢ 1 1/2 lbs. chicken breast",
      "▢ 1 piece Knorr Chicken Cube",
      "▢ 2 1/2 ounces sotanghon noodles",
      "▢ 7 cups water",
      "▢ 1 piece dried bay leaves",
      "▢ 1 1/2 cups cabbage shredded",
      "▢ 1 piece carrot julienne",
      "▢ 1/2 cup scallions chopped",
      "▢ 2 stalks  celery chopped",
      "▢ 1 piece onion chopped",
      "▢ 5 cloves garlic minced",
      "▢ 2 tablespoons garlic roasted",
      "▢ Fish sauce and ground black pepper to taste",
      "▢ 3/4 cups annatto water",
      "▢ 3 tablespoons cooking oil"
    ],
    "instructions": [
      "Prepare the chicken by boiling water ina cooking pot. Add bay leaf. Put the chicken breast in the pot. Cover and boil in medium heat for 20 minutes. Remove chicken from the pot and put in a clean plate. Let it cool down. Save the chicken stock. Shred the chicken and set aside.",
      "Heat oil in a large pot. Saute garlic until light brown. Add onion and celery. Saute until onion softens.",
      "Put the shredded chicken in the pot and then saute for 2 minutes.",
      "Pour chicken stock and let boil.",
      "Add Knorr Chicken Cube. Stir.",
      "Add annatto water and sotanghon noodles. Cover and cook for 10 minutes.",
      "Put carrots and cabbage into the pot. Cook for 5 minutes.",
      "Season with fish sauce and ground black pepper.",
      "Put some roasted garlic and chopped scallions. Stir.",
      "Transfer to a serving bowl. Serve. Share and enjoy!"
    ],
    "cooking_time": "38 minutes",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/chicken-sotanghon-soup-recipe/",
    "image_url": "",
    "image_path": "",
    "category": "Noodles"
  },
  {
    "title": "Dyanamite Lumpia",
    "ingredients": [
      "▢ 8 pieces long green pepper",
      "▢ 4 ounces cheddar cheese",
      "▢ 8 pieces lumpia wrapper",
      "▢ 2 cups cooking oil",
      "▢ 6 ounces ground pork",
      "▢ 1 piece onion minced",
      "▢ 3 cloves garlic crushed and minced",
      "▢ 1 piece egg",
      "▢ 2 tablespoons cooking oil",
      "▢ Salt and ground black pepper to taste"
    ],
    "instructions": [
      "Prepare the ground pork stuffing by heating 3 tablespoons oil in a pan. Saute garlic and onion until the latter softens. Add ground pork. Saute until medium brown. Season with salt and ground black pepper. Remove from the pan and put on a large bowl. Let it cool down. 6 ounces ground pork, 1 piece onion, 3 cloves garlic, Salt and ground black pepper to taste, 2 tablespoons cooking oil",
      "Beat 1 piece of egg and pour into the cooked ground pork. Mix well. Set aside.1 piece egg",
      "Slice one side of the peppers lengthwise all the way to the bottom. Remove the seeds by gently scraping using a small spoon or a butter knife. Set aside.8 pieces long green pepper",
      "Slice the cheddar cheese into long pieces. Stuff individual slices of cheese into each pepper. Sccop the cooked meat mixture and stuff into the chili peppers. Make sure that there is enough meat.4 ounces cheddar cheese",
      "Wrap the stuffed peppers in lumpia wrapper.8 pieces lumpia wrapper",
      "Heat 2 cups of oil in a pan. Fry each piece of dynamite lumpia in medium heat for 2 minutes per side or until lumpia wrapper turns golden brown. Note: you may fry longer if needed.2 cups cooking oil",
      "Remove from pan and place over a wire rack. Let it cool down. Arrange in a serving plate and then serve with your favorite condiment.",
      "Share and enjoy!"
    ],
    "cooking_time": "28 minutes",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/dyanamite-lumpia/",
    "image_url": "",
    "image_path": "",
    "category": "Vegetable Dishes"
  },
  {
    "title": "Soup Number 5",
    "ingredients": [
      "▢ 2 lbs. Ox bat and balls",
      "▢ 2 bunches  lemongrass",
      "▢ 1 set sibot herb mix",
      "▢ 3 pieces Thai chili pepper optional",
      "▢ 3 tablespoons green onion chopped",
      "▢ 3 thumbs ginger julienne",
      "▢ 2 pieces onions sliced",
      "▢ 8 cloves garlic crushed and chopped",
      "▢ 12 cups water",
      "▢ 2 cups beef broth",
      "▢ 2 teaspoons cornstarch",
      "▢ 2 teaspoons granulated white sugar",
      "▢ 1/8 teaspoon ground black pepper",
      "▢ 3 tablespoons fish sauce patis",
      "▢ 3 tablespoons cooking oil"
    ],
    "instructions": [
      "Boil 6 cups water in a cooking pot.",
      "Put Ox bat and balls. Continue to boil for 15 to 20 minutes. Remove from the cooking pot and wash with running water. Discard the water.",
      "Pour 6 cups water in a cooking pot. Let boil. Add sibot herb mix and lemongrass. Cook for 5 minutes.",
      "Add bat and balls into the pot. Continue to cook for 3 to 4 hours or until tender. Note: you can use a pressure cooker to tenderize it quickly. Add water as needed.",
      "Remove the meat from the pot. Let it cool down and then slice into smaller pieces. Filter the liquid using a kitchen sieve to separate the solid ingredients. Set aside.",
      "Heat oil in a cooking pot. Saute garlic, onion, and ginger until garlic browns and onion softens.",
      "Add the sliced bat and balls and chopped Thai chili. Saute for 2 minutes.",
      "Pour the filtered liquid and add beef broth. Let boil. Cook for 20 minutes.",
      "Season with fish sauce and ground black pepper and add sugar. Cook for 5 minutes more.",
      "Make the soup thicker by pouring a mixture composed of cornstarch and water. Stir.",
      "Transfer to a serving bowl. Serve.",
      "Share and enjoy!"
    ],
    "cooking_time": "N/A",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/soup-number-5/",
    "image_url": "",
    "image_path": "",
    "category": "Seafood"
  },
  {
    "title": "Inihaw na Bangus Recipe (Grilled Milkfish)",
    "ingredients": [
      "▢ 1 piece milkfish bangus, with scales but guts removed",
      "▢ 1 piece tomato ripe, diced",
      "▢ 1 piece red onion diced",
      "▢ 1 piece lemon or 3 pieces calamansi (optional)",
      "▢ 1 tablespoon ginger minced",
      "▢ 2 teaspoons salt",
      "▢ 1/2 teaspoon ground black pepper"
    ],
    "instructions": [
      "Wash the milk fish. Pat it dry using a paper towel.",
      "Open the incision and then rub the salt on the inside of the dish. The fish should have an incision either above or below the belly area.",
      "Meanwhile, combine tomato, onion, and ginger in a large bowl. Squeeze some lemon juice in and add the ground black pepper. Gently stir.",
      "Stuff the mixture inside the milkfish.",
      "Grill the fish in medium heat for about 10 to 12 minutes per side.",
      "Serve with toyomansi and steamed rice.",
      "Share and enjoy!"
    ],
    "cooking_time": "30 minutes",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/inihaw-na-bangus-recipe/",
    "image_url": "",
    "image_path": "",
    "category": "Pork Dishes"
  },
  {
    "title": "Eggplant Salad (Ensaladang Talong)",
    "ingredients": [
      "▢ 2 pieces Chinese eggplant",
      "▢ 2 pieces tomato",
      "▢ 1 piece onion",
      "▢ ¾ cup vinegar white",
      "▢ ½ teaspoon salt",
      "▢ ¼ teaspoon ground black pepper",
      "▢ 2 tablespoons shrimp paste bagoong"
    ],
    "instructions": [
      "Grill the eggplant (or cook directly on stove top)",
      "Peel the skin, cut the stem, and mash lightly using a fork.",
      "Cube the tomatoes and onion.",
      "Combine the chopped tomatoes, onion, mashed eggplant, salt, ground black pepper, and vinegar then toss to mix the ingredients.",
      "Top with shrimp paste.",
      "Serve. Share and Enjoy"
    ],
    "cooking_time": "15 minutes",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/healthy-ensaladang-talong-eggplant-salad-recipe/",
    "image_url": "",
    "image_path": "",
    "category": "Other Filipino Dishes"
  },
  {
    "title": "Dinuguan Recipe",
    "ingredients": [
      "▢ 1 lb pork cut into cubes",
      "▢ 1 cup vinegar",
      "▢ 2 pieces long green pepper",
      "▢ 1 1/2 tablespoon brown sugar",
      "▢ 1 piece onion chopped finely",
      "▢ 1 tablespoon garlic minced",
      "▢ 3 tablespoon cooking oil",
      "▢ 1 cup water",
      "▢ 10 oz pork blood",
      "▢ 1  piece pork cube boullion",
      "▢ salt and pepper to taste"
    ],
    "instructions": [
      "Heat oil in a pan. Sauté garlic and onion.",
      "Once the onion softens, add pork. Continue to sauté for 5 minutes or until light brown.",
      "Pour water. Let boil.",
      "Add  pork cube. Cook in low heat until the meat tenderizes.",
      "Add pork blood. Stir. Cook for 8 to 10 minutes while stirring.",
      "Pour vinegar and add sugar and long green pepper. Cook for 12 to 15 minutes.",
      "Season with salt and pepper as needed. Serve hot with puto."
    ],
    "cooking_time": "1 hour",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/dinuguan-blood-stew/",
    "image_url": "",
    "image_path": "",
    "category": "Desserts"
  },
  {
    "title": "Tinolang Tahong Recipe",
    "ingredients": [
      "▢ 1 lb mussels tahong, cleaned",
      "▢ 2 cups spinach or hot pepper leaves",
      "▢ 3 thumbs ginger julienned",
      "▢ 1 piece onion sliced",
      "▢ 5 cloves garlic pounded",
      "▢ 1 1/2 teaspoons salt or 3 tbsp fish sauce",
      "▢ 1/2 teaspoon ground black pepper",
      "▢ 3 cups water",
      "▢ 2 tablespoons cooking oil",
      "▢ 2 pieces long green pepper optional"
    ],
    "instructions": [
      "Heat a cooking pot and pour-in cooking oil.",
      "Saute garlic and onion.",
      "Add ginger and mussels, and then cook for a minute.",
      "Pour-in water. let boil. Cook for 5 minutes.",
      "Put-in the spinach or hot pepper leaves. Cook for 3 minutes.",
      "Add salt (or fish sauce) and pepper. Stir.",
      "Transfer to a serving bowl. Serve. Share and enjoy."
    ],
    "cooking_time": "25 minutes",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/tinolang-tahong/",
    "image_url": "",
    "image_path": "",
    "category": "Chicken Dishes"
  },
  {
    "title": "Homemade Chicken Nuggets",
    "ingredients": [
      "▢ 8 oz. chicken breasts skinless and boneless",
      "▢ 1 cup bread crumbs",
      "▢ 1 cup buttermilk",
      "▢ 1/2  piece lemon",
      "▢ 1 teaspoon salt",
      "▢ 1/2 teaspoon ground black pepper"
    ],
    "instructions": [
      "Cut the chicken breast into 2x2 inch pieces.",
      "Place the chicken in a bowl and then pour-in the buttermilk. Squeeze the lemon. Mix well. Cover and place in the fridge to marinate for at least 3 hours (The longer it marinates the better the texture gets).",
      "Preheat the oven to 400 degrees Fahrenheit.",
      "Sprinkle salt and pepper on the chicken.",
      "Manually press the  chicken slices to flatten. Roll the chicken over the breadcrumbs. Make sure that the chicken is properly coated.",
      "Place a wire rack over a baking tray. Make sure that the wire rack can withstand high oven temperature. Arrange the chicken pieces over the wire rack.",
      "Bake for 14 to 16 minutes.",
      "Adjust the oven settings to broil. Let it stay for 3 to 5 minutes or until the color is light to golden brown.",
      "Remove from the oven and transfer to a serving plate.",
      "Serve. Share and enjoy!"
    ],
    "cooking_time": "25 minutes",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/baked-chicken-nuggets-recipe/",
    "image_url": "",
    "image_path": "",
    "category": "Chicken Dishes"
  },
  {
    "title": "Lechon Kawali Recipe",
    "ingredients": [
      "▢ 2 lbs. pork belly",
      "▢ 2 tablespoons salt",
      "▢ 2 tablespoons whole pepper corn",
      "▢ 5 pieces dried bay leaves",
      "▢ 3 cups cooking Oil",
      "▢ 34 ounces Water"
    ],
    "instructions": [
      "Pour water on cooking pot. Boil",
      "Add the pork belly and 1 tablespoon of salt. Put some pepper pepper and bay leaves. Boil for 30 minutes or until meat gets tender",
      "Remove the meat from the pot and let it cool down for a few minutes",
      "Spread 1 tablespoon of salt on the pork belly. Make sure to distribute it evenly on all sections",
      "Start to deep fry the boiled meat. Heat oil on a cooking pot.",
      "Put each piece of boiled pork belly into the hot oil with extra caution. Fry until crispy. Turn the meat over to completely fry the opposite side until crispy. Note: be extra careful when frying as oil can splatter. You can use the cover of the pot to cover it while oil splatters, but do not cover completely as steam will be trapped. It will cause more splatters.",
      "Remove the meat from the cooking pot. Arrange on a wire rack to cool down.  Slice according to desired portions",
      "Serve with lechon sauce. Share and Enjoy!"
    ],
    "cooking_time": "1 hour",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/lechon-kawali/",
    "image_url": "",
    "image_path": "",
    "category": "Pork Dishes"
  },
  {
    "title": "Pinoy Pork Barbecue",
    "ingredients": [
      "▢ 3 lbs pork shoulder sliced into thin pieces",
      "▢ 3 tablespoons Knorr Liquid Seasoning",
      "▢ 4 pieces calamansi or 2 pieces lime",
      "▢ ½ cup banana ketchup",
      "▢ ½ cup soy sauce",
      "▢ 2 ½ tablespoons brown sugar",
      "▢ 2 teaspoons garlic powder",
      "▢ 5 tablespoons soy sauce",
      "▢ 1 tablespoon Knorr Liquid Seasoning",
      "▢ 1 piece calamansi or ½ lime",
      "▢ ¼ cup banana ketchup",
      "▢ 2 teaspoons vegetable oil"
    ],
    "instructions": [
      "Place the pork in a large bowl. Add all the BBQ marinade ingredients. Mix well. Cover the bowl and place inside the refrigerator. Marinate for at least 3 hours. Note: marinating for a longer period of time is ideal for the meat to absorb the flavors from the marinade.",
      "Skewer the marinated pork in bamboo skewers.",
      "Prepare the basting sauce by combining all the basting sauce ingredients in a bowl. Mix well and set aside.",
      "Heat-up the grill. Grill the pork barbeque for 2 minutes. Baste the top part using a brush and then turn it over. Baste the top again. Continue to grill one side for 2 to 2 ½ minutes while basting every time its flipped until the BBQ is done.",
      "Arrange in a serving plate. Serve with rice on the side and a dipping sauce of  spicy vinegar. Share and enjoy!"
    ],
    "cooking_time": "1 hour",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/pinoy-pork-barbeque-inihaw-recipe/",
    "image_url": "",
    "image_path": "",
    "category": "Pork Dishes"
  },
  {
    "title": "Tapsilog Recipe",
    "ingredients": [
      "▢ 1 lb. beef sirloin sliced thinly",
      "▢ 3 pieces eggs",
      "▢ 6 tablespoons cooking oil",
      "▢ 3 tablespoons Knorr Liquid Seasoning",
      "▢ 6 cloves crushed garlic",
      "▢ ¾ cups pineapple juice",
      "▢ 2 tablespoons brown sugar",
      "▢ ¼ teaspoon ground white pepper",
      "▢ 5 cups leftover rice",
      "▢ 1 teaspoon salt",
      "▢ 5 cloves garlic crushed"
    ],
    "instructions": [
      "Prepare the tapa by placing the beef in a large bowl. Combine with all the tapa marinade ingredients. Mix well and cover the bowl. Place inside the fridge and marinate overnight.",
      "Cook the garlic fried rice (sinangag na kanin) by heating 3 tablespoons cooking oil in a pan. Add crushed garlic. Cook until garlic turns light brown. Add the leftover rice. Stir-fry for 3 minutes.",
      "Season with salt. Continue to stir-fry for 3 to 5 minutes. Set aside.",
      "Start to cook the tapa. Heat a pan and pour the marinated beef into it, including the marinade. Add ¾ cups water. Let the mixture boil. Cover the pan and continue to cook until the liquid reduces to half. Add 3 tablespoons cooking oil into the mixture. Continue to cook until the liquid completely evaporates. Fry the beef tapa in remaining oil until medium brown. Set aside.",
      "Fry the egg by pouring 1 tablespoon oil on a pan. Crack a piece of egg and sprinkle enough salt on top. Cook for 30 seconds. Pour 2 tablespoons water on the side of the pan. Cover and let the water boil. Continue to cook until the egg yolks gets completely cooked by the steam.",
      "Arrange the beef tapa, sinangag, and fried egg on a large plate to form Tapsilog. Serve with vinegar as dipping sauce for tapa."
    ],
    "cooking_time": "40 minutes",
    "servings": "N/A",
    "url": "https://panlasangpinoy.com/tapsilog-recipe/",
    "image_url": "",
    "image_path": "",
    "category": "Rice Dishes"
  }
]